mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xg/common/s6e1b8xg.h
/*******************************************************************************
* DS_MODULE
*******************************************************************************/
typedef struct stc_ds_rck_ctl_field
{
        __IO   uint8_t  RTCCKE                   :1;
        __IO   uint8_t  CECCKE                   :1;
        __IO   uint8_t  RESERVED0                :6;
} stc_ds_rck_ctl_field_t;

typedef struct stc_ds_reg_ctl2_field
{
    union {
        struct {
            __IO   uint8_t  TT_SVD               :2;
            __IO   uint8_t  TT_SEL               :1;
            __IO   uint8_t  RESERVED0            :5;
        };
        struct {
            __IO   uint8_t  TT_SVD0              :1;
            __IO   uint8_t  TT_SVD1              :1;
            __IO   uint8_t  RESERVED1            :6;
        };
    };
} stc_ds_reg_ctl2_field_t;

typedef struct stc_ds_mosc_ctl_field
{
    union {
        struct {
            __IO   uint8_t  RESERVED0            :1;
            __IO   uint8_t  IMAINSEL             :2;
            __IO   uint8_t  RESERVED2            :5;
        };
        struct {
            __IO   uint8_t  RESERVED1            :1;
            __IO   uint8_t  IMAINSEL0            :1;
            __IO   uint8_t  IMAINSEL1            :1;
            __IO   uint8_t  RESERVED3            :5;
        };
    };
} stc_ds_mosc_ctl_field_t;

typedef struct stc_ds_cal_ctl_field
{
        __IO   uint8_t  CALSTART                 :1;
        __IO   uint8_t  RESERVED0                :1;
        __IO   uint8_t  BGRSEL                   :1;
        __IO   uint8_t  CALDONE                  :1;
        __IO   uint8_t  RESERVED1                :4;
} stc_ds_cal_ctl_field_t;

typedef struct stc_ds_cal_set_field
{
    union {
        struct {
            __IO   uint8_t  DSTB                 :5;
            __IO   uint8_t  RESERVED0            :3;
        };
        struct {
            __IO   uint8_t  DSTB0                :1;
            __IO   uint8_t  DSTB1                :1;
            __IO   uint8_t  DSTB2                :1;
            __IO   uint8_t  DSTB3                :1;
            __IO   uint8_t  DSTB4                :1;
            __IO   uint8_t  RESERVED1            :3;
        };
    };
} stc_ds_cal_set_field_t;

typedef struct stc_ds_pmd_ctl_field
{
        __IO   uint8_t  RTCE                     :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_ds_pmd_ctl_field_t;

typedef struct stc_ds_wrfsr_field
{
        __IO   uint8_t  WINITX                   :1;
        __IO   uint8_t  WLVDH                    :1;
        __IO   uint8_t  RESERVED0                :6;
} stc_ds_wrfsr_field_t;

typedef struct stc_ds_wifsr_field
{
        __IO  uint16_t  WRTCI                    :1;
        __IO  uint16_t  WLVDI                    :1;
        __IO  uint16_t  WUI0                     :1;
        __IO  uint16_t  WUI1                     :1;
        __IO  uint16_t  WUI2                     :1;
        __IO  uint16_t  WUI3                     :1;
        __IO  uint16_t  WUI4                     :1;
        __IO  uint16_t  WUI5                     :1;
        __IO  uint16_t  WCEC0I                   :1;
        __IO  uint16_t  WCEC1I                   :1;
        __IO  uint16_t  WUI6                     :1;
        __IO  uint16_t  WUI7                     :1;
        __IO  uint16_t  WUI8                     :1;
        __IO  uint16_t  WUI9                     :1;
        __IO  uint16_t  WUI10                    :1;
        __IO  uint16_t  WUI11                    :1;
} stc_ds_wifsr_field_t;

typedef struct stc_ds_wier_field
{
        __IO  uint16_t  WRTCE                    :1;
        __IO  uint16_t  WLVDE                    :1;
        __IO  uint16_t  RESERVED0                :1;
        __IO  uint16_t  WUI1E                    :1;
        __IO  uint16_t  WUI2E                    :1;
        __IO  uint16_t  WUI3E                    :1;
        __IO  uint16_t  WUI4E                    :1;
        __IO  uint16_t  WUI5E                    :1;
        __IO  uint16_t  WCEC0E                   :1;
        __IO  uint16_t  WCEC1E                   :1;
        __IO  uint16_t  WUI6E                    :1;
        __IO  uint16_t  WUI7E                    :1;
        __IO  uint16_t  WUI8E                    :1;
        __IO  uint16_t  WUI9E                    :1;
        __IO  uint16_t  WUI10E                   :1;
        __IO  uint16_t  WUI11E                   :1;
} stc_ds_wier_field_t;

typedef struct stc_ds_wilvr_field
{
        __IO  uint16_t  WUI1LV                   :1;
        __IO  uint16_t  WUI2LV                   :1;
        __IO  uint16_t  WUI3LV                   :1;
        __IO  uint16_t  WUI4LV                   :1;
        __IO  uint16_t  WUI5LV                   :1;
        __IO  uint16_t  WUI6LV                   :1;
        __IO  uint16_t  WUI7LV                   :1;
        __IO  uint16_t  WUI8LV                   :1;
        __IO  uint16_t  WUI9LV                   :1;
        __IO  uint16_t  WUI10LV                  :1;
        __IO  uint16_t  WUI11LV                  :1;
        __IO  uint16_t  RESERVED0                :5;
} stc_ds_wilvr_field_t;

typedef struct stc_ds_dsramr_field
{
    union {
        struct {
            __IO   uint8_t  SRAMR                :2;
            __IO   uint8_t  RESERVED0            :6;
        };
        struct {
            __IO   uint8_t  SRAMR0               :1;
            __IO   uint8_t  SRAMR1               :1;
            __IO   uint8_t  RESERVED1            :6;
        };
    };
} stc_ds_dsramr_field_t;

typedef struct stc_ds_stbflashpdx_field
{
        __IO   uint8_t  STBFLASHPDX              :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_ds_stbflashpdx_field_t;

/*******************************************************************************
* DSTC_MODULE
*******************************************************************************/
typedef struct stc_dstc_hwdesp_field
{
    union {
        struct {
            __IO  uint32_t  CHANNEL              :8;
            __IO  uint32_t  RESERVED0            :8;
            __IO  uint32_t  HWDESP               :14;
            __IO  uint32_t  RESERVED2            :2;
        };
        struct {
            __IO  uint32_t  CHANNEL0             :1;
            __IO  uint32_t  CHANNEL1             :1;
            __IO  uint32_t  CHANNEL2             :1;
            __IO  uint32_t  CHANNEL3             :1;
            __IO  uint32_t  CHANNEL4             :1;
            __IO  uint32_t  CHANNEL5             :1;
            __IO  uint32_t  CHANNEL6             :1;
            __IO  uint32_t  CHANNEL7             :1;
            __IO  uint32_t  RESERVED1            :8;
            __IO  uint32_t  HWDESP0              :1;
            __IO  uint32_t  HWDESP1              :1;
            __IO  uint32_t  HWDESP2              :1;
            __IO  uint32_t  HWDESP3              :1;
            __IO  uint32_t  HWDESP4              :1;
            __IO  uint32_t  HWDESP5              :1;
            __IO  uint32_t  HWDESP6              :1;
            __IO  uint32_t  HWDESP7              :1;
            __IO  uint32_t  HWDESP8              :1;
            __IO  uint32_t  HWDESP9              :1;
            __IO  uint32_t  HWDESP10             :1;
            __IO  uint32_t  HWDESP11             :1;
            __IO  uint32_t  HWDESP12             :1;
            __IO  uint32_t  HWDESP13             :1;
            __IO  uint32_t  RESERVED3            :2;
        };
    };
} stc_dstc_hwdesp_field_t;

typedef struct stc_dstc_cfg_field
{
    union {
        struct {
            __IO   uint8_t  SWINTE               :1;
            __IO   uint8_t  ERINTE               :1;
            __IO   uint8_t  RBDIS                :1;
            __IO   uint8_t  ESTE                 :1;
            __IO   uint8_t  SWPR                 :3;
            __IO   uint8_t  RESERVED1            :1;
        };
        struct {
            __IO   uint8_t  RESERVED0            :4;
            __IO   uint8_t  SWPR0                :1;
            __IO   uint8_t  SWPR1                :1;
            __IO   uint8_t  SWPR2                :1;
            __IO   uint8_t  RESERVED2            :1;
        };
    };
} stc_dstc_cfg_field_t;

typedef struct stc_dstc_swtr_field
{
    union {
        struct {
            __IO  uint16_t  SWDESP               :14;
            __IO  uint16_t  SWREQ                :1;
            __IO  uint16_t  SWST                 :1;
        };
        struct {
            __IO  uint16_t  SWDESP0              :1;
            __IO  uint16_t  SWDESP1              :1;
            __IO  uint16_t  SWDESP2              :1;
            __IO  uint16_t  SWDESP3              :1;
            __IO  uint16_t  SWDESP4              :1;
            __IO  uint16_t  SWDESP5              :1;
            __IO  uint16_t  SWDESP6              :1;
            __IO  uint16_t  SWDESP7              :1;
            __IO  uint16_t  SWDESP8              :1;
            __IO  uint16_t  SWDESP9              :1;
            __IO  uint16_t  SWDESP10             :1;
            __IO  uint16_t  SWDESP11             :1;
            __IO  uint16_t  SWDESP12             :1;
            __IO  uint16_t  SWDESP13             :1;
            __IO  uint16_t  RESERVED0            :2;
        };
    };
} stc_dstc_swtr_field_t;

