mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xg/common/s6e1b8xg.h
typedef struct stc_intreq_irq03mon_field
{
    union {
        struct {
            __IO  uint32_t  WAVE0INT             :4;
            __IO  uint32_t  RESERVED0            :28;
        };
        struct {
            __IO  uint32_t  WAVE0INT0            :1;
            __IO  uint32_t  WAVE0INT1            :1;
            __IO  uint32_t  WAVE0INT2            :1;
            __IO  uint32_t  WAVE0INT3            :1;
            __IO  uint32_t  RESERVED1            :28;
        };
    };
} stc_intreq_irq03mon_field_t;

typedef struct stc_intreq_irq04mon_field
{
        __IO  uint32_t  EXTINT0                  :1;
        __IO  uint32_t  EXTINT1                  :1;
        __IO  uint32_t  EXTINT2                  :1;
        __IO  uint32_t  EXTINT3                  :1;
        __IO  uint32_t  EXTINT4                  :1;
        __IO  uint32_t  EXTINT5                  :1;
        __IO  uint32_t  EXTINT6                  :1;
        __IO  uint32_t  EXTINT7                  :1;
        __IO  uint32_t  RESERVED0                :24;
} stc_intreq_irq04mon_field_t;

typedef struct stc_intreq_irq05mon_field
{
        __IO  uint32_t  EXTINT8                  :1;
        __IO  uint32_t  EXTINT9                  :1;
        __IO  uint32_t  EXTINT10                 :1;
        __IO  uint32_t  EXTINT11                 :1;
        __IO  uint32_t  EXTINT12                 :1;
        __IO  uint32_t  EXTINT13                 :1;
        __IO  uint32_t  EXTINT14                 :1;
        __IO  uint32_t  EXTINT15                 :1;
        __IO  uint32_t  EXTINT16                 :1;
        __IO  uint32_t  EXTINT17                 :1;
        __IO  uint32_t  EXTINT18                 :1;
        __IO  uint32_t  EXTINT19                 :1;
        __IO  uint32_t  EXTINT20                 :1;
        __IO  uint32_t  EXTINT21                 :1;
        __IO  uint32_t  EXTINT22                 :1;
        __IO  uint32_t  EXTINT23                 :1;
        __IO  uint32_t  RESERVED0                :16;
} stc_intreq_irq05mon_field_t;

typedef struct stc_intreq_irq06mon_field
{
    union {
        struct {
            __IO  uint32_t  TIMINT               :2;
            __IO  uint32_t  RESERVED0            :30;
        };
        struct {
            __IO  uint32_t  TIMINT0              :1;
            __IO  uint32_t  TIMINT1              :1;
            __IO  uint32_t  RESERVED1            :30;
        };
    };
} stc_intreq_irq06mon_field_t;

typedef struct stc_intreq_irq07mon_field
{
        __IO  uint32_t  MFSINT                   :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_intreq_irq07mon_field_t;

typedef struct stc_intreq_irq08mon_field
{
    union {
        struct {
            __IO  uint32_t  MFSINT               :2;
            __IO  uint32_t  RESERVED0            :30;
        };
        struct {
            __IO  uint32_t  MFSINT0              :1;
            __IO  uint32_t  MFSINT1              :1;
            __IO  uint32_t  RESERVED1            :30;
        };
    };
} stc_intreq_irq08mon_field_t;

typedef struct stc_intreq_irq09mon_field
{
        __IO  uint32_t  MFSINT                   :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_intreq_irq09mon_field_t;

typedef struct stc_intreq_irq10mon_field
{
    union {
        struct {
            __IO  uint32_t  MFSINT               :2;
            __IO  uint32_t  RESERVED0            :30;
        };
        struct {
            __IO  uint32_t  MFSINT0              :1;
            __IO  uint32_t  MFSINT1              :1;
            __IO  uint32_t  RESERVED1            :30;
        };
    };
} stc_intreq_irq10mon_field_t;

typedef struct stc_intreq_irq11mon_field
{
        __IO  uint32_t  MFSINT                   :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_intreq_irq11mon_field_t;

typedef struct stc_intreq_irq12mon_field
{
    union {
        struct {
            __IO  uint32_t  MFSINT               :2;
            __IO  uint32_t  RESERVED0            :30;
        };
        struct {
            __IO  uint32_t  MFSINT0              :1;
            __IO  uint32_t  MFSINT1              :1;
            __IO  uint32_t  RESERVED1            :30;
        };
    };
} stc_intreq_irq12mon_field_t;

typedef struct stc_intreq_irq13mon_field
{
        __IO  uint32_t  MFSINT                   :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_intreq_irq13mon_field_t;

typedef struct stc_intreq_irq14mon_field
{
    union {
        struct {
            __IO  uint32_t  MFSINT               :2;
            __IO  uint32_t  RESERVED0            :30;
        };
        struct {
            __IO  uint32_t  MFSINT0              :1;
            __IO  uint32_t  MFSINT1              :1;
            __IO  uint32_t  RESERVED1            :30;
        };
    };
} stc_intreq_irq14mon_field_t;

typedef struct stc_intreq_irq15mon_field
{
        __IO  uint32_t  MFSINT                   :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_intreq_irq15mon_field_t;

typedef struct stc_intreq_irq16mon_field
{
    union {
        struct {
            __IO  uint32_t  MFSINT               :2;
            __IO  uint32_t  RESERVED0            :30;
        };
        struct {
            __IO  uint32_t  MFSINT0              :1;
            __IO  uint32_t  MFSINT1              :1;
            __IO  uint32_t  RESERVED1            :30;
        };
    };
} stc_intreq_irq16mon_field_t;

typedef struct stc_intreq_irq17mon_field
{
        __IO  uint32_t  MFSINT                   :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_intreq_irq17mon_field_t;

typedef struct stc_intreq_irq18mon_field
{
    union {
        struct {
            __IO  uint32_t  MFSINT               :2;
            __IO  uint32_t  RESERVED0            :30;
        };
        struct {
            __IO  uint32_t  MFSINT0              :1;
            __IO  uint32_t  MFSINT1              :1;
            __IO  uint32_t  RESERVED1            :30;
        };
    };
} stc_intreq_irq18mon_field_t;

typedef struct stc_intreq_irq19mon_field
{
        __IO  uint32_t  MFSINT                   :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_intreq_irq19mon_field_t;

typedef struct stc_intreq_irq20mon_field
{
    union {
        struct {
            __IO  uint32_t  MFSINT               :2;
            __IO  uint32_t  RESERVED0            :30;
        };
        struct {
            __IO  uint32_t  MFSINT0              :1;
            __IO  uint32_t  MFSINT1              :1;
            __IO  uint32_t  RESERVED1            :30;
        };
    };
} stc_intreq_irq20mon_field_t;

