mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xg/common/s6e1b8xg.h
/*******************************************************************************
* LCDC_MODULE
*******************************************************************************/
typedef struct stc_lcdc_lcdcc1_field
{
    union {
        struct {
            __IO   uint8_t  RESERVED0            :2;
            __IO   uint8_t  MS                   :3;
            __IO   uint8_t  VSEL                 :1;
            __IO   uint8_t  LCDEN                :1;
            __IO   uint8_t  RESERVED2            :1;
        };
        struct {
            __IO   uint8_t  RESERVED1            :2;
            __IO   uint8_t  MS0                  :1;
            __IO   uint8_t  MS1                  :1;
            __IO   uint8_t  MS2                  :1;
            __IO   uint8_t  RESERVED3            :3;
        };
    };
} stc_lcdc_lcdcc1_field_t;

typedef struct stc_lcdc_lcdcc2_field
{
        __IO   uint8_t  LCDIF                    :1;
        __IO   uint8_t  LCDIEN                   :1;
        __IO   uint8_t  BK                       :1;
        __IO   uint8_t  INV                      :1;
        __IO   uint8_t  BLS8                     :1;
        __IO   uint8_t  RSEL                     :1;
        __IO   uint8_t  RESERVED0                :2;
} stc_lcdc_lcdcc2_field_t;

typedef struct stc_lcdc_lcdcc3_field
{
        __IO   uint8_t  RESERVED0                :1;
        __IO   uint8_t  VE0                      :1;
        __IO   uint8_t  VE1                      :1;
        __IO   uint8_t  VE2                      :1;
        __IO   uint8_t  VE3                      :1;
        __IO   uint8_t  VE4                      :1;
        __IO   uint8_t  BLSEL                    :1;
        __IO   uint8_t  PICTL                    :1;
} stc_lcdc_lcdcc3_field_t;

typedef struct stc_lcdc_lcdc_psr_field
{
    union {
        struct {
            __IO  uint32_t  CLKDIV               :22;
            __IO  uint32_t  CLKSEL               :1;
            __IO  uint32_t  RESERVED0            :9;
        };
        struct {
            __IO  uint32_t  CLKDIV0              :1;
            __IO  uint32_t  CLKDIV1              :1;
            __IO  uint32_t  CLKDIV2              :1;
            __IO  uint32_t  CLKDIV3              :1;
            __IO  uint32_t  CLKDIV4              :1;
            __IO  uint32_t  CLKDIV5              :1;
            __IO  uint32_t  CLKDIV6              :1;
            __IO  uint32_t  CLKDIV7              :1;
            __IO  uint32_t  CLKDIV8              :1;
            __IO  uint32_t  CLKDIV9              :1;
            __IO  uint32_t  CLKDIV10             :1;
            __IO  uint32_t  CLKDIV11             :1;
            __IO  uint32_t  CLKDIV12             :1;
            __IO  uint32_t  CLKDIV13             :1;
            __IO  uint32_t  CLKDIV14             :1;
            __IO  uint32_t  CLKDIV15             :1;
            __IO  uint32_t  CLKDIV16             :1;
            __IO  uint32_t  CLKDIV17             :1;
            __IO  uint32_t  CLKDIV18             :1;
            __IO  uint32_t  CLKDIV19             :1;
            __IO  uint32_t  CLKDIV20             :1;
            __IO  uint32_t  CLKDIV21             :1;
            __IO  uint32_t  RESERVED1            :10;
        };
    };
} stc_lcdc_lcdc_psr_field_t;

typedef struct stc_lcdc_lcdc_comen_field
{
        __IO   uint8_t  COM0                     :1;
        __IO   uint8_t  COM1                     :1;
        __IO   uint8_t  COM2                     :1;
        __IO   uint8_t  COM3                     :1;
        __IO   uint8_t  COM4                     :1;
        __IO   uint8_t  COM5                     :1;
        __IO   uint8_t  COM6                     :1;
        __IO   uint8_t  COM7                     :1;
} stc_lcdc_lcdc_comen_field_t;

typedef struct stc_lcdc_lcdc_segen1_field
{
        __IO  uint32_t  SEG00                    :1;
        __IO  uint32_t  SEG01                    :1;
        __IO  uint32_t  SEG02                    :1;
        __IO  uint32_t  SEG03                    :1;
        __IO  uint32_t  SEG04                    :1;
        __IO  uint32_t  SEG05                    :1;
        __IO  uint32_t  SEG06                    :1;
        __IO  uint32_t  SEG07                    :1;
        __IO  uint32_t  SEG08                    :1;
        __IO  uint32_t  SEG09                    :1;
        __IO  uint32_t  SEG10                    :1;
        __IO  uint32_t  SEG11                    :1;
        __IO  uint32_t  SEG12                    :1;
        __IO  uint32_t  SEG13                    :1;
        __IO  uint32_t  SEG14                    :1;
        __IO  uint32_t  SEG15                    :1;
        __IO  uint32_t  SEG16                    :1;
        __IO  uint32_t  SEG17                    :1;
        __IO  uint32_t  SEG18                    :1;
        __IO  uint32_t  SEG19                    :1;
        __IO  uint32_t  SEG20                    :1;
        __IO  uint32_t  SEG21                    :1;
        __IO  uint32_t  SEG22                    :1;
        __IO  uint32_t  SEG23                    :1;
        __IO  uint32_t  SEG24                    :1;
        __IO  uint32_t  SEG25                    :1;
        __IO  uint32_t  SEG26                    :1;
        __IO  uint32_t  SEG27                    :1;
        __IO  uint32_t  SEG28                    :1;
        __IO  uint32_t  SEG29                    :1;
        __IO  uint32_t  SEG30                    :1;
        __IO  uint32_t  SEG31                    :1;
} stc_lcdc_lcdc_segen1_field_t;

typedef struct stc_lcdc_lcdc_segen2_field
{
        __IO   uint8_t  SEG32                    :1;
        __IO   uint8_t  SEG33                    :1;
        __IO   uint8_t  SEG34                    :1;
        __IO   uint8_t  SEG35                    :1;
        __IO   uint8_t  SEG36                    :1;
        __IO   uint8_t  SEG37                    :1;
        __IO   uint8_t  SEG38                    :1;
        __IO   uint8_t  SEG39                    :1;
} stc_lcdc_lcdc_segen2_field_t;

