mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xg/common/s6e1b8xg.h
typedef struct stc_lcdc_lcdram08_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram08_field_t;

typedef struct stc_lcdc_lcdram09_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram09_field_t;

typedef struct stc_lcdc_lcdram10_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram10_field_t;

typedef struct stc_lcdc_lcdram11_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram11_field_t;

typedef struct stc_lcdc_lcdram12_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram12_field_t;

typedef struct stc_lcdc_lcdram13_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram13_field_t;

typedef struct stc_lcdc_lcdram14_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram14_field_t;

typedef struct stc_lcdc_lcdram15_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram15_field_t;

typedef struct stc_lcdc_lcdram16_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram16_field_t;

typedef struct stc_lcdc_lcdram17_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram17_field_t;

typedef struct stc_lcdc_lcdram18_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram18_field_t;

typedef struct stc_lcdc_lcdram19_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram19_field_t;

typedef struct stc_lcdc_lcdram20_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram20_field_t;

typedef struct stc_lcdc_lcdram21_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram21_field_t;

typedef struct stc_lcdc_lcdram22_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram22_field_t;

typedef struct stc_lcdc_lcdram23_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram23_field_t;

typedef struct stc_lcdc_lcdram24_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram24_field_t;

typedef struct stc_lcdc_lcdram25_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram25_field_t;

