mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xg/common/s6e1b8xg.h
/*******************************************************************************
* MFSI2S_MODULE
*******************************************************************************/
typedef struct stc_mfsi2s_cntlreg_field
{
        __IO  uint16_t  FRAML                    :1;
        __IO  uint16_t  RESERVED0                :2;
        __IO  uint16_t  I2SMOD                   :1;
        __IO  uint16_t  FSPL                     :1;
        __IO  uint16_t  I2SEN                    :1;
        __IO  uint16_t  CKOE                     :1;
        __IO  uint16_t  RESERVED1                :1;
        __IO  uint16_t  MSKB                     :1;
        __IO  uint16_t  RESERVED2                :1;
        __IO  uint16_t  I2SRUN                   :1;
        __IO  uint16_t  RESERVED3                :5;
} stc_mfsi2s_cntlreg_field_t;

typedef struct stc_mfsi2s_i2sclk_field
{
    union {
        struct {
            __IO  uint16_t  I2SDIV               :8;
            __IO  uint16_t  RESERVED0            :6;
            __IO  uint16_t  MCKOE                :1;
            __IO  uint16_t  MCKIE                :1;
        };
        struct {
            __IO  uint16_t  I2SDIV0              :1;
            __IO  uint16_t  I2SDIV1              :1;
            __IO  uint16_t  I2SDIV2              :1;
            __IO  uint16_t  I2SDIV3              :1;
            __IO  uint16_t  I2SDIV4              :1;
            __IO  uint16_t  I2SDIV5              :1;
            __IO  uint16_t  I2SDIV6              :1;
            __IO  uint16_t  I2SDIV7              :1;
            __IO  uint16_t  RESERVED1            :8;
        };
    };
} stc_mfsi2s_i2sclk_field_t;

typedef struct stc_mfsi2s_i2srst_field
{
    union {
        struct {
            __IO   uint8_t  I2SRST               :8;
        };
        struct {
            __IO   uint8_t  I2SRST0              :1;
            __IO   uint8_t  I2SRST1              :1;
            __IO   uint8_t  I2SRST2              :1;
            __IO   uint8_t  I2SRST3              :1;
            __IO   uint8_t  I2SRST4              :1;
            __IO   uint8_t  I2SRST5              :1;
            __IO   uint8_t  I2SRST6              :1;
            __IO   uint8_t  I2SRST7              :1;
        };
    };
} stc_mfsi2s_i2srst_field_t;

typedef struct stc_mfsi2s_i2sst_field
{
        __IO   uint8_t  CKSTP                    :1;
        __IO   uint8_t  BUSY                     :1;
        __IO   uint8_t  RESERVED0                :6;
} stc_mfsi2s_i2sst_field_t;

/*******************************************************************************
* MFT_MODULE
*******************************************************************************/
typedef struct stc_mft_ocsa10_field
{
        __IO   uint8_t  CST0                     :1;
        __IO   uint8_t  CST1                     :1;
        __IO   uint8_t  RESERVED0                :2;
        __IO   uint8_t  IOE0                     :1;
        __IO   uint8_t  IOE1                     :1;
        __IO   uint8_t  IOP0                     :1;
        __IO   uint8_t  IOP1                     :1;
} stc_mft_ocsa10_field_t;

typedef struct stc_mft_ocsb10_field
{
        __IO   uint8_t  OTD0                     :1;
        __IO   uint8_t  OTD1                     :1;
        __IO   uint8_t  RESERVED0                :2;
        __IO   uint8_t  CMOD                     :1;
        __IO   uint8_t  RESERVED1                :2;
        __IO   uint8_t  FM4                      :1;
} stc_mft_ocsb10_field_t;

typedef struct stc_mft_ocsd10_field
{
    union {
        struct {
            __IO   uint8_t  OCCP0BUFE            :2;
            __IO   uint8_t  OCCP1BUFE            :2;
            __IO   uint8_t  OCSE0BUFE            :2;
            __IO   uint8_t  OCSE1BUFE            :2;
        };
        struct {
            __IO   uint8_t  OCCP0BUFE0           :1;
            __IO   uint8_t  OCCP0BUFE1           :1;
            __IO   uint8_t  OCCP1BUFE0           :1;
            __IO   uint8_t  OCCP1BUFE1           :1;
            __IO   uint8_t  OCSE0BUFE0           :1;
            __IO   uint8_t  OCSE0BUFE1           :1;
            __IO   uint8_t  OCSE1BUFE0           :1;
            __IO   uint8_t  OCSE1BUFE1           :1;
        };
    };
} stc_mft_ocsd10_field_t;

typedef struct stc_mft_ocsa32_field
{
        __IO   uint8_t  CST2                     :1;
        __IO   uint8_t  CST3                     :1;
        __IO   uint8_t  RESERVED0                :2;
        __IO   uint8_t  IOE2                     :1;
        __IO   uint8_t  IOE3                     :1;
        __IO   uint8_t  IOP2                     :1;
        __IO   uint8_t  IOP3                     :1;
} stc_mft_ocsa32_field_t;

typedef struct stc_mft_ocsb32_field
{
        __IO   uint8_t  OTD2                     :1;
        __IO   uint8_t  OTD3                     :1;
        __IO   uint8_t  RESERVED0                :2;
        __IO   uint8_t  CMOD                     :1;
        __IO   uint8_t  RESERVED1                :2;
        __IO   uint8_t  FM4                      :1;
} stc_mft_ocsb32_field_t;

typedef struct stc_mft_ocsd32_field
{
    union {
        struct {
            __IO   uint8_t  OCCP2BUFE            :2;
            __IO   uint8_t  OCCP3BUFE            :2;
            __IO   uint8_t  OCSE2BUFE            :2;
            __IO   uint8_t  OCSE3BUFE            :2;
        };
        struct {
            __IO   uint8_t  OCCP2BUFE0           :1;
            __IO   uint8_t  OCCP2BUFE1           :1;
            __IO   uint8_t  OCCP3BUFE0           :1;
            __IO   uint8_t  OCCP3BUFE1           :1;
            __IO   uint8_t  OCSE2BUFE0           :1;
            __IO   uint8_t  OCSE2BUFE1           :1;
            __IO   uint8_t  OCSE3BUFE0           :1;
            __IO   uint8_t  OCSE3BUFE1           :1;
        };
    };
} stc_mft_ocsd32_field_t;

