mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xg/common/s6e1b8xg.h
/*******************************************************************************
* MFS Registers MFS2
*   Register Definition
*******************************************************************************/
#define FM_MFS2_CSIO_SMR                          *((volatile  uint8_t*)(0x40038200UL))
#define FM0P_MFS2_CSIO_SMR                        *((volatile  uint8_t*)(0x40038200UL))
#define FM_MFS2_I2C_SMR                           *((volatile  uint8_t*)(0x40038200UL))
#define FM0P_MFS2_I2C_SMR                         *((volatile  uint8_t*)(0x40038200UL))
#define FM_MFS2_LIN_SMR                           *((volatile  uint8_t*)(0x40038200UL))
#define FM0P_MFS2_LIN_SMR                         *((volatile  uint8_t*)(0x40038200UL))
#define FM_MFS2_UART_SMR                          *((volatile  uint8_t*)(0x40038200UL))
#define FM0P_MFS2_UART_SMR                        *((volatile  uint8_t*)(0x40038200UL))
#define FM_MFS2_CSIO_SCR                          *((volatile  uint8_t*)(0x40038201UL))
#define FM0P_MFS2_CSIO_SCR                        *((volatile  uint8_t*)(0x40038201UL))
#define FM_MFS2_I2C_IBCR                          *((volatile  uint8_t*)(0x40038201UL))
#define FM0P_MFS2_I2C_IBCR                        *((volatile  uint8_t*)(0x40038201UL))
#define FM_MFS2_LIN_SCR                           *((volatile  uint8_t*)(0x40038201UL))
#define FM0P_MFS2_LIN_SCR                         *((volatile  uint8_t*)(0x40038201UL))
#define FM_MFS2_UART_SCR                          *((volatile  uint8_t*)(0x40038201UL))
#define FM0P_MFS2_UART_SCR                        *((volatile  uint8_t*)(0x40038201UL))
#define FM_MFS2_CSIO_ESCR                         *((volatile  uint8_t*)(0x40038204UL))
#define FM0P_MFS2_CSIO_ESCR                       *((volatile  uint8_t*)(0x40038204UL))
#define FM_MFS2_I2C_IBSR                          *((volatile  uint8_t*)(0x40038204UL))
#define FM0P_MFS2_I2C_IBSR                        *((volatile  uint8_t*)(0x40038204UL))
#define FM_MFS2_LIN_ESCR                          *((volatile  uint8_t*)(0x40038204UL))
#define FM0P_MFS2_LIN_ESCR                        *((volatile  uint8_t*)(0x40038204UL))
#define FM_MFS2_UART_ESCR                         *((volatile  uint8_t*)(0x40038204UL))
#define FM0P_MFS2_UART_ESCR                       *((volatile  uint8_t*)(0x40038204UL))
#define FM_MFS2_CSIO_SSR                          *((volatile  uint8_t*)(0x40038205UL))
#define FM0P_MFS2_CSIO_SSR                        *((volatile  uint8_t*)(0x40038205UL))
#define FM_MFS2_I2C_SSR                           *((volatile  uint8_t*)(0x40038205UL))
#define FM0P_MFS2_I2C_SSR                         *((volatile  uint8_t*)(0x40038205UL))
#define FM_MFS2_LIN_SSR                           *((volatile  uint8_t*)(0x40038205UL))
#define FM0P_MFS2_LIN_SSR                         *((volatile  uint8_t*)(0x40038205UL))
#define FM_MFS2_UART_SSR                          *((volatile  uint8_t*)(0x40038205UL))
#define FM0P_MFS2_UART_SSR                        *((volatile  uint8_t*)(0x40038205UL))
#define FM_MFS2_CSIO_RDR                          *((volatile uint16_t*)(0x40038208UL))
#define FM0P_MFS2_CSIO_RDR                        *((volatile uint16_t*)(0x40038208UL))
#define FM_MFS2_CSIO_TDR                          *((volatile uint16_t*)(0x40038208UL))
#define FM0P_MFS2_CSIO_TDR                        *((volatile uint16_t*)(0x40038208UL))
#define FM_MFS2_I2C_RDR                           *((volatile uint16_t*)(0x40038208UL))
#define FM0P_MFS2_I2C_RDR                         *((volatile uint16_t*)(0x40038208UL))
#define FM_MFS2_I2C_TDR                           *((volatile uint16_t*)(0x40038208UL))
#define FM0P_MFS2_I2C_TDR                         *((volatile uint16_t*)(0x40038208UL))
#define FM_MFS2_LIN_RDR                           *((volatile uint16_t*)(0x40038208UL))
#define FM0P_MFS2_LIN_RDR                         *((volatile uint16_t*)(0x40038208UL))
#define FM_MFS2_LIN_TDR                           *((volatile uint16_t*)(0x40038208UL))
#define FM0P_MFS2_LIN_TDR                         *((volatile uint16_t*)(0x40038208UL))
#define FM_MFS2_UART_RDR                          *((volatile uint16_t*)(0x40038208UL))
#define FM0P_MFS2_UART_RDR                        *((volatile uint16_t*)(0x40038208UL))
#define FM_MFS2_UART_TDR                          *((volatile uint16_t*)(0x40038208UL))
#define FM0P_MFS2_UART_TDR                        *((volatile uint16_t*)(0x40038208UL))
#define FM_MFS2_CSIO_BGR                          *((volatile uint16_t*)(0x4003820CUL))
#define FM0P_MFS2_CSIO_BGR                        *((volatile uint16_t*)(0x4003820CUL))
#define FM_MFS2_I2C_BGR                           *((volatile uint16_t*)(0x4003820CUL))
#define FM0P_MFS2_I2C_BGR                         *((volatile uint16_t*)(0x4003820CUL))
#define FM_MFS2_LIN_BGR                           *((volatile uint16_t*)(0x4003820CUL))
#define FM0P_MFS2_LIN_BGR                         *((volatile uint16_t*)(0x4003820CUL))
#define FM_MFS2_UART_BGR                          *((volatile uint16_t*)(0x4003820CUL))
#define FM0P_MFS2_UART_BGR                        *((volatile uint16_t*)(0x4003820CUL))
#define FM_MFS2_I2C_ISBA                          *((volatile  uint8_t*)(0x40038210UL))
#define FM0P_MFS2_I2C_ISBA                        *((volatile  uint8_t*)(0x40038210UL))
#define FM_MFS2_I2C_ISMK                          *((volatile  uint8_t*)(0x40038211UL))
#define FM0P_MFS2_I2C_ISMK                        *((volatile  uint8_t*)(0x40038211UL))
#define FM_MFS2_CSIO_FCR                          *((volatile uint16_t*)(0x40038214UL))
#define FM0P_MFS2_CSIO_FCR                        *((volatile uint16_t*)(0x40038214UL))
#define FM_MFS2_I2C_FCR                           *((volatile uint16_t*)(0x40038214UL))
#define FM0P_MFS2_I2C_FCR                         *((volatile uint16_t*)(0x40038214UL))
#define FM_MFS2_LIN_FCR                           *((volatile uint16_t*)(0x40038214UL))
#define FM0P_MFS2_LIN_FCR                         *((volatile uint16_t*)(0x40038214UL))
#define FM_MFS2_UART_FCR                          *((volatile uint16_t*)(0x40038214UL))
#define FM0P_MFS2_UART_FCR                        *((volatile uint16_t*)(0x40038214UL))
#define FM_MFS2_CSIO_FBYTE1                       *((volatile  uint8_t*)(0x40038218UL))
#define FM0P_MFS2_CSIO_FBYTE1                     *((volatile  uint8_t*)(0x40038218UL))
#define FM_MFS2_I2C_FBYTE1                        *((volatile  uint8_t*)(0x40038218UL))
#define FM0P_MFS2_I2C_FBYTE1                      *((volatile  uint8_t*)(0x40038218UL))
#define FM_MFS2_LIN_FBYTE1                        *((volatile  uint8_t*)(0x40038218UL))
#define FM0P_MFS2_LIN_FBYTE1                      *((volatile  uint8_t*)(0x40038218UL))
#define FM_MFS2_UART_FBYTE1                       *((volatile  uint8_t*)(0x40038218UL))
#define FM0P_MFS2_UART_FBYTE1                     *((volatile  uint8_t*)(0x40038218UL))
#define FM_MFS2_CSIO_FBYTE2                       *((volatile  uint8_t*)(0x40038219UL))
#define FM0P_MFS2_CSIO_FBYTE2                     *((volatile  uint8_t*)(0x40038219UL))
#define FM_MFS2_I2C_FBYTE2                        *((volatile  uint8_t*)(0x40038219UL))
#define FM0P_MFS2_I2C_FBYTE2                      *((volatile  uint8_t*)(0x40038219UL))
#define FM_MFS2_LIN_FBYTE2                        *((volatile  uint8_t*)(0x40038219UL))
#define FM0P_MFS2_LIN_FBYTE2                      *((volatile  uint8_t*)(0x40038219UL))
#define FM_MFS2_UART_FBYTE2                       *((volatile  uint8_t*)(0x40038219UL))
#define FM0P_MFS2_UART_FBYTE2                     *((volatile  uint8_t*)(0x40038219UL))
#define FM_MFS2_CSIO_SCSTR0                       *((volatile  uint8_t*)(0x4003821CUL))
#define FM0P_MFS2_CSIO_SCSTR0                     *((volatile  uint8_t*)(0x4003821CUL))
#define FM_MFS2_CSIO_SCSTR1                       *((volatile  uint8_t*)(0x4003821DUL))
#define FM0P_MFS2_CSIO_SCSTR1                     *((volatile  uint8_t*)(0x4003821DUL))
#define FM_MFS2_I2C_EIBCR                         *((volatile  uint8_t*)(0x4003821DUL))
#define FM0P_MFS2_I2C_EIBCR                       *((volatile  uint8_t*)(0x4003821DUL))
#define FM_MFS2_CSIO_SCSTR32                      *((volatile uint16_t*)(0x40038220UL))
#define FM0P_MFS2_CSIO_SCSTR32                    *((volatile uint16_t*)(0x40038220UL))
#define FM_MFS2_CSIO_SACSR                        *((volatile uint16_t*)(0x40038224UL))
#define FM0P_MFS2_CSIO_SACSR                      *((volatile uint16_t*)(0x40038224UL))
#define FM_MFS2_CSIO_STMR                         *((volatile uint16_t*)(0x40038228UL))
#define FM0P_MFS2_CSIO_STMR                       *((volatile uint16_t*)(0x40038228UL))
#define FM_MFS2_CSIO_STMCR                        *((volatile uint16_t*)(0x4003822CUL))
#define FM0P_MFS2_CSIO_STMCR                      *((volatile uint16_t*)(0x4003822CUL))
#define FM_MFS2_CSIO_SCSCR                        *((volatile uint16_t*)(0x40038230UL))
#define FM0P_MFS2_CSIO_SCSCR                      *((volatile uint16_t*)(0x40038230UL))
#define FM_MFS2_CSIO_SCSFR0                       *((volatile  uint8_t*)(0x40038234UL))
#define FM0P_MFS2_CSIO_SCSFR0                     *((volatile  uint8_t*)(0x40038234UL))
#define FM_MFS2_CSIO_SCSFR1                       *((volatile  uint8_t*)(0x40038235UL))
#define FM0P_MFS2_CSIO_SCSFR1                     *((volatile  uint8_t*)(0x40038235UL))
#define FM_MFS2_CSIO_SCSFR2                       *((volatile  uint8_t*)(0x40038238UL))
#define FM0P_MFS2_CSIO_SCSFR2                     *((volatile  uint8_t*)(0x40038238UL))
#define FM_MFS2_CSIO_TBYTE0                       *((volatile  uint8_t*)(0x4003823CUL))
#define FM0P_MFS2_CSIO_TBYTE0                     *((volatile  uint8_t*)(0x4003823CUL))
#define FM_MFS2_CSIO_TBYTE1                       *((volatile  uint8_t*)(0x4003823DUL))
#define FM0P_MFS2_CSIO_TBYTE1                     *((volatile  uint8_t*)(0x4003823DUL))
#define FM_MFS2_CSIO_TBYTE2                       *((volatile  uint8_t*)(0x40038240UL))
#define FM0P_MFS2_CSIO_TBYTE2                     *((volatile  uint8_t*)(0x40038240UL))
#define FM_MFS2_CSIO_TBYTE3                       *((volatile  uint8_t*)(0x40038241UL))
#define FM0P_MFS2_CSIO_TBYTE3                     *((volatile  uint8_t*)(0x40038241UL))

