mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xg/common/s6e1b8xg.h
#define FM0P_FASTIO_FPDIRB_AVAILABLE              1
#define FM_FASTIO_FPDIRB_AVAILABLE                1
#define FM0P_FASTIO_FPDIRC_AVAILABLE              1
#define FM_FASTIO_FPDIRC_AVAILABLE                1
#define FM0P_FASTIO_FPDIRD_AVAILABLE              1
#define FM_FASTIO_FPDIRD_AVAILABLE                1
#define FM0P_FASTIO_FPDIRE_AVAILABLE              1
#define FM_FASTIO_FPDIRE_AVAILABLE                1
#define FM0P_FASTIO_FPDIRF_AVAILABLE              1
#define FM_FASTIO_FPDIRF_AVAILABLE                1
#define FM0P_FASTIO_FPDOR0_AVAILABLE              1
#define FM_FASTIO_FPDOR0_AVAILABLE                1
#define FM0P_FASTIO_FPDOR1_AVAILABLE              1
#define FM_FASTIO_FPDOR1_AVAILABLE                1
#define FM0P_FASTIO_FPDOR2_AVAILABLE              1
#define FM_FASTIO_FPDOR2_AVAILABLE                1
#define FM0P_FASTIO_FPDOR3_AVAILABLE              1
#define FM_FASTIO_FPDOR3_AVAILABLE                1
#define FM0P_FASTIO_FPDOR4_AVAILABLE              1
#define FM_FASTIO_FPDOR4_AVAILABLE                1
#define FM0P_FASTIO_FPDOR5_AVAILABLE              1
#define FM_FASTIO_FPDOR5_AVAILABLE                1
#define FM0P_FASTIO_FPDOR6_AVAILABLE              1
#define FM_FASTIO_FPDOR6_AVAILABLE                1
#define FM0P_FASTIO_FPDOR7_AVAILABLE              1
#define FM_FASTIO_FPDOR7_AVAILABLE                1
#define FM0P_FASTIO_FPDOR8_AVAILABLE              1
#define FM_FASTIO_FPDOR8_AVAILABLE                1
#define FM0P_FASTIO_FPDOR9_AVAILABLE              1
#define FM_FASTIO_FPDOR9_AVAILABLE                1
#define FM0P_FASTIO_FPDORA_AVAILABLE              1
#define FM_FASTIO_FPDORA_AVAILABLE                1
#define FM0P_FASTIO_FPDORB_AVAILABLE              1
#define FM_FASTIO_FPDORB_AVAILABLE                1
#define FM0P_FASTIO_FPDORC_AVAILABLE              1
#define FM_FASTIO_FPDORC_AVAILABLE                1
#define FM0P_FASTIO_FPDORD_AVAILABLE              1
#define FM_FASTIO_FPDORD_AVAILABLE                1
#define FM0P_FASTIO_FPDORE_AVAILABLE              1
#define FM_FASTIO_FPDORE_AVAILABLE                1
#define FM0P_FASTIO_FPDORF_AVAILABLE              1
#define FM_FASTIO_FPDORF_AVAILABLE                1
#define FM0P_FASTIO_M_FPDIR0_AVAILABLE            1
#define FM_FASTIO_M_FPDIR0_AVAILABLE              1
#define FM0P_FASTIO_M_FPDIR1_AVAILABLE            1
#define FM_FASTIO_M_FPDIR1_AVAILABLE              1
#define FM0P_FASTIO_M_FPDOR0_AVAILABLE            1
#define FM_FASTIO_M_FPDOR0_AVAILABLE              1
#define FM0P_FASTIO_M_FPDOR1_AVAILABLE            1
#define FM_FASTIO_M_FPDOR1_AVAILABLE              1
/*******************************************************************************
* FLASH_IF
*******************************************************************************/
#define FM0P_FLASH_IF_CRTRMM_AVAILABLE            1
#define FM_FLASH_IF_CRTRMM_AVAILABLE              1
#define FM0P_FLASH_IF_FICLR_AVAILABLE             1
#define FM_FLASH_IF_FICLR_AVAILABLE               1
#define FM0P_FLASH_IF_FICR_AVAILABLE              1
#define FM_FLASH_IF_FICR_AVAILABLE                1
#define FM0P_FLASH_IF_FISR_AVAILABLE              1
#define FM_FLASH_IF_FISR_AVAILABLE                1
#define FM0P_FLASH_IF_FRVRC_AVAILABLE             1
#define FM_FLASH_IF_FRVRC_AVAILABLE               1
#define FM0P_FLASH_IF_FRWTR_AVAILABLE             1
#define FM_FLASH_IF_FRWTR_AVAILABLE               1
#define FM0P_FLASH_IF_FSTR_AVAILABLE              1
#define FM_FLASH_IF_FSTR_AVAILABLE                1
#define FM0P_FLASH_IF_FSYNDN_AVAILABLE            1
#define FM_FLASH_IF_FSYNDN_AVAILABLE              1
/*******************************************************************************
* GPIO
*******************************************************************************/
#define FM0P_GPIO_ADE_AVAILABLE                   1
#define FM_GPIO_ADE_AVAILABLE                     1
#define FM0P_GPIO_DDR0_AVAILABLE                  1
#define FM_GPIO_DDR0_AVAILABLE                    1
#define FM0P_GPIO_DDR1_AVAILABLE                  1
#define FM_GPIO_DDR1_AVAILABLE                    1
#define FM0P_GPIO_DDR2_AVAILABLE                  1
#define FM_GPIO_DDR2_AVAILABLE                    1
#define FM0P_GPIO_DDR3_AVAILABLE                  1
#define FM_GPIO_DDR3_AVAILABLE                    1
#define FM0P_GPIO_DDR4_AVAILABLE                  1
#define FM_GPIO_DDR4_AVAILABLE                    1
#define FM0P_GPIO_DDR5_AVAILABLE                  1
#define FM_GPIO_DDR5_AVAILABLE                    1
#define FM0P_GPIO_DDR6_AVAILABLE                  1
#define FM_GPIO_DDR6_AVAILABLE                    1
#define FM0P_GPIO_DDR7_AVAILABLE                  1
#define FM_GPIO_DDR7_AVAILABLE                    1
#define FM0P_GPIO_DDR8_AVAILABLE                  1
#define FM_GPIO_DDR8_AVAILABLE                    1
#define FM0P_GPIO_DDR9_AVAILABLE                  1
#define FM_GPIO_DDR9_AVAILABLE                    1
#define FM0P_GPIO_DDRA_AVAILABLE                  1
#define FM_GPIO_DDRA_AVAILABLE                    1
#define FM0P_GPIO_DDRB_AVAILABLE                  1
#define FM_GPIO_DDRB_AVAILABLE                    1
#define FM0P_GPIO_DDRC_AVAILABLE                  1
#define FM_GPIO_DDRC_AVAILABLE                    1
#define FM0P_GPIO_DDRD_AVAILABLE                  1
#define FM_GPIO_DDRD_AVAILABLE                    1
#define FM0P_GPIO_DDRE_AVAILABLE                  1
#define FM_GPIO_DDRE_AVAILABLE                    1
#define FM0P_GPIO_DDRF_AVAILABLE                  1
#define FM_GPIO_DDRF_AVAILABLE                    1
#define FM0P_GPIO_EPFR00_AVAILABLE                1
#define FM_GPIO_EPFR00_AVAILABLE                  1
#define FM0P_GPIO_EPFR01_AVAILABLE                1
#define FM_GPIO_EPFR01_AVAILABLE                  1
#define FM0P_GPIO_EPFR04_AVAILABLE                1
#define FM_GPIO_EPFR04_AVAILABLE                  1
#define FM0P_GPIO_EPFR05_AVAILABLE                1
#define FM_GPIO_EPFR05_AVAILABLE                  1
#define FM0P_GPIO_EPFR06_AVAILABLE                1
#define FM_GPIO_EPFR06_AVAILABLE                  1
#define FM0P_GPIO_EPFR07_AVAILABLE                1
#define FM_GPIO_EPFR07_AVAILABLE                  1
#define FM0P_GPIO_EPFR08_AVAILABLE                1
#define FM_GPIO_EPFR08_AVAILABLE                  1
#define FM0P_GPIO_EPFR09_AVAILABLE                1
#define FM_GPIO_EPFR09_AVAILABLE                  1
#define FM0P_GPIO_EPFR15_AVAILABLE                1
#define FM_GPIO_EPFR15_AVAILABLE                  1
#define FM0P_GPIO_EPFR16_AVAILABLE                1
#define FM_GPIO_EPFR16_AVAILABLE                  1
#define FM0P_GPIO_EPFR18_AVAILABLE                1
#define FM_GPIO_EPFR18_AVAILABLE                  1
#define FM0P_GPIO_EPFR23_AVAILABLE                1
#define FM_GPIO_EPFR23_AVAILABLE                  1
#define FM0P_GPIO_EPFR33_AVAILABLE                1
#define FM_GPIO_EPFR33_AVAILABLE                  1
#define FM0P_GPIO_EPFR34_AVAILABLE                1
#define FM_GPIO_EPFR34_AVAILABLE                  1
#define FM0P_GPIO_EPFR37_AVAILABLE                1
#define FM_GPIO_EPFR37_AVAILABLE                  1
#define FM0P_GPIO_EPFR38_AVAILABLE                1
#define FM_GPIO_EPFR38_AVAILABLE                  1
#define FM0P_GPIO_FPOER0_AVAILABLE                1
#define FM_GPIO_FPOER0_AVAILABLE                  1
#define FM0P_GPIO_FPOER1_AVAILABLE                1
#define FM_GPIO_FPOER1_AVAILABLE                  1
#define FM0P_GPIO_FPOER2_AVAILABLE                1
#define FM_GPIO_FPOER2_AVAILABLE                  1
#define FM0P_GPIO_FPOER3_AVAILABLE                1
#define FM_GPIO_FPOER3_AVAILABLE                  1
#define FM0P_GPIO_FPOER4_AVAILABLE                1
#define FM_GPIO_FPOER4_AVAILABLE                  1
#define FM0P_GPIO_FPOER5_AVAILABLE                1
#define FM_GPIO_FPOER5_AVAILABLE                  1
#define FM0P_GPIO_FPOER6_AVAILABLE                1
#define FM_GPIO_FPOER6_AVAILABLE                  1
#define FM0P_GPIO_FPOER7_AVAILABLE                1
#define FM_GPIO_FPOER7_AVAILABLE                  1
#define FM0P_GPIO_FPOER8_AVAILABLE                1
#define FM_GPIO_FPOER8_AVAILABLE                  1
#define FM0P_GPIO_FPOER9_AVAILABLE                1
#define FM_GPIO_FPOER9_AVAILABLE                  1
#define FM0P_GPIO_FPOERA_AVAILABLE                1
#define FM_GPIO_FPOERA_AVAILABLE                  1
#define FM0P_GPIO_FPOERB_AVAILABLE                1
#define FM_GPIO_FPOERB_AVAILABLE                  1
#define FM0P_GPIO_FPOERC_AVAILABLE                1
#define FM_GPIO_FPOERC_AVAILABLE                  1
#define FM0P_GPIO_FPOERD_AVAILABLE                1
#define FM_GPIO_FPOERD_AVAILABLE                  1
#define FM0P_GPIO_FPOERE_AVAILABLE                1
#define FM_GPIO_FPOERE_AVAILABLE                  1
#define FM0P_GPIO_FPOERF_AVAILABLE                1
#define FM_GPIO_FPOERF_AVAILABLE                  1
#define FM0P_GPIO_LVDIE_AVAILABLE                 1
#define FM_GPIO_LVDIE_AVAILABLE                   1
#define FM0P_GPIO_PCR0_AVAILABLE                  1
#define FM_GPIO_PCR0_AVAILABLE                    1
#define FM0P_GPIO_PCR1_AVAILABLE                  1
#define FM_GPIO_PCR1_AVAILABLE                    1
#define FM0P_GPIO_PCR2_AVAILABLE                  1
#define FM_GPIO_PCR2_AVAILABLE                    1
#define FM0P_GPIO_PCR3_AVAILABLE                  1
#define FM_GPIO_PCR3_AVAILABLE                    1
#define FM0P_GPIO_PCR4_AVAILABLE                  1
#define FM_GPIO_PCR4_AVAILABLE                    1
#define FM0P_GPIO_PCR5_AVAILABLE                  1
#define FM_GPIO_PCR5_AVAILABLE                    1
#define FM0P_GPIO_PCR6_AVAILABLE                  1
#define FM_GPIO_PCR6_AVAILABLE                    1
#define FM0P_GPIO_PCR7_AVAILABLE                  1
#define FM_GPIO_PCR7_AVAILABLE                    1
#define FM0P_GPIO_PCR9_AVAILABLE                  1
#define FM_GPIO_PCR9_AVAILABLE                    1
#define FM0P_GPIO_PCRA_AVAILABLE                  1
#define FM_GPIO_PCRA_AVAILABLE                    1
#define FM0P_GPIO_PCRB_AVAILABLE                  1
#define FM_GPIO_PCRB_AVAILABLE                    1
#define FM0P_GPIO_PCRC_AVAILABLE                  1
#define FM_GPIO_PCRC_AVAILABLE                    1
#define FM0P_GPIO_PCRD_AVAILABLE                  1
#define FM_GPIO_PCRD_AVAILABLE                    1
#define FM0P_GPIO_PCRE_AVAILABLE                  1
#define FM_GPIO_PCRE_AVAILABLE                    1
#define FM0P_GPIO_PCRF_AVAILABLE                  1
#define FM_GPIO_PCRF_AVAILABLE                    1
#define FM0P_GPIO_PDIR0_AVAILABLE                 1
#define FM_GPIO_PDIR0_AVAILABLE                   1
#define FM0P_GPIO_PDIR1_AVAILABLE                 1
#define FM_GPIO_PDIR1_AVAILABLE                   1
#define FM0P_GPIO_PDIR2_AVAILABLE                 1
#define FM_GPIO_PDIR2_AVAILABLE                   1
#define FM0P_GPIO_PDIR3_AVAILABLE                 1
#define FM_GPIO_PDIR3_AVAILABLE                   1
#define FM0P_GPIO_PDIR4_AVAILABLE                 1
#define FM_GPIO_PDIR4_AVAILABLE                   1
#define FM0P_GPIO_PDIR5_AVAILABLE                 1
#define FM_GPIO_PDIR5_AVAILABLE                   1
#define FM0P_GPIO_PDIR6_AVAILABLE                 1
#define FM_GPIO_PDIR6_AVAILABLE                   1
#define FM0P_GPIO_PDIR7_AVAILABLE                 1
#define FM_GPIO_PDIR7_AVAILABLE                   1
#define FM0P_GPIO_PDIR8_AVAILABLE                 1
#define FM_GPIO_PDIR8_AVAILABLE                   1
#define FM0P_GPIO_PDIR9_AVAILABLE                 1
#define FM_GPIO_PDIR9_AVAILABLE                   1
#define FM0P_GPIO_PDIRA_AVAILABLE                 1
#define FM_GPIO_PDIRA_AVAILABLE                   1
#define FM0P_GPIO_PDIRB_AVAILABLE                 1
#define FM_GPIO_PDIRB_AVAILABLE                   1
#define FM0P_GPIO_PDIRC_AVAILABLE                 1
#define FM_GPIO_PDIRC_AVAILABLE                   1
#define FM0P_GPIO_PDIRD_AVAILABLE                 1
#define FM_GPIO_PDIRD_AVAILABLE                   1
#define FM0P_GPIO_PDIRE_AVAILABLE                 1
#define FM_GPIO_PDIRE_AVAILABLE                   1
#define FM0P_GPIO_PDIRF_AVAILABLE                 1
#define FM_GPIO_PDIRF_AVAILABLE                   1
#define FM0P_GPIO_PDOR0_AVAILABLE                 1
#define FM_GPIO_PDOR0_AVAILABLE                   1
#define FM0P_GPIO_PDOR1_AVAILABLE                 1
#define FM_GPIO_PDOR1_AVAILABLE                   1
#define FM0P_GPIO_PDOR2_AVAILABLE                 1
#define FM_GPIO_PDOR2_AVAILABLE                   1
#define FM0P_GPIO_PDOR3_AVAILABLE                 1
#define FM_GPIO_PDOR3_AVAILABLE                   1
#define FM0P_GPIO_PDOR4_AVAILABLE                 1
#define FM_GPIO_PDOR4_AVAILABLE                   1
#define FM0P_GPIO_PDOR5_AVAILABLE                 1
#define FM_GPIO_PDOR5_AVAILABLE                   1
#define FM0P_GPIO_PDOR6_AVAILABLE                 1
#define FM_GPIO_PDOR6_AVAILABLE                   1
#define FM0P_GPIO_PDOR7_AVAILABLE                 1
#define FM_GPIO_PDOR7_AVAILABLE                   1
#define FM0P_GPIO_PDOR8_AVAILABLE                 1
#define FM_GPIO_PDOR8_AVAILABLE                   1
#define FM0P_GPIO_PDOR9_AVAILABLE                 1
#define FM_GPIO_PDOR9_AVAILABLE                   1
#define FM0P_GPIO_PDORA_AVAILABLE                 1
#define FM_GPIO_PDORA_AVAILABLE                   1
#define FM0P_GPIO_PDORB_AVAILABLE                 1
#define FM_GPIO_PDORB_AVAILABLE                   1
#define FM0P_GPIO_PDORC_AVAILABLE                 1
#define FM_GPIO_PDORC_AVAILABLE                   1
#define FM0P_GPIO_PDORD_AVAILABLE                 1
#define FM_GPIO_PDORD_AVAILABLE                   1
#define FM0P_GPIO_PDORE_AVAILABLE                 1
#define FM_GPIO_PDORE_AVAILABLE                   1
#define FM0P_GPIO_PDORF_AVAILABLE                 1
#define FM_GPIO_PDORF_AVAILABLE                   1
#define FM0P_GPIO_PFR0_AVAILABLE                  1
#define FM_GPIO_PFR0_AVAILABLE                    1
#define FM0P_GPIO_PFR1_AVAILABLE                  1
#define FM_GPIO_PFR1_AVAILABLE                    1
#define FM0P_GPIO_PFR2_AVAILABLE                  1
#define FM_GPIO_PFR2_AVAILABLE                    1
#define FM0P_GPIO_PFR3_AVAILABLE                  1
#define FM_GPIO_PFR3_AVAILABLE                    1
#define FM0P_GPIO_PFR4_AVAILABLE                  1
#define FM_GPIO_PFR4_AVAILABLE                    1
#define FM0P_GPIO_PFR5_AVAILABLE                  1
#define FM_GPIO_PFR5_AVAILABLE                    1
#define FM0P_GPIO_PFR6_AVAILABLE                  1
#define FM_GPIO_PFR6_AVAILABLE                    1
#define FM0P_GPIO_PFR7_AVAILABLE                  1
#define FM_GPIO_PFR7_AVAILABLE                    1
#define FM0P_GPIO_PFR8_AVAILABLE                  1
#define FM_GPIO_PFR8_AVAILABLE                    1
#define FM0P_GPIO_PFR9_AVAILABLE                  1
#define FM_GPIO_PFR9_AVAILABLE                    1
#define FM0P_GPIO_PFRA_AVAILABLE                  1
#define FM_GPIO_PFRA_AVAILABLE                    1
#define FM0P_GPIO_PFRB_AVAILABLE                  1
#define FM_GPIO_PFRB_AVAILABLE                    1
#define FM0P_GPIO_PFRC_AVAILABLE                  1
#define FM_GPIO_PFRC_AVAILABLE                    1
#define FM0P_GPIO_PFRD_AVAILABLE                  1
#define FM_GPIO_PFRD_AVAILABLE                    1
#define FM0P_GPIO_PFRE_AVAILABLE                  1
#define FM_GPIO_PFRE_AVAILABLE                    1
#define FM0P_GPIO_PFRF_AVAILABLE                  1
#define FM_GPIO_PFRF_AVAILABLE                    1
#define FM0P_GPIO_PZR0_AVAILABLE                  1
#define FM_GPIO_PZR0_AVAILABLE                    1
#define FM0P_GPIO_PZR1_AVAILABLE                  1
#define FM_GPIO_PZR1_AVAILABLE                    1
#define FM0P_GPIO_PZR2_AVAILABLE                  1
#define FM_GPIO_PZR2_AVAILABLE                    1
#define FM0P_GPIO_PZR3_AVAILABLE                  1
#define FM_GPIO_PZR3_AVAILABLE                    1
#define FM0P_GPIO_PZR4_AVAILABLE                  1
#define FM_GPIO_PZR4_AVAILABLE                    1
#define FM0P_GPIO_PZR5_AVAILABLE                  1
#define FM_GPIO_PZR5_AVAILABLE                    1
#define FM0P_GPIO_PZR6_AVAILABLE                  1
#define FM_GPIO_PZR6_AVAILABLE                    1
#define FM0P_GPIO_PZR7_AVAILABLE                  1
#define FM_GPIO_PZR7_AVAILABLE                    1
#define FM0P_GPIO_PZR8_AVAILABLE                  1
#define FM_GPIO_PZR8_AVAILABLE                    1
#define FM0P_GPIO_PZR9_AVAILABLE                  1
#define FM_GPIO_PZR9_AVAILABLE                    1
#define FM0P_GPIO_PZRA_AVAILABLE                  1
#define FM_GPIO_PZRA_AVAILABLE                    1
#define FM0P_GPIO_PZRB_AVAILABLE                  1
#define FM_GPIO_PZRB_AVAILABLE                    1
#define FM0P_GPIO_PZRC_AVAILABLE                  1
#define FM_GPIO_PZRC_AVAILABLE                    1
#define FM0P_GPIO_PZRD_AVAILABLE                  1
#define FM_GPIO_PZRD_AVAILABLE                    1
#define FM0P_GPIO_PZRE_AVAILABLE                  1
#define FM_GPIO_PZRE_AVAILABLE                    1
#define FM0P_GPIO_PZRF_AVAILABLE                  1
#define FM_GPIO_PZRF_AVAILABLE                    1
#define FM0P_GPIO_SPSR_AVAILABLE                  1
#define FM_GPIO_SPSR_AVAILABLE                    1
/*******************************************************************************
* HDMICEC0
*******************************************************************************/
#define FM0P_HDMICEC_RCADR1_AVAILABLE             1
#define FM_HDMICEC_RCADR1_AVAILABLE               1
#define FM0P_HDMICEC_RCADR2_AVAILABLE             1
#define FM_HDMICEC_RCADR2_AVAILABLE               1
#define FM0P_HDMICEC_RCCKD_AVAILABLE              1
#define FM_HDMICEC_RCCKD_AVAILABLE                1
#define FM0P_HDMICEC_RCCR_AVAILABLE               1
#define FM_HDMICEC_RCCR_AVAILABLE                 1
#define FM0P_HDMICEC_RCDAHW_AVAILABLE             1
#define FM_HDMICEC_RCDAHW_AVAILABLE               1
#define FM0P_HDMICEC_RCDBHW_AVAILABLE             1
#define FM_HDMICEC_RCDBHW_AVAILABLE               1
#define FM0P_HDMICEC_RCDTHH_AVAILABLE             1
#define FM_HDMICEC_RCDTHH_AVAILABLE               1
#define FM0P_HDMICEC_RCDTHL_AVAILABLE             1
#define FM_HDMICEC_RCDTHL_AVAILABLE               1
#define FM0P_HDMICEC_RCDTLH_AVAILABLE             1
#define FM_HDMICEC_RCDTLH_AVAILABLE               1
#define FM0P_HDMICEC_RCDTLL_AVAILABLE             1
#define FM_HDMICEC_RCDTLL_AVAILABLE               1
#define FM0P_HDMICEC_RCLE_AVAILABLE               1
#define FM_HDMICEC_RCLE_AVAILABLE                 1
#define FM0P_HDMICEC_RCLELW_AVAILABLE             1
#define FM_HDMICEC_RCLELW_AVAILABLE               1
#define FM0P_HDMICEC_RCLESW_AVAILABLE             1
#define FM_HDMICEC_RCLESW_AVAILABLE               1
#define FM0P_HDMICEC_RCRC_AVAILABLE               1
#define FM_HDMICEC_RCRC_AVAILABLE                 1
#define FM0P_HDMICEC_RCRHW_AVAILABLE              1
#define FM_HDMICEC_RCRHW_AVAILABLE                1
#define FM0P_HDMICEC_RCSHW_AVAILABLE              1
#define FM_HDMICEC_RCSHW_AVAILABLE                1
#define FM0P_HDMICEC_RCST_AVAILABLE               1
#define FM_HDMICEC_RCST_AVAILABLE                 1
#define FM0P_HDMICEC_SFREE_AVAILABLE              1
#define FM_HDMICEC_SFREE_AVAILABLE                1
#define FM0P_HDMICEC_TXCTRL_AVAILABLE             1
#define FM_HDMICEC_TXCTRL_AVAILABLE               1
#define FM0P_HDMICEC_TXDATA_AVAILABLE             1
#define FM_HDMICEC_TXDATA_AVAILABLE               1
#define FM0P_HDMICEC_TXSTS_AVAILABLE              1
#define FM_HDMICEC_TXSTS_AVAILABLE                1
/*******************************************************************************
* HWWDT
*******************************************************************************/
#define FM0P_HWWDT_WDG_CTL_AVAILABLE              1
#define FM_HWWDT_WDG_CTL_AVAILABLE                1
#define FM0P_HWWDT_WDG_ICL_AVAILABLE              1
#define FM_HWWDT_WDG_ICL_AVAILABLE                1
#define FM0P_HWWDT_WDG_LCK_AVAILABLE              1
#define FM_HWWDT_WDG_LCK_AVAILABLE                1
#define FM0P_HWWDT_WDG_LDR_AVAILABLE              1
#define FM_HWWDT_WDG_LDR_AVAILABLE                1
#define FM0P_HWWDT_WDG_RIS_AVAILABLE              1
#define FM_HWWDT_WDG_RIS_AVAILABLE                1
#define FM0P_HWWDT_WDG_VLR_AVAILABLE              1
#define FM_HWWDT_WDG_VLR_AVAILABLE                1
/*******************************************************************************
* INTREQ
*******************************************************************************/
#define FM0P_INTREQ_EXC02MON_AVAILABLE            1
#define FM_INTREQ_EXC02MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ00MON_AVAILABLE            1
#define FM_INTREQ_IRQ00MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ01MON_AVAILABLE            1
#define FM_INTREQ_IRQ01MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ02MON_AVAILABLE            1
#define FM_INTREQ_IRQ02MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ03MON_AVAILABLE            1
#define FM_INTREQ_IRQ03MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ04MON_AVAILABLE            1
#define FM_INTREQ_IRQ04MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ05MON_AVAILABLE            1
#define FM_INTREQ_IRQ05MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ06MON_AVAILABLE            1
#define FM_INTREQ_IRQ06MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ07MON_AVAILABLE            1
#define FM_INTREQ_IRQ07MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ08MON_AVAILABLE            1
#define FM_INTREQ_IRQ08MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ09MON_AVAILABLE            1
#define FM_INTREQ_IRQ09MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ10MON_AVAILABLE            1
#define FM_INTREQ_IRQ10MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ11MON_AVAILABLE            1
#define FM_INTREQ_IRQ11MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ12MON_AVAILABLE            1
#define FM_INTREQ_IRQ12MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ13MON_AVAILABLE            1
#define FM_INTREQ_IRQ13MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ14MON_AVAILABLE            1
#define FM_INTREQ_IRQ14MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ15MON_AVAILABLE            1
#define FM_INTREQ_IRQ15MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ16MON_AVAILABLE            1
#define FM_INTREQ_IRQ16MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ17MON_AVAILABLE            1
#define FM_INTREQ_IRQ17MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ18MON_AVAILABLE            1
#define FM_INTREQ_IRQ18MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ19MON_AVAILABLE            1
#define FM_INTREQ_IRQ19MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ20MON_AVAILABLE            1
#define FM_INTREQ_IRQ20MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ21MON_AVAILABLE            1
#define FM_INTREQ_IRQ21MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ22MON_AVAILABLE            1
#define FM_INTREQ_IRQ22MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ23MON_AVAILABLE            1
#define FM_INTREQ_IRQ23MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ24MON_AVAILABLE            1
#define FM_INTREQ_IRQ24MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ25MON_AVAILABLE            1
#define FM_INTREQ_IRQ25MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ26MON_AVAILABLE            1
#define FM_INTREQ_IRQ26MON_AVAILABLE              1
