mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xg/common/s6e1b8xg.h
#define FM_MFT_WFG_WFTB54_AVAILABLE               1
#define FM0P_MFT_WFG_WFTF10_AVAILABLE             1
#define FM_MFT_WFG_WFTF10_AVAILABLE               1
#define FM0P_MFT_WFG_WFTF32_AVAILABLE             1
#define FM_MFT_WFG_WFTF32_AVAILABLE               1
#define FM0P_MFT_WFG_WFTF54_AVAILABLE             1
#define FM_MFT_WFG_WFTF54_AVAILABLE               1
/*******************************************************************************
* MFT_PPG
*******************************************************************************/
#define FM0P_MFT_PPG_COMP0_AVAILABLE              1
#define FM_MFT_PPG_COMP0_AVAILABLE                1
#define FM0P_MFT_PPG_COMP1_AVAILABLE              1
#define FM_MFT_PPG_COMP1_AVAILABLE                1
#define FM0P_MFT_PPG_COMP10_AVAILABLE             1
#define FM_MFT_PPG_COMP10_AVAILABLE               1
#define FM0P_MFT_PPG_COMP12_AVAILABLE             1
#define FM_MFT_PPG_COMP12_AVAILABLE               1
#define FM0P_MFT_PPG_COMP14_AVAILABLE             1
#define FM_MFT_PPG_COMP14_AVAILABLE               1
#define FM0P_MFT_PPG_COMP2_AVAILABLE              1
#define FM_MFT_PPG_COMP2_AVAILABLE                1
#define FM0P_MFT_PPG_COMP3_AVAILABLE              1
#define FM_MFT_PPG_COMP3_AVAILABLE                1
#define FM0P_MFT_PPG_COMP4_AVAILABLE              1
#define FM_MFT_PPG_COMP4_AVAILABLE                1
#define FM0P_MFT_PPG_COMP5_AVAILABLE              1
#define FM_MFT_PPG_COMP5_AVAILABLE                1
#define FM0P_MFT_PPG_COMP6_AVAILABLE              1
#define FM_MFT_PPG_COMP6_AVAILABLE                1
#define FM0P_MFT_PPG_COMP7_AVAILABLE              1
#define FM_MFT_PPG_COMP7_AVAILABLE                1
#define FM0P_MFT_PPG_COMP8_AVAILABLE              1
#define FM_MFT_PPG_COMP8_AVAILABLE                1
#define FM0P_MFT_PPG_GATEC0_AVAILABLE             1
#define FM_MFT_PPG_GATEC0_AVAILABLE               1
#define FM0P_MFT_PPG_GATEC12_AVAILABLE            1
#define FM_MFT_PPG_GATEC12_AVAILABLE              1
#define FM0P_MFT_PPG_GATEC16_AVAILABLE            1
#define FM_MFT_PPG_GATEC16_AVAILABLE              1
#define FM0P_MFT_PPG_GATEC20_AVAILABLE            1
#define FM_MFT_PPG_GATEC20_AVAILABLE              1
#define FM0P_MFT_PPG_GATEC4_AVAILABLE             1
#define FM_MFT_PPG_GATEC4_AVAILABLE               1
#define FM0P_MFT_PPG_GATEC8_AVAILABLE             1
#define FM_MFT_PPG_GATEC8_AVAILABLE               1
#define FM0P_MFT_PPG_IGBTC_AVAILABLE              1
#define FM_MFT_PPG_IGBTC_AVAILABLE                1
#define FM0P_MFT_PPG_PPGC0_AVAILABLE              1
#define FM_MFT_PPG_PPGC0_AVAILABLE                1
#define FM0P_MFT_PPG_PPGC1_AVAILABLE              1
#define FM_MFT_PPG_PPGC1_AVAILABLE                1
#define FM0P_MFT_PPG_PPGC10_AVAILABLE             1
#define FM_MFT_PPG_PPGC10_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC11_AVAILABLE             1
#define FM_MFT_PPG_PPGC11_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC12_AVAILABLE             1
#define FM_MFT_PPG_PPGC12_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC13_AVAILABLE             1
#define FM_MFT_PPG_PPGC13_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC14_AVAILABLE             1
#define FM_MFT_PPG_PPGC14_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC15_AVAILABLE             1
#define FM_MFT_PPG_PPGC15_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC16_AVAILABLE             1
#define FM_MFT_PPG_PPGC16_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC17_AVAILABLE             1
#define FM_MFT_PPG_PPGC17_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC18_AVAILABLE             1
#define FM_MFT_PPG_PPGC18_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC19_AVAILABLE             1
#define FM_MFT_PPG_PPGC19_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC2_AVAILABLE              1
#define FM_MFT_PPG_PPGC2_AVAILABLE                1
#define FM0P_MFT_PPG_PPGC20_AVAILABLE             1
#define FM_MFT_PPG_PPGC20_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC21_AVAILABLE             1
#define FM_MFT_PPG_PPGC21_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC22_AVAILABLE             1
#define FM_MFT_PPG_PPGC22_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC23_AVAILABLE             1
#define FM_MFT_PPG_PPGC23_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC3_AVAILABLE              1
#define FM_MFT_PPG_PPGC3_AVAILABLE                1
#define FM0P_MFT_PPG_PPGC4_AVAILABLE              1
#define FM_MFT_PPG_PPGC4_AVAILABLE                1
#define FM0P_MFT_PPG_PPGC5_AVAILABLE              1
#define FM_MFT_PPG_PPGC5_AVAILABLE                1
#define FM0P_MFT_PPG_PPGC6_AVAILABLE              1
#define FM_MFT_PPG_PPGC6_AVAILABLE                1
#define FM0P_MFT_PPG_PPGC7_AVAILABLE              1
#define FM_MFT_PPG_PPGC7_AVAILABLE                1
#define FM0P_MFT_PPG_PPGC8_AVAILABLE              1
#define FM_MFT_PPG_PPGC8_AVAILABLE                1
#define FM0P_MFT_PPG_PPGC9_AVAILABLE              1
#define FM_MFT_PPG_PPGC9_AVAILABLE                1
#define FM0P_MFT_PPG_PRLH0_AVAILABLE              1
#define FM_MFT_PPG_PRLH0_AVAILABLE                1
#define FM0P_MFT_PPG_PRLH1_AVAILABLE              1
#define FM_MFT_PPG_PRLH1_AVAILABLE                1
#define FM0P_MFT_PPG_PRLH10_AVAILABLE             1
#define FM_MFT_PPG_PRLH10_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH11_AVAILABLE             1
#define FM_MFT_PPG_PRLH11_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH12_AVAILABLE             1
#define FM_MFT_PPG_PRLH12_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH13_AVAILABLE             1
#define FM_MFT_PPG_PRLH13_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH14_AVAILABLE             1
#define FM_MFT_PPG_PRLH14_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH15_AVAILABLE             1
#define FM_MFT_PPG_PRLH15_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH16_AVAILABLE             1
#define FM_MFT_PPG_PRLH16_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH17_AVAILABLE             1
#define FM_MFT_PPG_PRLH17_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH18_AVAILABLE             1
#define FM_MFT_PPG_PRLH18_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH19_AVAILABLE             1
#define FM_MFT_PPG_PRLH19_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH2_AVAILABLE              1
#define FM_MFT_PPG_PRLH2_AVAILABLE                1
#define FM0P_MFT_PPG_PRLH20_AVAILABLE             1
#define FM_MFT_PPG_PRLH20_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH21_AVAILABLE             1
#define FM_MFT_PPG_PRLH21_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH22_AVAILABLE             1
#define FM_MFT_PPG_PRLH22_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH23_AVAILABLE             1
#define FM_MFT_PPG_PRLH23_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH3_AVAILABLE              1
#define FM_MFT_PPG_PRLH3_AVAILABLE                1
#define FM0P_MFT_PPG_PRLH4_AVAILABLE              1
#define FM_MFT_PPG_PRLH4_AVAILABLE                1
#define FM0P_MFT_PPG_PRLH5_AVAILABLE              1
#define FM_MFT_PPG_PRLH5_AVAILABLE                1
#define FM0P_MFT_PPG_PRLH6_AVAILABLE              1
#define FM_MFT_PPG_PRLH6_AVAILABLE                1
#define FM0P_MFT_PPG_PRLH7_AVAILABLE              1
#define FM_MFT_PPG_PRLH7_AVAILABLE                1
#define FM0P_MFT_PPG_PRLH8_AVAILABLE              1
#define FM_MFT_PPG_PRLH8_AVAILABLE                1
#define FM0P_MFT_PPG_PRLH9_AVAILABLE              1
#define FM_MFT_PPG_PRLH9_AVAILABLE                1
#define FM0P_MFT_PPG_PRLL0_AVAILABLE              1
#define FM_MFT_PPG_PRLL0_AVAILABLE                1
#define FM0P_MFT_PPG_PRLL1_AVAILABLE              1
#define FM_MFT_PPG_PRLL1_AVAILABLE                1
#define FM0P_MFT_PPG_PRLL10_AVAILABLE             1
#define FM_MFT_PPG_PRLL10_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL11_AVAILABLE             1
#define FM_MFT_PPG_PRLL11_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL12_AVAILABLE             1
#define FM_MFT_PPG_PRLL12_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL13_AVAILABLE             1
#define FM_MFT_PPG_PRLL13_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL14_AVAILABLE             1
#define FM_MFT_PPG_PRLL14_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL15_AVAILABLE             1
#define FM_MFT_PPG_PRLL15_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL16_AVAILABLE             1
#define FM_MFT_PPG_PRLL16_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL17_AVAILABLE             1
#define FM_MFT_PPG_PRLL17_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL18_AVAILABLE             1
#define FM_MFT_PPG_PRLL18_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL19_AVAILABLE             1
#define FM_MFT_PPG_PRLL19_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL2_AVAILABLE              1
#define FM_MFT_PPG_PRLL2_AVAILABLE                1
#define FM0P_MFT_PPG_PRLL20_AVAILABLE             1
#define FM_MFT_PPG_PRLL20_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL21_AVAILABLE             1
#define FM_MFT_PPG_PRLL21_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL22_AVAILABLE             1
#define FM_MFT_PPG_PRLL22_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL23_AVAILABLE             1
#define FM_MFT_PPG_PRLL23_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL3_AVAILABLE              1
#define FM_MFT_PPG_PRLL3_AVAILABLE                1
#define FM0P_MFT_PPG_PRLL4_AVAILABLE              1
#define FM_MFT_PPG_PRLL4_AVAILABLE                1
#define FM0P_MFT_PPG_PRLL5_AVAILABLE              1
#define FM_MFT_PPG_PRLL5_AVAILABLE                1
#define FM0P_MFT_PPG_PRLL6_AVAILABLE              1
#define FM_MFT_PPG_PRLL6_AVAILABLE                1
#define FM0P_MFT_PPG_PRLL7_AVAILABLE              1
#define FM_MFT_PPG_PRLL7_AVAILABLE                1
#define FM0P_MFT_PPG_PRLL8_AVAILABLE              1
#define FM_MFT_PPG_PRLL8_AVAILABLE                1
#define FM0P_MFT_PPG_PRLL9_AVAILABLE              1
#define FM_MFT_PPG_PRLL9_AVAILABLE                1
#define FM0P_MFT_PPG_REVC0_AVAILABLE              1
#define FM_MFT_PPG_REVC0_AVAILABLE                1
#define FM0P_MFT_PPG_REVC1_AVAILABLE              1
#define FM_MFT_PPG_REVC1_AVAILABLE                1
#define FM0P_MFT_PPG_TRG0_AVAILABLE               1
#define FM_MFT_PPG_TRG0_AVAILABLE                 1
#define FM0P_MFT_PPG_TRG1_AVAILABLE               1
#define FM_MFT_PPG_TRG1_AVAILABLE                 1
#define FM0P_MFT_PPG_TTCR0_AVAILABLE              1
#define FM_MFT_PPG_TTCR0_AVAILABLE                1
#define FM0P_MFT_PPG_TTCR1_AVAILABLE              1
#define FM_MFT_PPG_TTCR1_AVAILABLE                1
#define FM0P_MFT_PPG_TTCR2_AVAILABLE              1
#define FM_MFT_PPG_TTCR2_AVAILABLE                1
/*******************************************************************************
* MTB_DWT
*******************************************************************************/
#define FM0P_MTB_DWT_CID0_AVAILABLE               1
#define FM_MTB_DWT_CID0_AVAILABLE                 1
#define FM0P_MTB_DWT_CID1_AVAILABLE               1
#define FM_MTB_DWT_CID1_AVAILABLE                 1
#define FM0P_MTB_DWT_CID2_AVAILABLE               1
#define FM_MTB_DWT_CID2_AVAILABLE                 1
#define FM0P_MTB_DWT_CID3_AVAILABLE               1
#define FM_MTB_DWT_CID3_AVAILABLE                 1
#define FM0P_MTB_DWT_CMP_ADDR_START_AVAILABLE     1
#define FM_MTB_DWT_CMP_ADDR_START_AVAILABLE       1
#define FM0P_MTB_DWT_CMP_ADDR_STOP_AVAILABLE      1
#define FM_MTB_DWT_CMP_ADDR_STOP_AVAILABLE        1
#define FM0P_MTB_DWT_CMP_DATA_START_AVAILABLE     1
#define FM_MTB_DWT_CMP_DATA_START_AVAILABLE       1
#define FM0P_MTB_DWT_CMP_DATA_STOP_AVAILABLE      1
#define FM_MTB_DWT_CMP_DATA_STOP_AVAILABLE        1
#define FM0P_MTB_DWT_CMP_MASK_START_AVAILABLE     1
#define FM_MTB_DWT_CMP_MASK_START_AVAILABLE       1
#define FM0P_MTB_DWT_CMP_MASK_STOP_AVAILABLE      1
#define FM_MTB_DWT_CMP_MASK_STOP_AVAILABLE        1
#define FM0P_MTB_DWT_FCT_AVAILABLE                1
#define FM_MTB_DWT_FCT_AVAILABLE                  1
#define FM0P_MTB_DWT_PID0_AVAILABLE               1
#define FM_MTB_DWT_PID0_AVAILABLE                 1
#define FM0P_MTB_DWT_PID1_AVAILABLE               1
#define FM_MTB_DWT_PID1_AVAILABLE                 1
#define FM0P_MTB_DWT_PID2_AVAILABLE               1
#define FM_MTB_DWT_PID2_AVAILABLE                 1
#define FM0P_MTB_DWT_PID3_AVAILABLE               1
#define FM_MTB_DWT_PID3_AVAILABLE                 1
#define FM0P_MTB_DWT_PID4_AVAILABLE               1
#define FM_MTB_DWT_PID4_AVAILABLE                 1
#define FM0P_MTB_DWT_PID5_AVAILABLE               1
#define FM_MTB_DWT_PID5_AVAILABLE                 1
#define FM0P_MTB_DWT_PID6_AVAILABLE               1
#define FM_MTB_DWT_PID6_AVAILABLE                 1
#define FM0P_MTB_DWT_PID7_AVAILABLE               1
#define FM_MTB_DWT_PID7_AVAILABLE                 1
/*******************************************************************************
* RTC
*******************************************************************************/
#define FM0P_RTC_ALDR_AVAILABLE                   1
#define FM_RTC_ALDR_AVAILABLE                     1
#define FM0P_RTC_ALHR_AVAILABLE                   1
#define FM_RTC_ALHR_AVAILABLE                     1
#define FM0P_RTC_ALMIR_AVAILABLE                  1
#define FM_RTC_ALMIR_AVAILABLE                    1
#define FM0P_RTC_ALMOR_AVAILABLE                  1
#define FM_RTC_ALMOR_AVAILABLE                    1
#define FM0P_RTC_ALYR_AVAILABLE                   1
#define FM_RTC_ALYR_AVAILABLE                     1
#define FM0P_RTC_BOOST_AVAILABLE                  1
#define FM_RTC_BOOST_AVAILABLE                    1
#define FM0P_RTC_BREG00_AVAILABLE                 1
#define FM_RTC_BREG00_AVAILABLE                   1
#define FM0P_RTC_BREG01_AVAILABLE                 1
#define FM_RTC_BREG01_AVAILABLE                   1
#define FM0P_RTC_BREG02_AVAILABLE                 1
#define FM_RTC_BREG02_AVAILABLE                   1
#define FM0P_RTC_BREG03_AVAILABLE                 1
#define FM_RTC_BREG03_AVAILABLE                   1
#define FM0P_RTC_BREG04_AVAILABLE                 1
#define FM_RTC_BREG04_AVAILABLE                   1
#define FM0P_RTC_BREG05_AVAILABLE                 1
#define FM_RTC_BREG05_AVAILABLE                   1
#define FM0P_RTC_BREG06_AVAILABLE                 1
#define FM_RTC_BREG06_AVAILABLE                   1
#define FM0P_RTC_BREG07_AVAILABLE                 1
#define FM_RTC_BREG07_AVAILABLE                   1
#define FM0P_RTC_BREG08_AVAILABLE                 1
#define FM_RTC_BREG08_AVAILABLE                   1
#define FM0P_RTC_BREG09_AVAILABLE                 1
#define FM_RTC_BREG09_AVAILABLE                   1
#define FM0P_RTC_BREG0A_AVAILABLE                 1
#define FM_RTC_BREG0A_AVAILABLE                   1
#define FM0P_RTC_BREG0B_AVAILABLE                 1
#define FM_RTC_BREG0B_AVAILABLE                   1
#define FM0P_RTC_BREG0C_AVAILABLE                 1
#define FM_RTC_BREG0C_AVAILABLE                   1
#define FM0P_RTC_BREG0D_AVAILABLE                 1
#define FM_RTC_BREG0D_AVAILABLE                   1
#define FM0P_RTC_BREG0E_AVAILABLE                 1
#define FM_RTC_BREG0E_AVAILABLE                   1
#define FM0P_RTC_BREG0F_AVAILABLE                 1
#define FM_RTC_BREG0F_AVAILABLE                   1
#define FM0P_RTC_BREG10_AVAILABLE                 1
#define FM_RTC_BREG10_AVAILABLE                   1
#define FM0P_RTC_BREG11_AVAILABLE                 1
#define FM_RTC_BREG11_AVAILABLE                   1
#define FM0P_RTC_BREG12_AVAILABLE                 1
#define FM_RTC_BREG12_AVAILABLE                   1
#define FM0P_RTC_BREG13_AVAILABLE                 1
#define FM_RTC_BREG13_AVAILABLE                   1
#define FM0P_RTC_BREG14_AVAILABLE                 1
#define FM_RTC_BREG14_AVAILABLE                   1
#define FM0P_RTC_BREG15_AVAILABLE                 1
#define FM_RTC_BREG15_AVAILABLE                   1
#define FM0P_RTC_BREG16_AVAILABLE                 1
#define FM_RTC_BREG16_AVAILABLE                   1
#define FM0P_RTC_BREG17_AVAILABLE                 1
#define FM_RTC_BREG17_AVAILABLE                   1
#define FM0P_RTC_BREG18_AVAILABLE                 1
#define FM_RTC_BREG18_AVAILABLE                   1
#define FM0P_RTC_BREG19_AVAILABLE                 1
#define FM_RTC_BREG19_AVAILABLE                   1
#define FM0P_RTC_BREG1A_AVAILABLE                 1
#define FM_RTC_BREG1A_AVAILABLE                   1
#define FM0P_RTC_BREG1B_AVAILABLE                 1
#define FM_RTC_BREG1B_AVAILABLE                   1
#define FM0P_RTC_BREG1C_AVAILABLE                 1
#define FM_RTC_BREG1C_AVAILABLE                   1
#define FM0P_RTC_BREG1D_AVAILABLE                 1
#define FM_RTC_BREG1D_AVAILABLE                   1
#define FM0P_RTC_BREG1E_AVAILABLE                 1
#define FM_RTC_BREG1E_AVAILABLE                   1
#define FM0P_RTC_BREG1F_AVAILABLE                 1
#define FM_RTC_BREG1F_AVAILABLE                   1
#define FM0P_RTC_BREG20_AVAILABLE                 1
#define FM_RTC_BREG20_AVAILABLE                   1
#define FM0P_RTC_BREG21_AVAILABLE                 1
#define FM_RTC_BREG21_AVAILABLE                   1
#define FM0P_RTC_BREG22_AVAILABLE                 1
#define FM_RTC_BREG22_AVAILABLE                   1
#define FM0P_RTC_BREG23_AVAILABLE                 1
#define FM_RTC_BREG23_AVAILABLE                   1
#define FM0P_RTC_BREG24_AVAILABLE                 1
#define FM_RTC_BREG24_AVAILABLE                   1
#define FM0P_RTC_BREG25_AVAILABLE                 1
#define FM_RTC_BREG25_AVAILABLE                   1
#define FM0P_RTC_BREG26_AVAILABLE                 1
#define FM_RTC_BREG26_AVAILABLE                   1
#define FM0P_RTC_BREG27_AVAILABLE                 1
#define FM_RTC_BREG27_AVAILABLE                   1
#define FM0P_RTC_BREG28_AVAILABLE                 1
#define FM_RTC_BREG28_AVAILABLE                   1
#define FM0P_RTC_BREG29_AVAILABLE                 1
#define FM_RTC_BREG29_AVAILABLE                   1
#define FM0P_RTC_BREG2A_AVAILABLE                 1
#define FM_RTC_BREG2A_AVAILABLE                   1
#define FM0P_RTC_BREG2B_AVAILABLE                 1
#define FM_RTC_BREG2B_AVAILABLE                   1
#define FM0P_RTC_BREG2C_AVAILABLE                 1
#define FM_RTC_BREG2C_AVAILABLE                   1
#define FM0P_RTC_BREG2D_AVAILABLE                 1
#define FM_RTC_BREG2D_AVAILABLE                   1
#define FM0P_RTC_BREG2E_AVAILABLE                 1
#define FM_RTC_BREG2E_AVAILABLE                   1
#define FM0P_RTC_BREG2F_AVAILABLE                 1
#define FM_RTC_BREG2F_AVAILABLE                   1
#define FM0P_RTC_BREG30_AVAILABLE                 1
#define FM_RTC_BREG30_AVAILABLE                   1
#define FM0P_RTC_BREG31_AVAILABLE                 1
#define FM_RTC_BREG31_AVAILABLE                   1
#define FM0P_RTC_BREG32_AVAILABLE                 1
#define FM_RTC_BREG32_AVAILABLE                   1
#define FM0P_RTC_BREG33_AVAILABLE                 1
#define FM_RTC_BREG33_AVAILABLE                   1
#define FM0P_RTC_BREG34_AVAILABLE                 1
#define FM_RTC_BREG34_AVAILABLE                   1
#define FM0P_RTC_BREG35_AVAILABLE                 1
#define FM_RTC_BREG35_AVAILABLE                   1
#define FM0P_RTC_BREG36_AVAILABLE                 1
#define FM_RTC_BREG36_AVAILABLE                   1
#define FM0P_RTC_BREG37_AVAILABLE                 1
#define FM_RTC_BREG37_AVAILABLE                   1
#define FM0P_RTC_BREG38_AVAILABLE                 1
#define FM_RTC_BREG38_AVAILABLE                   1
#define FM0P_RTC_BREG39_AVAILABLE                 1
#define FM_RTC_BREG39_AVAILABLE                   1
#define FM0P_RTC_BREG3A_AVAILABLE                 1
#define FM_RTC_BREG3A_AVAILABLE                   1
#define FM0P_RTC_BREG3B_AVAILABLE                 1
#define FM_RTC_BREG3B_AVAILABLE                   1
#define FM0P_RTC_BREG3C_AVAILABLE                 1
#define FM_RTC_BREG3C_AVAILABLE                   1
#define FM0P_RTC_BREG3D_AVAILABLE                 1
#define FM_RTC_BREG3D_AVAILABLE                   1
#define FM0P_RTC_BREG3E_AVAILABLE                 1
#define FM_RTC_BREG3E_AVAILABLE                   1
#define FM0P_RTC_BREG3F_AVAILABLE                 1
#define FM_RTC_BREG3F_AVAILABLE                   1
#define FM0P_RTC_BREG40_AVAILABLE                 1
#define FM_RTC_BREG40_AVAILABLE                   1
#define FM0P_RTC_BREG41_AVAILABLE                 1
#define FM_RTC_BREG41_AVAILABLE                   1
#define FM0P_RTC_BREG42_AVAILABLE                 1
#define FM_RTC_BREG42_AVAILABLE                   1
#define FM0P_RTC_BREG43_AVAILABLE                 1
#define FM_RTC_BREG43_AVAILABLE                   1
#define FM0P_RTC_BREG44_AVAILABLE                 1
#define FM_RTC_BREG44_AVAILABLE                   1
#define FM0P_RTC_BREG45_AVAILABLE                 1
#define FM_RTC_BREG45_AVAILABLE                   1
#define FM0P_RTC_BREG46_AVAILABLE                 1
#define FM_RTC_BREG46_AVAILABLE                   1
#define FM0P_RTC_BREG47_AVAILABLE                 1
#define FM_RTC_BREG47_AVAILABLE                   1
#define FM0P_RTC_BREG48_AVAILABLE                 1
#define FM_RTC_BREG48_AVAILABLE                   1
#define FM0P_RTC_BREG49_AVAILABLE                 1
#define FM_RTC_BREG49_AVAILABLE                   1
#define FM0P_RTC_BREG4A_AVAILABLE                 1
#define FM_RTC_BREG4A_AVAILABLE                   1
#define FM0P_RTC_BREG4B_AVAILABLE                 1
#define FM_RTC_BREG4B_AVAILABLE                   1
#define FM0P_RTC_BREG4C_AVAILABLE                 1
#define FM_RTC_BREG4C_AVAILABLE                   1
#define FM0P_RTC_BREG4D_AVAILABLE                 1
#define FM_RTC_BREG4D_AVAILABLE                   1
#define FM0P_RTC_BREG4E_AVAILABLE                 1
#define FM_RTC_BREG4E_AVAILABLE                   1
#define FM0P_RTC_BREG4F_AVAILABLE                 1
#define FM_RTC_BREG4F_AVAILABLE                   1
#define FM0P_RTC_BREG50_AVAILABLE                 1
#define FM_RTC_BREG50_AVAILABLE                   1
#define FM0P_RTC_BREG51_AVAILABLE                 1
#define FM_RTC_BREG51_AVAILABLE                   1
#define FM0P_RTC_BREG52_AVAILABLE                 1
#define FM_RTC_BREG52_AVAILABLE                   1
#define FM0P_RTC_BREG53_AVAILABLE                 1
#define FM_RTC_BREG53_AVAILABLE                   1
#define FM0P_RTC_BREG54_AVAILABLE                 1
#define FM_RTC_BREG54_AVAILABLE                   1
#define FM0P_RTC_BREG55_AVAILABLE                 1
#define FM_RTC_BREG55_AVAILABLE                   1
#define FM0P_RTC_BREG56_AVAILABLE                 1
#define FM_RTC_BREG56_AVAILABLE                   1
#define FM0P_RTC_BREG57_AVAILABLE                 1
#define FM_RTC_BREG57_AVAILABLE                   1
#define FM0P_RTC_BREG58_AVAILABLE                 1
#define FM_RTC_BREG58_AVAILABLE                   1
#define FM0P_RTC_BREG59_AVAILABLE                 1
#define FM_RTC_BREG59_AVAILABLE                   1
#define FM0P_RTC_BREG5A_AVAILABLE                 1
#define FM_RTC_BREG5A_AVAILABLE                   1
#define FM0P_RTC_BREG5B_AVAILABLE                 1
#define FM_RTC_BREG5B_AVAILABLE                   1
#define FM0P_RTC_BREG5C_AVAILABLE                 1
#define FM_RTC_BREG5C_AVAILABLE                   1
#define FM0P_RTC_BREG5D_AVAILABLE                 1
#define FM_RTC_BREG5D_AVAILABLE                   1
#define FM0P_RTC_BREG5E_AVAILABLE                 1
#define FM_RTC_BREG5E_AVAILABLE                   1
