mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xg/common/s6e1b8xg.h
#define FM0P_RTC_BREG5F_AVAILABLE                 1
#define FM_RTC_BREG5F_AVAILABLE                   1
#define FM0P_RTC_BREG60_AVAILABLE                 1
#define FM_RTC_BREG60_AVAILABLE                   1
#define FM0P_RTC_BREG61_AVAILABLE                 1
#define FM_RTC_BREG61_AVAILABLE                   1
#define FM0P_RTC_BREG62_AVAILABLE                 1
#define FM_RTC_BREG62_AVAILABLE                   1
#define FM0P_RTC_BREG63_AVAILABLE                 1
#define FM_RTC_BREG63_AVAILABLE                   1
#define FM0P_RTC_BREG64_AVAILABLE                 1
#define FM_RTC_BREG64_AVAILABLE                   1
#define FM0P_RTC_BREG65_AVAILABLE                 1
#define FM_RTC_BREG65_AVAILABLE                   1
#define FM0P_RTC_BREG66_AVAILABLE                 1
#define FM_RTC_BREG66_AVAILABLE                   1
#define FM0P_RTC_BREG67_AVAILABLE                 1
#define FM_RTC_BREG67_AVAILABLE                   1
#define FM0P_RTC_BREG68_AVAILABLE                 1
#define FM_RTC_BREG68_AVAILABLE                   1
#define FM0P_RTC_BREG69_AVAILABLE                 1
#define FM_RTC_BREG69_AVAILABLE                   1
#define FM0P_RTC_BREG6A_AVAILABLE                 1
#define FM_RTC_BREG6A_AVAILABLE                   1
#define FM0P_RTC_BREG6B_AVAILABLE                 1
#define FM_RTC_BREG6B_AVAILABLE                   1
#define FM0P_RTC_BREG6C_AVAILABLE                 1
#define FM_RTC_BREG6C_AVAILABLE                   1
#define FM0P_RTC_BREG6D_AVAILABLE                 1
#define FM_RTC_BREG6D_AVAILABLE                   1
#define FM0P_RTC_BREG6E_AVAILABLE                 1
#define FM_RTC_BREG6E_AVAILABLE                   1
#define FM0P_RTC_BREG6F_AVAILABLE                 1
#define FM_RTC_BREG6F_AVAILABLE                   1
#define FM0P_RTC_BREG70_AVAILABLE                 1
#define FM_RTC_BREG70_AVAILABLE                   1
#define FM0P_RTC_BREG71_AVAILABLE                 1
#define FM_RTC_BREG71_AVAILABLE                   1
#define FM0P_RTC_BREG72_AVAILABLE                 1
#define FM_RTC_BREG72_AVAILABLE                   1
#define FM0P_RTC_BREG73_AVAILABLE                 1
#define FM_RTC_BREG73_AVAILABLE                   1
#define FM0P_RTC_BREG74_AVAILABLE                 1
#define FM_RTC_BREG74_AVAILABLE                   1
#define FM0P_RTC_BREG75_AVAILABLE                 1
#define FM_RTC_BREG75_AVAILABLE                   1
#define FM0P_RTC_BREG76_AVAILABLE                 1
#define FM_RTC_BREG76_AVAILABLE                   1
#define FM0P_RTC_BREG77_AVAILABLE                 1
#define FM_RTC_BREG77_AVAILABLE                   1
#define FM0P_RTC_BREG78_AVAILABLE                 1
#define FM_RTC_BREG78_AVAILABLE                   1
#define FM0P_RTC_BREG79_AVAILABLE                 1
#define FM_RTC_BREG79_AVAILABLE                   1
#define FM0P_RTC_BREG7A_AVAILABLE                 1
#define FM_RTC_BREG7A_AVAILABLE                   1
#define FM0P_RTC_BREG7B_AVAILABLE                 1
#define FM_RTC_BREG7B_AVAILABLE                   1
#define FM0P_RTC_BREG7C_AVAILABLE                 1
#define FM_RTC_BREG7C_AVAILABLE                   1
#define FM0P_RTC_BREG7D_AVAILABLE                 1
#define FM_RTC_BREG7D_AVAILABLE                   1
#define FM0P_RTC_BREG7E_AVAILABLE                 1
#define FM_RTC_BREG7E_AVAILABLE                   1
#define FM0P_RTC_BREG7F_AVAILABLE                 1
#define FM_RTC_BREG7F_AVAILABLE                   1
#define FM0P_RTC_CCB_AVAILABLE                    1
#define FM_RTC_CCB_AVAILABLE                      1
#define FM0P_RTC_CCS_AVAILABLE                    1
#define FM_RTC_CCS_AVAILABLE                      1
#define FM0P_RTC_EWKUP_AVAILABLE                  1
#define FM_RTC_EWKUP_AVAILABLE                    1
#define FM0P_RTC_HIBRST_AVAILABLE                 1
#define FM_RTC_HIBRST_AVAILABLE                   1
#define FM0P_RTC_VB_CLKDIV_AVAILABLE              1
#define FM_RTC_VB_CLKDIV_AVAILABLE                1
#define FM0P_RTC_VBDDR_AVAILABLE                  1
#define FM_RTC_VBDDR_AVAILABLE                    1
#define FM0P_RTC_VBDIR_AVAILABLE                  1
#define FM_RTC_VBDIR_AVAILABLE                    1
#define FM0P_RTC_VBDOR_AVAILABLE                  1
#define FM_RTC_VBDOR_AVAILABLE                    1
#define FM0P_RTC_VBPCR_AVAILABLE                  1
#define FM_RTC_VBPCR_AVAILABLE                    1
#define FM0P_RTC_VBPFR_AVAILABLE                  1
#define FM_RTC_VBPFR_AVAILABLE                    1
#define FM0P_RTC_VBPZR_AVAILABLE                  1
#define FM_RTC_VBPZR_AVAILABLE                    1
#define FM0P_RTC_VDET_AVAILABLE                   1
#define FM_RTC_VDET_AVAILABLE                     1
#define FM0P_RTC_WTCAL0_AVAILABLE                 1
#define FM_RTC_WTCAL0_AVAILABLE                   1
#define FM0P_RTC_WTCAL1_AVAILABLE                 1
#define FM_RTC_WTCAL1_AVAILABLE                   1
#define FM0P_RTC_WTCALEN_AVAILABLE                1
#define FM_RTC_WTCALEN_AVAILABLE                  1
#define FM0P_RTC_WTCALPRD_AVAILABLE               1
#define FM_RTC_WTCALPRD_AVAILABLE                 1
#define FM0P_RTC_WTCOSEL_AVAILABLE                1
#define FM_RTC_WTCOSEL_AVAILABLE                  1
#define FM0P_RTC_WTCR10_AVAILABLE                 1
#define FM_RTC_WTCR10_AVAILABLE                   1
#define FM0P_RTC_WTCR11_AVAILABLE                 1
#define FM_RTC_WTCR11_AVAILABLE                   1
#define FM0P_RTC_WTCR12_AVAILABLE                 1
#define FM_RTC_WTCR12_AVAILABLE                   1
#define FM0P_RTC_WTCR13_AVAILABLE                 1
#define FM_RTC_WTCR13_AVAILABLE                   1
#define FM0P_RTC_WTCR20_AVAILABLE                 1
#define FM_RTC_WTCR20_AVAILABLE                   1
#define FM0P_RTC_WTCR21_AVAILABLE                 1
#define FM_RTC_WTCR21_AVAILABLE                   1
#define FM0P_RTC_WTDIV_AVAILABLE                  1
#define FM_RTC_WTDIV_AVAILABLE                    1
#define FM0P_RTC_WTDIVEN_AVAILABLE                1
#define FM_RTC_WTDIVEN_AVAILABLE                  1
#define FM0P_RTC_WTDR_AVAILABLE                   1
#define FM_RTC_WTDR_AVAILABLE                     1
#define FM0P_RTC_WTDW_AVAILABLE                   1
#define FM_RTC_WTDW_AVAILABLE                     1
#define FM0P_RTC_WTHR_AVAILABLE                   1
#define FM_RTC_WTHR_AVAILABLE                     1
#define FM0P_RTC_WTMIR_AVAILABLE                  1
#define FM_RTC_WTMIR_AVAILABLE                    1
#define FM0P_RTC_WTMOR_AVAILABLE                  1
#define FM_RTC_WTMOR_AVAILABLE                    1
#define FM0P_RTC_WTOSCCNT_AVAILABLE               1
#define FM_RTC_WTOSCCNT_AVAILABLE                 1
#define FM0P_RTC_WTSR_AVAILABLE                   1
#define FM_RTC_WTSR_AVAILABLE                     1
#define FM0P_RTC_WTTR0_AVAILABLE                  1
#define FM_RTC_WTTR0_AVAILABLE                    1
#define FM0P_RTC_WTTR1_AVAILABLE                  1
#define FM_RTC_WTTR1_AVAILABLE                    1
#define FM0P_RTC_WTTR2_AVAILABLE                  1
#define FM_RTC_WTTR2_AVAILABLE                    1
#define FM0P_RTC_WTYR_AVAILABLE                   1
#define FM_RTC_WTYR_AVAILABLE                     1
/*******************************************************************************
* SBSSR
*******************************************************************************/
#define FM0P_SBSSR_BTSSSR_AVAILABLE               1
#define FM_SBSSR_BTSSSR_AVAILABLE                 1
/*******************************************************************************
* SMCIF0
*******************************************************************************/
#define FM0P_SMCIF_BAUDRATE_AVAILABLE             1
#define FM_SMCIF_BAUDRATE_AVAILABLE               1
#define FM0P_SMCIF_CARDCLOCK_AVAILABLE            1
#define FM_SMCIF_CARDCLOCK_AVAILABLE              1
#define FM0P_SMCIF_DATA_AVAILABLE                 1
#define FM_SMCIF_DATA_AVAILABLE                   1
#define FM0P_SMCIF_DATA_FIFO_AVAILABLE            1
#define FM_SMCIF_DATA_FIFO_AVAILABLE              1
#define FM0P_SMCIF_FIFO_CLEAR_MSB_READ_AVAILABLE  1
#define FM_SMCIF_FIFO_CLEAR_MSB_READ_AVAILABLE    1
#define FM0P_SMCIF_FIFO_CLEAR_MSB_WRITE_AVAILABLE 1
#define FM_SMCIF_FIFO_CLEAR_MSB_WRITE_AVAILABLE   1
#define FM0P_SMCIF_FIFO_LEVEL_READ_AVAILABLE      1
#define FM_SMCIF_FIFO_LEVEL_READ_AVAILABLE        1
#define FM0P_SMCIF_FIFO_LEVEL_WRITE_AVAILABLE     1
#define FM_SMCIF_FIFO_LEVEL_WRITE_AVAILABLE       1
#define FM0P_SMCIF_FIFO_MODE_AVAILABLE            1
#define FM_SMCIF_FIFO_MODE_AVAILABLE              1
#define FM0P_SMCIF_GLOBALCONTROL1_AVAILABLE       1
#define FM_SMCIF_GLOBALCONTROL1_AVAILABLE         1
#define FM0P_SMCIF_GLOBALCONTROL2_AVAILABLE       1
#define FM_SMCIF_GLOBALCONTROL2_AVAILABLE         1
#define FM0P_SMCIF_GUARDTIMER_AVAILABLE           1
#define FM_SMCIF_GUARDTIMER_AVAILABLE             1
#define FM0P_SMCIF_IDLETIMER_AVAILABLE            1
#define FM_SMCIF_IDLETIMER_AVAILABLE              1
#define FM0P_SMCIF_IRQ_STATUS_AVAILABLE           1
#define FM_SMCIF_IRQ_STATUS_AVAILABLE             1
#define FM0P_SMCIF_PORTCONTROL_AVAILABLE          1
#define FM_SMCIF_PORTCONTROL_AVAILABLE            1
#define FM0P_SMCIF_STATUS_AVAILABLE               1
#define FM_SMCIF_STATUS_AVAILABLE                 1
/*******************************************************************************
* SWWDT
*******************************************************************************/
#define FM0P_SWWDT_WDOGCONTROL_AVAILABLE          1
#define FM_SWWDT_WDOGCONTROL_AVAILABLE            1
#define FM0P_SWWDT_WDOGINTCLR_AVAILABLE           1
#define FM_SWWDT_WDOGINTCLR_AVAILABLE             1
#define FM0P_SWWDT_WDOGLOAD_AVAILABLE             1
#define FM_SWWDT_WDOGLOAD_AVAILABLE               1
#define FM0P_SWWDT_WDOGLOCK_AVAILABLE             1
#define FM_SWWDT_WDOGLOCK_AVAILABLE               1
#define FM0P_SWWDT_WDOGRIS_AVAILABLE              1
#define FM_SWWDT_WDOGRIS_AVAILABLE                1
#define FM0P_SWWDT_WDOGSPMC_AVAILABLE             1
#define FM_SWWDT_WDOGSPMC_AVAILABLE               1
#define FM0P_SWWDT_WDOGVALUE_AVAILABLE            1
#define FM_SWWDT_WDOGVALUE_AVAILABLE              1
/*******************************************************************************
* UNIQUE_ID
*******************************************************************************/
#define FM0P_UNIQUE_ID_UIDR0_AVAILABLE            1
#define FM_UNIQUE_ID_UIDR0_AVAILABLE              1
#define FM0P_UNIQUE_ID_UIDR1_AVAILABLE            1
#define FM_UNIQUE_ID_UIDR1_AVAILABLE              1
/*******************************************************************************
* USB0
*******************************************************************************/
#define FM0P_USB_EP0C_AVAILABLE                   1
#define FM_USB_EP0C_AVAILABLE                     1
#define FM0P_USB_EP0DT_AVAILABLE                  1
#define FM_USB_EP0DT_AVAILABLE                    1
#define FM0P_USB_EP0IS_AVAILABLE                  1
#define FM_USB_EP0IS_AVAILABLE                    1
#define FM0P_USB_EP0OS_AVAILABLE                  1
#define FM_USB_EP0OS_AVAILABLE                    1
#define FM0P_USB_EP1C_AVAILABLE                   1
#define FM_USB_EP1C_AVAILABLE                     1
#define FM0P_USB_EP1DT_AVAILABLE                  1
#define FM_USB_EP1DT_AVAILABLE                    1
#define FM0P_USB_EP1S_AVAILABLE                   1
#define FM_USB_EP1S_AVAILABLE                     1
#define FM0P_USB_EP2C_AVAILABLE                   1
#define FM_USB_EP2C_AVAILABLE                     1
#define FM0P_USB_EP2DT_AVAILABLE                  1
#define FM_USB_EP2DT_AVAILABLE                    1
#define FM0P_USB_EP2S_AVAILABLE                   1
#define FM_USB_EP2S_AVAILABLE                     1
#define FM0P_USB_EP3C_AVAILABLE                   1
#define FM_USB_EP3C_AVAILABLE                     1
#define FM0P_USB_EP3DT_AVAILABLE                  1
#define FM_USB_EP3DT_AVAILABLE                    1
#define FM0P_USB_EP3S_AVAILABLE                   1
#define FM_USB_EP3S_AVAILABLE                     1
#define FM0P_USB_EP4C_AVAILABLE                   1
#define FM_USB_EP4C_AVAILABLE                     1
#define FM0P_USB_EP4DT_AVAILABLE                  1
#define FM_USB_EP4DT_AVAILABLE                    1
#define FM0P_USB_EP4S_AVAILABLE                   1
#define FM_USB_EP4S_AVAILABLE                     1
#define FM0P_USB_EP5C_AVAILABLE                   1
#define FM_USB_EP5C_AVAILABLE                     1
#define FM0P_USB_EP5DT_AVAILABLE                  1
#define FM_USB_EP5DT_AVAILABLE                    1
#define FM0P_USB_EP5S_AVAILABLE                   1
#define FM_USB_EP5S_AVAILABLE                     1
#define FM0P_USB_HADR_AVAILABLE                   1
#define FM_USB_HADR_AVAILABLE                     1
#define FM0P_USB_HCNT_AVAILABLE                   1
#define FM_USB_HCNT_AVAILABLE                     1
#define FM0P_USB_HEOF_AVAILABLE                   1
#define FM_USB_HEOF_AVAILABLE                     1
#define FM0P_USB_HERR_AVAILABLE                   1
#define FM_USB_HERR_AVAILABLE                     1
#define FM0P_USB_HFCOMP_AVAILABLE                 1
#define FM_USB_HFCOMP_AVAILABLE                   1
#define FM0P_USB_HFRAME_AVAILABLE                 1
#define FM_USB_HFRAME_AVAILABLE                   1
#define FM0P_USB_HIRQ_AVAILABLE                   1
#define FM_USB_HIRQ_AVAILABLE                     1
#define FM0P_USB_HRTIMER_AVAILABLE                1
#define FM_USB_HRTIMER_AVAILABLE                  1
#define FM0P_USB_HRTIMER2_AVAILABLE               1
#define FM_USB_HRTIMER2_AVAILABLE                 1
#define FM0P_USB_HSTATE_AVAILABLE                 1
#define FM_USB_HSTATE_AVAILABLE                   1
#define FM0P_USB_HTOKEN_AVAILABLE                 1
#define FM_USB_HTOKEN_AVAILABLE                   1
#define FM0P_USB_TMSP_AVAILABLE                   1
#define FM_USB_TMSP_AVAILABLE                     1
#define FM0P_USB_UDCC_AVAILABLE                   1
#define FM_USB_UDCC_AVAILABLE                     1
#define FM0P_USB_UDCIE_AVAILABLE                  1
#define FM_USB_UDCIE_AVAILABLE                    1
#define FM0P_USB_UDCS_AVAILABLE                   1
#define FM_USB_UDCS_AVAILABLE                     1
/*******************************************************************************
* USBCLK
*******************************************************************************/
#define FM0P_USBCLK_UCCR_AVAILABLE                1
#define FM_USBCLK_UCCR_AVAILABLE                  1
#define FM0P_USBCLK_UP_STR_AVAILABLE              1
#define FM_USBCLK_UP_STR_AVAILABLE                1
#define FM0P_USBCLK_UPCR1_AVAILABLE               1
#define FM_USBCLK_UPCR1_AVAILABLE                 1
#define FM0P_USBCLK_UPCR2_AVAILABLE               1
#define FM_USBCLK_UPCR2_AVAILABLE                 1
#define FM0P_USBCLK_UPCR3_AVAILABLE               1
#define FM_USBCLK_UPCR3_AVAILABLE                 1
#define FM0P_USBCLK_UPCR4_AVAILABLE               1
#define FM_USBCLK_UPCR4_AVAILABLE                 1
#define FM0P_USBCLK_UPCR5_AVAILABLE               1
#define FM_USBCLK_UPCR5_AVAILABLE                 1
#define FM0P_USBCLK_UPINT_CLR_AVAILABLE           1
#define FM_USBCLK_UPINT_CLR_AVAILABLE             1
#define FM0P_USBCLK_UPINT_ENR_AVAILABLE           1
#define FM_USBCLK_UPINT_ENR_AVAILABLE             1
#define FM0P_USBCLK_UPINT_STR_AVAILABLE           1
#define FM_USBCLK_UPINT_STR_AVAILABLE             1
#define FM0P_USBCLK_USBEN0_AVAILABLE              1
#define FM_USBCLK_USBEN0_AVAILABLE                1
#define FM0P_USBCLK_USBEN1_AVAILABLE              1
#define FM_USBCLK_USBEN1_AVAILABLE                1
/*******************************************************************************
* VIR
*******************************************************************************/
#define FM0P_VIR_VIR00_AVAILABLE                  1
#define FM_VIR_VIR00_AVAILABLE                    1
#define FM0P_VIR_VIR01_AVAILABLE                  1
#define FM_VIR_VIR01_AVAILABLE                    1
#define FM0P_VIR_VIR02_AVAILABLE                  1
#define FM_VIR_VIR02_AVAILABLE                    1
#define FM0P_VIR_VIR03_AVAILABLE                  1
#define FM_VIR_VIR03_AVAILABLE                    1
#define FM0P_VIR_VIR04_AVAILABLE                  1
#define FM_VIR_VIR04_AVAILABLE                    1
#define FM0P_VIR_VIR05_AVAILABLE                  1
#define FM_VIR_VIR05_AVAILABLE                    1
#define FM0P_VIR_VIR06_AVAILABLE                  1
#define FM_VIR_VIR06_AVAILABLE                    1
#define FM0P_VIR_VIR07_AVAILABLE                  1
#define FM_VIR_VIR07_AVAILABLE                    1
#define FM0P_VIR_VIR08_AVAILABLE                  1
#define FM_VIR_VIR08_AVAILABLE                    1
#define FM0P_VIR_VIR09_AVAILABLE                  1
#define FM_VIR_VIR09_AVAILABLE                    1
#define FM0P_VIR_VIR10_AVAILABLE                  1
#define FM_VIR_VIR10_AVAILABLE                    1
#define FM0P_VIR_VIR11_AVAILABLE                  1
#define FM_VIR_VIR11_AVAILABLE                    1
#define FM0P_VIR_VIR12_AVAILABLE                  1
#define FM_VIR_VIR12_AVAILABLE                    1
#define FM0P_VIR_VIR13_AVAILABLE                  1
#define FM_VIR_VIR13_AVAILABLE                    1
#define FM0P_VIR_VIR14_AVAILABLE                  1
#define FM_VIR_VIR14_AVAILABLE                    1
#define FM0P_VIR_VIR15_AVAILABLE                  1
#define FM_VIR_VIR15_AVAILABLE                    1
#define FM0P_VIR_VIR16_AVAILABLE                  1
#define FM_VIR_VIR16_AVAILABLE                    1
#define FM0P_VIR_VIR17_AVAILABLE                  1
#define FM_VIR_VIR17_AVAILABLE                    1
#define FM0P_VIR_VIR18_AVAILABLE                  1
#define FM_VIR_VIR18_AVAILABLE                    1
#define FM0P_VIR_VIR19_AVAILABLE                  1
#define FM_VIR_VIR19_AVAILABLE                    1
#define FM0P_VIR_VIR20_AVAILABLE                  1
#define FM_VIR_VIR20_AVAILABLE                    1
#define FM0P_VIR_VIR21_AVAILABLE                  1
#define FM_VIR_VIR21_AVAILABLE                    1
#define FM0P_VIR_VIR22_AVAILABLE                  1
#define FM_VIR_VIR22_AVAILABLE                    1
#define FM0P_VIR_VIR23_AVAILABLE                  1
#define FM_VIR_VIR23_AVAILABLE                    1
#define FM0P_VIR_VIR24_AVAILABLE                  1
#define FM_VIR_VIR24_AVAILABLE                    1
#define FM0P_VIR_VIR25_AVAILABLE                  1
#define FM_VIR_VIR25_AVAILABLE                    1
#define FM0P_VIR_VIR26_AVAILABLE                  1
#define FM_VIR_VIR26_AVAILABLE                    1
#define FM0P_VIR_VIR27_AVAILABLE                  1
#define FM_VIR_VIR27_AVAILABLE                    1
#define FM0P_VIR_VIR28_AVAILABLE                  1
#define FM_VIR_VIR28_AVAILABLE                    1
#define FM0P_VIR_VIR29_AVAILABLE                  1
#define FM_VIR_VIR29_AVAILABLE                    1
#define FM0P_VIR_VIR30_AVAILABLE                  1
#define FM_VIR_VIR30_AVAILABLE                    1
#define FM0P_VIR_VIR31_AVAILABLE                  1
#define FM_VIR_VIR31_AVAILABLE                    1
/*******************************************************************************
* WC
*******************************************************************************/
#define FM0P_WC_CLK_EN_AVAILABLE                  1
#define FM_WC_CLK_EN_AVAILABLE                    1
#define FM0P_WC_CLK_SEL_AVAILABLE                 1
#define FM_WC_CLK_SEL_AVAILABLE                   1
#define FM0P_WC_WCCR_AVAILABLE                    1
#define FM_WC_WCCR_AVAILABLE                      1
#define FM0P_WC_WCRD_AVAILABLE                    1
#define FM_WC_WCRD_AVAILABLE                      1
#define FM0P_WC_WCRL_AVAILABLE                    1
#define FM_WC_WCRL_AVAILABLE                      1

