mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xg/common/s6e1b8xg.h
#define bFM_EXTI_NMICL_NCL                        *((volatile  uint8_t *)(0x42600300UL))
#define bFM0P_EXTI_NMICL_NCL                      *((volatile  uint8_t *)(0x42600300UL))

#define bFM_EXTI_NMIRR_NR                         *((volatile  uint8_t *)(0x42600280UL))
#define bFM0P_EXTI_NMIRR_NR                       *((volatile  uint8_t *)(0x42600280UL))


/*******************************************************************************
* FASTIO Registers FASTIO
*   Bitband Section
*******************************************************************************/
#define bFM_FASTIO_FPDIR0_P0                      *((volatile  uint8_t *)(0xF8010004UL))
#define bFM0P_FASTIO_FPDIR0_P0                    *((volatile  uint8_t *)(0xF8010004UL))
#define bFM_FASTIO_FPDIR0_P1                      *((volatile  uint8_t *)(0xF8010008UL))
#define bFM0P_FASTIO_FPDIR0_P1                    *((volatile  uint8_t *)(0xF8010008UL))
#define bFM_FASTIO_FPDIR0_P2                      *((volatile  uint8_t *)(0xF8010010UL))
#define bFM0P_FASTIO_FPDIR0_P2                    *((volatile  uint8_t *)(0xF8010010UL))
#define bFM_FASTIO_FPDIR0_P3                      *((volatile  uint8_t *)(0xF8010020UL))
#define bFM0P_FASTIO_FPDIR0_P3                    *((volatile  uint8_t *)(0xF8010020UL))
#define bFM_FASTIO_FPDIR0_P4                      *((volatile  uint8_t *)(0xF8010040UL))
#define bFM0P_FASTIO_FPDIR0_P4                    *((volatile  uint8_t *)(0xF8010040UL))
#define bFM_FASTIO_FPDIR0_P5                      *((volatile  uint8_t *)(0xF8010080UL))
#define bFM0P_FASTIO_FPDIR0_P5                    *((volatile  uint8_t *)(0xF8010080UL))
#define bFM_FASTIO_FPDIR0_P6                      *((volatile  uint8_t *)(0xF8010100UL))
#define bFM0P_FASTIO_FPDIR0_P6                    *((volatile  uint8_t *)(0xF8010100UL))
#define bFM_FASTIO_FPDIR0_P7                      *((volatile  uint8_t *)(0xF8010200UL))
#define bFM0P_FASTIO_FPDIR0_P7                    *((volatile  uint8_t *)(0xF8010200UL))
#define bFM_FASTIO_FPDIR0_P8                      *((volatile  uint8_t *)(0xF8010005UL))
#define bFM0P_FASTIO_FPDIR0_P8                    *((volatile  uint8_t *)(0xF8010005UL))
#define bFM_FASTIO_FPDIR0_P9                      *((volatile  uint8_t *)(0xF8010009UL))
#define bFM0P_FASTIO_FPDIR0_P9                    *((volatile  uint8_t *)(0xF8010009UL))
#define bFM_FASTIO_FPDIR0_PA                      *((volatile  uint8_t *)(0xF8010011UL))
#define bFM0P_FASTIO_FPDIR0_PA                    *((volatile  uint8_t *)(0xF8010011UL))
#define bFM_FASTIO_FPDIR0_PB                      *((volatile  uint8_t *)(0xF8010021UL))
#define bFM0P_FASTIO_FPDIR0_PB                    *((volatile  uint8_t *)(0xF8010021UL))
#define bFM_FASTIO_FPDIR0_PC                      *((volatile  uint8_t *)(0xF8010041UL))
#define bFM0P_FASTIO_FPDIR0_PC                    *((volatile  uint8_t *)(0xF8010041UL))
#define bFM_FASTIO_FPDIR0_PD                      *((volatile  uint8_t *)(0xF8010081UL))
#define bFM0P_FASTIO_FPDIR0_PD                    *((volatile  uint8_t *)(0xF8010081UL))
#define bFM_FASTIO_FPDIR0_PE                      *((volatile  uint8_t *)(0xF8010101UL))
#define bFM0P_FASTIO_FPDIR0_PE                    *((volatile  uint8_t *)(0xF8010101UL))
#define bFM_FASTIO_FPDIR0_PF                      *((volatile  uint8_t *)(0xF8010201UL))
#define bFM0P_FASTIO_FPDIR0_PF                    *((volatile  uint8_t *)(0xF8010201UL))

#define bFM_FASTIO_FPDIR1_P0                      *((volatile  uint8_t *)(0xF8010404UL))
#define bFM0P_FASTIO_FPDIR1_P0                    *((volatile  uint8_t *)(0xF8010404UL))
#define bFM_FASTIO_FPDIR1_P1                      *((volatile  uint8_t *)(0xF8010408UL))
#define bFM0P_FASTIO_FPDIR1_P1                    *((volatile  uint8_t *)(0xF8010408UL))
#define bFM_FASTIO_FPDIR1_P2                      *((volatile  uint8_t *)(0xF8010410UL))
#define bFM0P_FASTIO_FPDIR1_P2                    *((volatile  uint8_t *)(0xF8010410UL))
#define bFM_FASTIO_FPDIR1_P3                      *((volatile  uint8_t *)(0xF8010420UL))
#define bFM0P_FASTIO_FPDIR1_P3                    *((volatile  uint8_t *)(0xF8010420UL))
#define bFM_FASTIO_FPDIR1_P4                      *((volatile  uint8_t *)(0xF8010440UL))
#define bFM0P_FASTIO_FPDIR1_P4                    *((volatile  uint8_t *)(0xF8010440UL))
#define bFM_FASTIO_FPDIR1_P5                      *((volatile  uint8_t *)(0xF8010480UL))
#define bFM0P_FASTIO_FPDIR1_P5                    *((volatile  uint8_t *)(0xF8010480UL))
#define bFM_FASTIO_FPDIR1_P6                      *((volatile  uint8_t *)(0xF8010500UL))
#define bFM0P_FASTIO_FPDIR1_P6                    *((volatile  uint8_t *)(0xF8010500UL))
#define bFM_FASTIO_FPDIR1_P7                      *((volatile  uint8_t *)(0xF8010600UL))
#define bFM0P_FASTIO_FPDIR1_P7                    *((volatile  uint8_t *)(0xF8010600UL))
#define bFM_FASTIO_FPDIR1_P8                      *((volatile  uint8_t *)(0xF8010405UL))
#define bFM0P_FASTIO_FPDIR1_P8                    *((volatile  uint8_t *)(0xF8010405UL))
#define bFM_FASTIO_FPDIR1_P9                      *((volatile  uint8_t *)(0xF8010409UL))
#define bFM0P_FASTIO_FPDIR1_P9                    *((volatile  uint8_t *)(0xF8010409UL))
#define bFM_FASTIO_FPDIR1_PA                      *((volatile  uint8_t *)(0xF8010411UL))
#define bFM0P_FASTIO_FPDIR1_PA                    *((volatile  uint8_t *)(0xF8010411UL))
#define bFM_FASTIO_FPDIR1_PB                      *((volatile  uint8_t *)(0xF8010421UL))
#define bFM0P_FASTIO_FPDIR1_PB                    *((volatile  uint8_t *)(0xF8010421UL))
#define bFM_FASTIO_FPDIR1_PC                      *((volatile  uint8_t *)(0xF8010441UL))
#define bFM0P_FASTIO_FPDIR1_PC                    *((volatile  uint8_t *)(0xF8010441UL))
#define bFM_FASTIO_FPDIR1_PD                      *((volatile  uint8_t *)(0xF8010481UL))
#define bFM0P_FASTIO_FPDIR1_PD                    *((volatile  uint8_t *)(0xF8010481UL))
#define bFM_FASTIO_FPDIR1_PE                      *((volatile  uint8_t *)(0xF8010501UL))
#define bFM0P_FASTIO_FPDIR1_PE                    *((volatile  uint8_t *)(0xF8010501UL))

#define bFM_FASTIO_FPDIR2_P0                      *((volatile  uint8_t *)(0xF8010804UL))
#define bFM0P_FASTIO_FPDIR2_P0                    *((volatile  uint8_t *)(0xF8010804UL))
#define bFM_FASTIO_FPDIR2_P1                      *((volatile  uint8_t *)(0xF8010808UL))
#define bFM0P_FASTIO_FPDIR2_P1                    *((volatile  uint8_t *)(0xF8010808UL))
#define bFM_FASTIO_FPDIR2_P2                      *((volatile  uint8_t *)(0xF8010810UL))
#define bFM0P_FASTIO_FPDIR2_P2                    *((volatile  uint8_t *)(0xF8010810UL))
#define bFM_FASTIO_FPDIR2_P3                      *((volatile  uint8_t *)(0xF8010820UL))
#define bFM0P_FASTIO_FPDIR2_P3                    *((volatile  uint8_t *)(0xF8010820UL))
#define bFM_FASTIO_FPDIR2_P4                      *((volatile  uint8_t *)(0xF8010840UL))
#define bFM0P_FASTIO_FPDIR2_P4                    *((volatile  uint8_t *)(0xF8010840UL))
#define bFM_FASTIO_FPDIR2_P5                      *((volatile  uint8_t *)(0xF8010880UL))
#define bFM0P_FASTIO_FPDIR2_P5                    *((volatile  uint8_t *)(0xF8010880UL))
#define bFM_FASTIO_FPDIR2_P6                      *((volatile  uint8_t *)(0xF8010900UL))
#define bFM0P_FASTIO_FPDIR2_P6                    *((volatile  uint8_t *)(0xF8010900UL))
#define bFM_FASTIO_FPDIR2_P7                      *((volatile  uint8_t *)(0xF8010A00UL))
#define bFM0P_FASTIO_FPDIR2_P7                    *((volatile  uint8_t *)(0xF8010A00UL))
#define bFM_FASTIO_FPDIR2_P8                      *((volatile  uint8_t *)(0xF8010805UL))
#define bFM0P_FASTIO_FPDIR2_P8                    *((volatile  uint8_t *)(0xF8010805UL))

#define bFM_FASTIO_FPDIR3_P0                      *((volatile  uint8_t *)(0xF8010C04UL))
#define bFM0P_FASTIO_FPDIR3_P0                    *((volatile  uint8_t *)(0xF8010C04UL))
#define bFM_FASTIO_FPDIR3_P1                      *((volatile  uint8_t *)(0xF8010C08UL))
#define bFM0P_FASTIO_FPDIR3_P1                    *((volatile  uint8_t *)(0xF8010C08UL))
#define bFM_FASTIO_FPDIR3_P2                      *((volatile  uint8_t *)(0xF8010C10UL))
#define bFM0P_FASTIO_FPDIR3_P2                    *((volatile  uint8_t *)(0xF8010C10UL))
#define bFM_FASTIO_FPDIR3_P3                      *((volatile  uint8_t *)(0xF8010C20UL))
#define bFM0P_FASTIO_FPDIR3_P3                    *((volatile  uint8_t *)(0xF8010C20UL))
#define bFM_FASTIO_FPDIR3_P4                      *((volatile  uint8_t *)(0xF8010C40UL))
#define bFM0P_FASTIO_FPDIR3_P4                    *((volatile  uint8_t *)(0xF8010C40UL))
#define bFM_FASTIO_FPDIR3_P5                      *((volatile  uint8_t *)(0xF8010C80UL))
#define bFM0P_FASTIO_FPDIR3_P5                    *((volatile  uint8_t *)(0xF8010C80UL))
#define bFM_FASTIO_FPDIR3_P6                      *((volatile  uint8_t *)(0xF8010D00UL))
#define bFM0P_FASTIO_FPDIR3_P6                    *((volatile  uint8_t *)(0xF8010D00UL))
#define bFM_FASTIO_FPDIR3_P7                      *((volatile  uint8_t *)(0xF8010E00UL))
#define bFM0P_FASTIO_FPDIR3_P7                    *((volatile  uint8_t *)(0xF8010E00UL))
#define bFM_FASTIO_FPDIR3_P8                      *((volatile  uint8_t *)(0xF8010C05UL))
#define bFM0P_FASTIO_FPDIR3_P8                    *((volatile  uint8_t *)(0xF8010C05UL))
#define bFM_FASTIO_FPDIR3_P9                      *((volatile  uint8_t *)(0xF8010C09UL))
#define bFM0P_FASTIO_FPDIR3_P9                    *((volatile  uint8_t *)(0xF8010C09UL))
#define bFM_FASTIO_FPDIR3_PA                      *((volatile  uint8_t *)(0xF8010C11UL))
#define bFM0P_FASTIO_FPDIR3_PA                    *((volatile  uint8_t *)(0xF8010C11UL))
#define bFM_FASTIO_FPDIR3_PB                      *((volatile  uint8_t *)(0xF8010C21UL))
#define bFM0P_FASTIO_FPDIR3_PB                    *((volatile  uint8_t *)(0xF8010C21UL))
#define bFM_FASTIO_FPDIR3_PC                      *((volatile  uint8_t *)(0xF8010C41UL))
#define bFM0P_FASTIO_FPDIR3_PC                    *((volatile  uint8_t *)(0xF8010C41UL))
#define bFM_FASTIO_FPDIR3_PD                      *((volatile  uint8_t *)(0xF8010C81UL))
#define bFM0P_FASTIO_FPDIR3_PD                    *((volatile  uint8_t *)(0xF8010C81UL))
#define bFM_FASTIO_FPDIR3_PE                      *((volatile  uint8_t *)(0xF8010D01UL))
#define bFM0P_FASTIO_FPDIR3_PE                    *((volatile  uint8_t *)(0xF8010D01UL))
#define bFM_FASTIO_FPDIR3_PF                      *((volatile  uint8_t *)(0xF8010E01UL))
#define bFM0P_FASTIO_FPDIR3_PF                    *((volatile  uint8_t *)(0xF8010E01UL))

#define bFM_FASTIO_FPDIR4_P0                      *((volatile  uint8_t *)(0xF8011004UL))
#define bFM0P_FASTIO_FPDIR4_P0                    *((volatile  uint8_t *)(0xF8011004UL))
#define bFM_FASTIO_FPDIR4_P1                      *((volatile  uint8_t *)(0xF8011008UL))
#define bFM0P_FASTIO_FPDIR4_P1                    *((volatile  uint8_t *)(0xF8011008UL))
#define bFM_FASTIO_FPDIR4_P2                      *((volatile  uint8_t *)(0xF8011010UL))
#define bFM0P_FASTIO_FPDIR4_P2                    *((volatile  uint8_t *)(0xF8011010UL))
#define bFM_FASTIO_FPDIR4_P3                      *((volatile  uint8_t *)(0xF8011020UL))
#define bFM0P_FASTIO_FPDIR4_P3                    *((volatile  uint8_t *)(0xF8011020UL))
#define bFM_FASTIO_FPDIR4_P4                      *((volatile  uint8_t *)(0xF8011040UL))
#define bFM0P_FASTIO_FPDIR4_P4                    *((volatile  uint8_t *)(0xF8011040UL))
#define bFM_FASTIO_FPDIR4_P5                      *((volatile  uint8_t *)(0xF8011080UL))
#define bFM0P_FASTIO_FPDIR4_P5                    *((volatile  uint8_t *)(0xF8011080UL))
#define bFM_FASTIO_FPDIR4_P6                      *((volatile  uint8_t *)(0xF8011100UL))
#define bFM0P_FASTIO_FPDIR4_P6                    *((volatile  uint8_t *)(0xF8011100UL))
#define bFM_FASTIO_FPDIR4_P7                      *((volatile  uint8_t *)(0xF8011200UL))
#define bFM0P_FASTIO_FPDIR4_P7                    *((volatile  uint8_t *)(0xF8011200UL))
#define bFM_FASTIO_FPDIR4_P8                      *((volatile  uint8_t *)(0xF8011005UL))
#define bFM0P_FASTIO_FPDIR4_P8                    *((volatile  uint8_t *)(0xF8011005UL))
#define bFM_FASTIO_FPDIR4_P9                      *((volatile  uint8_t *)(0xF8011009UL))
#define bFM0P_FASTIO_FPDIR4_P9                    *((volatile  uint8_t *)(0xF8011009UL))
#define bFM_FASTIO_FPDIR4_PA                      *((volatile  uint8_t *)(0xF8011011UL))
#define bFM0P_FASTIO_FPDIR4_PA                    *((volatile  uint8_t *)(0xF8011011UL))
#define bFM_FASTIO_FPDIR4_PB                      *((volatile  uint8_t *)(0xF8011021UL))
#define bFM0P_FASTIO_FPDIR4_PB                    *((volatile  uint8_t *)(0xF8011021UL))
#define bFM_FASTIO_FPDIR4_PC                      *((volatile  uint8_t *)(0xF8011041UL))
#define bFM0P_FASTIO_FPDIR4_PC                    *((volatile  uint8_t *)(0xF8011041UL))
#define bFM_FASTIO_FPDIR4_PD                      *((volatile  uint8_t *)(0xF8011081UL))
#define bFM0P_FASTIO_FPDIR4_PD                    *((volatile  uint8_t *)(0xF8011081UL))

#define bFM_FASTIO_FPDIR5_P0                      *((volatile  uint8_t *)(0xF8011404UL))
#define bFM0P_FASTIO_FPDIR5_P0                    *((volatile  uint8_t *)(0xF8011404UL))
#define bFM_FASTIO_FPDIR5_P1                      *((volatile  uint8_t *)(0xF8011408UL))
#define bFM0P_FASTIO_FPDIR5_P1                    *((volatile  uint8_t *)(0xF8011408UL))
#define bFM_FASTIO_FPDIR5_P2                      *((volatile  uint8_t *)(0xF8011410UL))
#define bFM0P_FASTIO_FPDIR5_P2                    *((volatile  uint8_t *)(0xF8011410UL))
#define bFM_FASTIO_FPDIR5_P3                      *((volatile  uint8_t *)(0xF8011420UL))
#define bFM0P_FASTIO_FPDIR5_P3                    *((volatile  uint8_t *)(0xF8011420UL))
#define bFM_FASTIO_FPDIR5_P4                      *((volatile  uint8_t *)(0xF8011440UL))
#define bFM0P_FASTIO_FPDIR5_P4                    *((volatile  uint8_t *)(0xF8011440UL))
#define bFM_FASTIO_FPDIR5_P5                      *((volatile  uint8_t *)(0xF8011480UL))
#define bFM0P_FASTIO_FPDIR5_P5                    *((volatile  uint8_t *)(0xF8011480UL))
#define bFM_FASTIO_FPDIR5_P6                      *((volatile  uint8_t *)(0xF8011500UL))
#define bFM0P_FASTIO_FPDIR5_P6                    *((volatile  uint8_t *)(0xF8011500UL))
#define bFM_FASTIO_FPDIR5_P7                      *((volatile  uint8_t *)(0xF8011600UL))
#define bFM0P_FASTIO_FPDIR5_P7                    *((volatile  uint8_t *)(0xF8011600UL))
#define bFM_FASTIO_FPDIR5_P8                      *((volatile  uint8_t *)(0xF8011405UL))
#define bFM0P_FASTIO_FPDIR5_P8                    *((volatile  uint8_t *)(0xF8011405UL))
#define bFM_FASTIO_FPDIR5_P9                      *((volatile  uint8_t *)(0xF8011409UL))
#define bFM0P_FASTIO_FPDIR5_P9                    *((volatile  uint8_t *)(0xF8011409UL))
#define bFM_FASTIO_FPDIR5_PA                      *((volatile  uint8_t *)(0xF8011411UL))
#define bFM0P_FASTIO_FPDIR5_PA                    *((volatile  uint8_t *)(0xF8011411UL))
#define bFM_FASTIO_FPDIR5_PB                      *((volatile  uint8_t *)(0xF8011421UL))
#define bFM0P_FASTIO_FPDIR5_PB                    *((volatile  uint8_t *)(0xF8011421UL))

#define bFM_FASTIO_FPDIR6_P0                      *((volatile  uint8_t *)(0xF8011804UL))
#define bFM0P_FASTIO_FPDIR6_P0                    *((volatile  uint8_t *)(0xF8011804UL))
#define bFM_FASTIO_FPDIR6_P1                      *((volatile  uint8_t *)(0xF8011808UL))
#define bFM0P_FASTIO_FPDIR6_P1                    *((volatile  uint8_t *)(0xF8011808UL))
#define bFM_FASTIO_FPDIR6_P2                      *((volatile  uint8_t *)(0xF8011810UL))
#define bFM0P_FASTIO_FPDIR6_P2                    *((volatile  uint8_t *)(0xF8011810UL))
#define bFM_FASTIO_FPDIR6_P3                      *((volatile  uint8_t *)(0xF8011820UL))
#define bFM0P_FASTIO_FPDIR6_P3                    *((volatile  uint8_t *)(0xF8011820UL))
#define bFM_FASTIO_FPDIR6_P4                      *((volatile  uint8_t *)(0xF8011840UL))
#define bFM0P_FASTIO_FPDIR6_P4                    *((volatile  uint8_t *)(0xF8011840UL))
#define bFM_FASTIO_FPDIR6_P5                      *((volatile  uint8_t *)(0xF8011880UL))
#define bFM0P_FASTIO_FPDIR6_P5                    *((volatile  uint8_t *)(0xF8011880UL))
#define bFM_FASTIO_FPDIR6_P6                      *((volatile  uint8_t *)(0xF8011900UL))
#define bFM0P_FASTIO_FPDIR6_P6                    *((volatile  uint8_t *)(0xF8011900UL))
#define bFM_FASTIO_FPDIR6_P7                      *((volatile  uint8_t *)(0xF8011A00UL))
#define bFM0P_FASTIO_FPDIR6_P7                    *((volatile  uint8_t *)(0xF8011A00UL))
#define bFM_FASTIO_FPDIR6_P8                      *((volatile  uint8_t *)(0xF8011805UL))
#define bFM0P_FASTIO_FPDIR6_P8                    *((volatile  uint8_t *)(0xF8011805UL))

#define bFM_FASTIO_FPDIR7_P0                      *((volatile  uint8_t *)(0xF8011C04UL))
#define bFM0P_FASTIO_FPDIR7_P0                    *((volatile  uint8_t *)(0xF8011C04UL))
#define bFM_FASTIO_FPDIR7_P1                      *((volatile  uint8_t *)(0xF8011C08UL))
#define bFM0P_FASTIO_FPDIR7_P1                    *((volatile  uint8_t *)(0xF8011C08UL))
#define bFM_FASTIO_FPDIR7_P2                      *((volatile  uint8_t *)(0xF8011C10UL))
#define bFM0P_FASTIO_FPDIR7_P2                    *((volatile  uint8_t *)(0xF8011C10UL))
#define bFM_FASTIO_FPDIR7_P3                      *((volatile  uint8_t *)(0xF8011C20UL))
#define bFM0P_FASTIO_FPDIR7_P3                    *((volatile  uint8_t *)(0xF8011C20UL))
#define bFM_FASTIO_FPDIR7_P4                      *((volatile  uint8_t *)(0xF8011C40UL))
#define bFM0P_FASTIO_FPDIR7_P4                    *((volatile  uint8_t *)(0xF8011C40UL))

#define bFM_FASTIO_FPDIR8_P0                      *((volatile  uint8_t *)(0xF8012004UL))
#define bFM0P_FASTIO_FPDIR8_P0                    *((volatile  uint8_t *)(0xF8012004UL))
#define bFM_FASTIO_FPDIR8_P1                      *((volatile  uint8_t *)(0xF8012008UL))
#define bFM0P_FASTIO_FPDIR8_P1                    *((volatile  uint8_t *)(0xF8012008UL))
#define bFM_FASTIO_FPDIR8_P2                      *((volatile  uint8_t *)(0xF8012010UL))
#define bFM0P_FASTIO_FPDIR8_P2                    *((volatile  uint8_t *)(0xF8012010UL))

#define bFM_FASTIO_FPDIRE_P0                      *((volatile  uint8_t *)(0xF8013804UL))
#define bFM0P_FASTIO_FPDIRE_P0                    *((volatile  uint8_t *)(0xF8013804UL))
#define bFM_FASTIO_FPDIRE_P2                      *((volatile  uint8_t *)(0xF8013810UL))
#define bFM0P_FASTIO_FPDIRE_P2                    *((volatile  uint8_t *)(0xF8013810UL))
#define bFM_FASTIO_FPDIRE_P3                      *((volatile  uint8_t *)(0xF8013820UL))
#define bFM0P_FASTIO_FPDIRE_P3                    *((volatile  uint8_t *)(0xF8013820UL))

#define bFM_FASTIO_FPDOR0_P0                      *((volatile  uint8_t *)(0xF8014004UL))
#define bFM0P_FASTIO_FPDOR0_P0                    *((volatile  uint8_t *)(0xF8014004UL))
#define bFM_FASTIO_FPDOR0_P1                      *((volatile  uint8_t *)(0xF8014008UL))
#define bFM0P_FASTIO_FPDOR0_P1                    *((volatile  uint8_t *)(0xF8014008UL))
#define bFM_FASTIO_FPDOR0_P2                      *((volatile  uint8_t *)(0xF8014010UL))
#define bFM0P_FASTIO_FPDOR0_P2                    *((volatile  uint8_t *)(0xF8014010UL))
#define bFM_FASTIO_FPDOR0_P3                      *((volatile  uint8_t *)(0xF8014020UL))
#define bFM0P_FASTIO_FPDOR0_P3                    *((volatile  uint8_t *)(0xF8014020UL))
#define bFM_FASTIO_FPDOR0_P4                      *((volatile  uint8_t *)(0xF8014040UL))
#define bFM0P_FASTIO_FPDOR0_P4                    *((volatile  uint8_t *)(0xF8014040UL))
#define bFM_FASTIO_FPDOR0_P5                      *((volatile  uint8_t *)(0xF8014080UL))
#define bFM0P_FASTIO_FPDOR0_P5                    *((volatile  uint8_t *)(0xF8014080UL))
#define bFM_FASTIO_FPDOR0_P6                      *((volatile  uint8_t *)(0xF8014100UL))
#define bFM0P_FASTIO_FPDOR0_P6                    *((volatile  uint8_t *)(0xF8014100UL))
#define bFM_FASTIO_FPDOR0_P7                      *((volatile  uint8_t *)(0xF8014200UL))
#define bFM0P_FASTIO_FPDOR0_P7                    *((volatile  uint8_t *)(0xF8014200UL))
#define bFM_FASTIO_FPDOR0_P8                      *((volatile  uint8_t *)(0xF8014005UL))
#define bFM0P_FASTIO_FPDOR0_P8                    *((volatile  uint8_t *)(0xF8014005UL))
#define bFM_FASTIO_FPDOR0_P9                      *((volatile  uint8_t *)(0xF8014009UL))
#define bFM0P_FASTIO_FPDOR0_P9                    *((volatile  uint8_t *)(0xF8014009UL))
#define bFM_FASTIO_FPDOR0_PA                      *((volatile  uint8_t *)(0xF8014011UL))
#define bFM0P_FASTIO_FPDOR0_PA                    *((volatile  uint8_t *)(0xF8014011UL))
#define bFM_FASTIO_FPDOR0_PB                      *((volatile  uint8_t *)(0xF8014021UL))
#define bFM0P_FASTIO_FPDOR0_PB                    *((volatile  uint8_t *)(0xF8014021UL))
#define bFM_FASTIO_FPDOR0_PC                      *((volatile  uint8_t *)(0xF8014041UL))
#define bFM0P_FASTIO_FPDOR0_PC                    *((volatile  uint8_t *)(0xF8014041UL))
#define bFM_FASTIO_FPDOR0_PD                      *((volatile  uint8_t *)(0xF8014081UL))
#define bFM0P_FASTIO_FPDOR0_PD                    *((volatile  uint8_t *)(0xF8014081UL))
#define bFM_FASTIO_FPDOR0_PE                      *((volatile  uint8_t *)(0xF8014101UL))
#define bFM0P_FASTIO_FPDOR0_PE                    *((volatile  uint8_t *)(0xF8014101UL))
#define bFM_FASTIO_FPDOR0_PF                      *((volatile  uint8_t *)(0xF8014201UL))
#define bFM0P_FASTIO_FPDOR0_PF                    *((volatile  uint8_t *)(0xF8014201UL))

