mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xg/common/s6e1b8xg.h
#define bFM_FASTIO_FPDOR1_P0                      *((volatile  uint8_t *)(0xF8014404UL))
#define bFM0P_FASTIO_FPDOR1_P0                    *((volatile  uint8_t *)(0xF8014404UL))
#define bFM_FASTIO_FPDOR1_P1                      *((volatile  uint8_t *)(0xF8014408UL))
#define bFM0P_FASTIO_FPDOR1_P1                    *((volatile  uint8_t *)(0xF8014408UL))
#define bFM_FASTIO_FPDOR1_P2                      *((volatile  uint8_t *)(0xF8014410UL))
#define bFM0P_FASTIO_FPDOR1_P2                    *((volatile  uint8_t *)(0xF8014410UL))
#define bFM_FASTIO_FPDOR1_P3                      *((volatile  uint8_t *)(0xF8014420UL))
#define bFM0P_FASTIO_FPDOR1_P3                    *((volatile  uint8_t *)(0xF8014420UL))
#define bFM_FASTIO_FPDOR1_P4                      *((volatile  uint8_t *)(0xF8014440UL))
#define bFM0P_FASTIO_FPDOR1_P4                    *((volatile  uint8_t *)(0xF8014440UL))
#define bFM_FASTIO_FPDOR1_P5                      *((volatile  uint8_t *)(0xF8014480UL))
#define bFM0P_FASTIO_FPDOR1_P5                    *((volatile  uint8_t *)(0xF8014480UL))
#define bFM_FASTIO_FPDOR1_P6                      *((volatile  uint8_t *)(0xF8014500UL))
#define bFM0P_FASTIO_FPDOR1_P6                    *((volatile  uint8_t *)(0xF8014500UL))
#define bFM_FASTIO_FPDOR1_P7                      *((volatile  uint8_t *)(0xF8014600UL))
#define bFM0P_FASTIO_FPDOR1_P7                    *((volatile  uint8_t *)(0xF8014600UL))
#define bFM_FASTIO_FPDOR1_P8                      *((volatile  uint8_t *)(0xF8014405UL))
#define bFM0P_FASTIO_FPDOR1_P8                    *((volatile  uint8_t *)(0xF8014405UL))
#define bFM_FASTIO_FPDOR1_P9                      *((volatile  uint8_t *)(0xF8014409UL))
#define bFM0P_FASTIO_FPDOR1_P9                    *((volatile  uint8_t *)(0xF8014409UL))
#define bFM_FASTIO_FPDOR1_PA                      *((volatile  uint8_t *)(0xF8014411UL))
#define bFM0P_FASTIO_FPDOR1_PA                    *((volatile  uint8_t *)(0xF8014411UL))
#define bFM_FASTIO_FPDOR1_PB                      *((volatile  uint8_t *)(0xF8014421UL))
#define bFM0P_FASTIO_FPDOR1_PB                    *((volatile  uint8_t *)(0xF8014421UL))
#define bFM_FASTIO_FPDOR1_PC                      *((volatile  uint8_t *)(0xF8014441UL))
#define bFM0P_FASTIO_FPDOR1_PC                    *((volatile  uint8_t *)(0xF8014441UL))
#define bFM_FASTIO_FPDOR1_PD                      *((volatile  uint8_t *)(0xF8014481UL))
#define bFM0P_FASTIO_FPDOR1_PD                    *((volatile  uint8_t *)(0xF8014481UL))
#define bFM_FASTIO_FPDOR1_PE                      *((volatile  uint8_t *)(0xF8014501UL))
#define bFM0P_FASTIO_FPDOR1_PE                    *((volatile  uint8_t *)(0xF8014501UL))

#define bFM_FASTIO_FPDOR2_P0                      *((volatile  uint8_t *)(0xF8014804UL))
#define bFM0P_FASTIO_FPDOR2_P0                    *((volatile  uint8_t *)(0xF8014804UL))
#define bFM_FASTIO_FPDOR2_P1                      *((volatile  uint8_t *)(0xF8014808UL))
#define bFM0P_FASTIO_FPDOR2_P1                    *((volatile  uint8_t *)(0xF8014808UL))
#define bFM_FASTIO_FPDOR2_P2                      *((volatile  uint8_t *)(0xF8014810UL))
#define bFM0P_FASTIO_FPDOR2_P2                    *((volatile  uint8_t *)(0xF8014810UL))
#define bFM_FASTIO_FPDOR2_P3                      *((volatile  uint8_t *)(0xF8014820UL))
#define bFM0P_FASTIO_FPDOR2_P3                    *((volatile  uint8_t *)(0xF8014820UL))
#define bFM_FASTIO_FPDOR2_P4                      *((volatile  uint8_t *)(0xF8014840UL))
#define bFM0P_FASTIO_FPDOR2_P4                    *((volatile  uint8_t *)(0xF8014840UL))
#define bFM_FASTIO_FPDOR2_P5                      *((volatile  uint8_t *)(0xF8014880UL))
#define bFM0P_FASTIO_FPDOR2_P5                    *((volatile  uint8_t *)(0xF8014880UL))
#define bFM_FASTIO_FPDOR2_P6                      *((volatile  uint8_t *)(0xF8014900UL))
#define bFM0P_FASTIO_FPDOR2_P6                    *((volatile  uint8_t *)(0xF8014900UL))
#define bFM_FASTIO_FPDOR2_P7                      *((volatile  uint8_t *)(0xF8014A00UL))
#define bFM0P_FASTIO_FPDOR2_P7                    *((volatile  uint8_t *)(0xF8014A00UL))
#define bFM_FASTIO_FPDOR2_P8                      *((volatile  uint8_t *)(0xF8014805UL))
#define bFM0P_FASTIO_FPDOR2_P8                    *((volatile  uint8_t *)(0xF8014805UL))

#define bFM_FASTIO_FPDOR3_P0                      *((volatile  uint8_t *)(0xF8014C04UL))
#define bFM0P_FASTIO_FPDOR3_P0                    *((volatile  uint8_t *)(0xF8014C04UL))
#define bFM_FASTIO_FPDOR3_P1                      *((volatile  uint8_t *)(0xF8014C08UL))
#define bFM0P_FASTIO_FPDOR3_P1                    *((volatile  uint8_t *)(0xF8014C08UL))
#define bFM_FASTIO_FPDOR3_P2                      *((volatile  uint8_t *)(0xF8014C10UL))
#define bFM0P_FASTIO_FPDOR3_P2                    *((volatile  uint8_t *)(0xF8014C10UL))
#define bFM_FASTIO_FPDOR3_P3                      *((volatile  uint8_t *)(0xF8014C20UL))
#define bFM0P_FASTIO_FPDOR3_P3                    *((volatile  uint8_t *)(0xF8014C20UL))
#define bFM_FASTIO_FPDOR3_P4                      *((volatile  uint8_t *)(0xF8014C40UL))
#define bFM0P_FASTIO_FPDOR3_P4                    *((volatile  uint8_t *)(0xF8014C40UL))
#define bFM_FASTIO_FPDOR3_P5                      *((volatile  uint8_t *)(0xF8014C80UL))
#define bFM0P_FASTIO_FPDOR3_P5                    *((volatile  uint8_t *)(0xF8014C80UL))
#define bFM_FASTIO_FPDOR3_P6                      *((volatile  uint8_t *)(0xF8014D00UL))
#define bFM0P_FASTIO_FPDOR3_P6                    *((volatile  uint8_t *)(0xF8014D00UL))
#define bFM_FASTIO_FPDOR3_P7                      *((volatile  uint8_t *)(0xF8014E00UL))
#define bFM0P_FASTIO_FPDOR3_P7                    *((volatile  uint8_t *)(0xF8014E00UL))
#define bFM_FASTIO_FPDOR3_P8                      *((volatile  uint8_t *)(0xF8014C05UL))
#define bFM0P_FASTIO_FPDOR3_P8                    *((volatile  uint8_t *)(0xF8014C05UL))
#define bFM_FASTIO_FPDOR3_P9                      *((volatile  uint8_t *)(0xF8014C09UL))
#define bFM0P_FASTIO_FPDOR3_P9                    *((volatile  uint8_t *)(0xF8014C09UL))
#define bFM_FASTIO_FPDOR3_PA                      *((volatile  uint8_t *)(0xF8014C11UL))
#define bFM0P_FASTIO_FPDOR3_PA                    *((volatile  uint8_t *)(0xF8014C11UL))
#define bFM_FASTIO_FPDOR3_PB                      *((volatile  uint8_t *)(0xF8014C21UL))
#define bFM0P_FASTIO_FPDOR3_PB                    *((volatile  uint8_t *)(0xF8014C21UL))
#define bFM_FASTIO_FPDOR3_PC                      *((volatile  uint8_t *)(0xF8014C41UL))
#define bFM0P_FASTIO_FPDOR3_PC                    *((volatile  uint8_t *)(0xF8014C41UL))
#define bFM_FASTIO_FPDOR3_PD                      *((volatile  uint8_t *)(0xF8014C81UL))
#define bFM0P_FASTIO_FPDOR3_PD                    *((volatile  uint8_t *)(0xF8014C81UL))
#define bFM_FASTIO_FPDOR3_PE                      *((volatile  uint8_t *)(0xF8014D01UL))
#define bFM0P_FASTIO_FPDOR3_PE                    *((volatile  uint8_t *)(0xF8014D01UL))
#define bFM_FASTIO_FPDOR3_PF                      *((volatile  uint8_t *)(0xF8014E01UL))
#define bFM0P_FASTIO_FPDOR3_PF                    *((volatile  uint8_t *)(0xF8014E01UL))

#define bFM_FASTIO_FPDOR4_P0                      *((volatile  uint8_t *)(0xF8015004UL))
#define bFM0P_FASTIO_FPDOR4_P0                    *((volatile  uint8_t *)(0xF8015004UL))
#define bFM_FASTIO_FPDOR4_P1                      *((volatile  uint8_t *)(0xF8015008UL))
#define bFM0P_FASTIO_FPDOR4_P1                    *((volatile  uint8_t *)(0xF8015008UL))
#define bFM_FASTIO_FPDOR4_P2                      *((volatile  uint8_t *)(0xF8015010UL))
#define bFM0P_FASTIO_FPDOR4_P2                    *((volatile  uint8_t *)(0xF8015010UL))
#define bFM_FASTIO_FPDOR4_P3                      *((volatile  uint8_t *)(0xF8015020UL))
#define bFM0P_FASTIO_FPDOR4_P3                    *((volatile  uint8_t *)(0xF8015020UL))
#define bFM_FASTIO_FPDOR4_P4                      *((volatile  uint8_t *)(0xF8015040UL))
#define bFM0P_FASTIO_FPDOR4_P4                    *((volatile  uint8_t *)(0xF8015040UL))
#define bFM_FASTIO_FPDOR4_P5                      *((volatile  uint8_t *)(0xF8015080UL))
#define bFM0P_FASTIO_FPDOR4_P5                    *((volatile  uint8_t *)(0xF8015080UL))
#define bFM_FASTIO_FPDOR4_P6                      *((volatile  uint8_t *)(0xF8015100UL))
#define bFM0P_FASTIO_FPDOR4_P6                    *((volatile  uint8_t *)(0xF8015100UL))
#define bFM_FASTIO_FPDOR4_P7                      *((volatile  uint8_t *)(0xF8015200UL))
#define bFM0P_FASTIO_FPDOR4_P7                    *((volatile  uint8_t *)(0xF8015200UL))
#define bFM_FASTIO_FPDOR4_P8                      *((volatile  uint8_t *)(0xF8015005UL))
#define bFM0P_FASTIO_FPDOR4_P8                    *((volatile  uint8_t *)(0xF8015005UL))
#define bFM_FASTIO_FPDOR4_P9                      *((volatile  uint8_t *)(0xF8015009UL))
#define bFM0P_FASTIO_FPDOR4_P9                    *((volatile  uint8_t *)(0xF8015009UL))
#define bFM_FASTIO_FPDOR4_PA                      *((volatile  uint8_t *)(0xF8015011UL))
#define bFM0P_FASTIO_FPDOR4_PA                    *((volatile  uint8_t *)(0xF8015011UL))
#define bFM_FASTIO_FPDOR4_PB                      *((volatile  uint8_t *)(0xF8015021UL))
#define bFM0P_FASTIO_FPDOR4_PB                    *((volatile  uint8_t *)(0xF8015021UL))
#define bFM_FASTIO_FPDOR4_PC                      *((volatile  uint8_t *)(0xF8015041UL))
#define bFM0P_FASTIO_FPDOR4_PC                    *((volatile  uint8_t *)(0xF8015041UL))
#define bFM_FASTIO_FPDOR4_PD                      *((volatile  uint8_t *)(0xF8015081UL))
#define bFM0P_FASTIO_FPDOR4_PD                    *((volatile  uint8_t *)(0xF8015081UL))

