mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xg/common/s6e1b8xg.h
#define bFM_GPIO_PDIR1_P0                         *((volatile  uint8_t *)(0x42666080UL))
#define bFM0P_GPIO_PDIR1_P0                       *((volatile  uint8_t *)(0x42666080UL))
#define bFM_GPIO_PDIR1_P1                         *((volatile  uint8_t *)(0x42666084UL))
#define bFM0P_GPIO_PDIR1_P1                       *((volatile  uint8_t *)(0x42666084UL))
#define bFM_GPIO_PDIR1_P2                         *((volatile  uint8_t *)(0x42666088UL))
#define bFM0P_GPIO_PDIR1_P2                       *((volatile  uint8_t *)(0x42666088UL))
#define bFM_GPIO_PDIR1_P3                         *((volatile  uint8_t *)(0x4266608CUL))
#define bFM0P_GPIO_PDIR1_P3                       *((volatile  uint8_t *)(0x4266608CUL))
#define bFM_GPIO_PDIR1_P4                         *((volatile  uint8_t *)(0x42666090UL))
#define bFM0P_GPIO_PDIR1_P4                       *((volatile  uint8_t *)(0x42666090UL))
#define bFM_GPIO_PDIR1_P5                         *((volatile  uint8_t *)(0x42666094UL))
#define bFM0P_GPIO_PDIR1_P5                       *((volatile  uint8_t *)(0x42666094UL))
#define bFM_GPIO_PDIR1_P6                         *((volatile  uint8_t *)(0x42666098UL))
#define bFM0P_GPIO_PDIR1_P6                       *((volatile  uint8_t *)(0x42666098UL))
#define bFM_GPIO_PDIR1_P7                         *((volatile  uint8_t *)(0x4266609CUL))
#define bFM0P_GPIO_PDIR1_P7                       *((volatile  uint8_t *)(0x4266609CUL))
#define bFM_GPIO_PDIR1_P8                         *((volatile  uint8_t *)(0x426660A0UL))
#define bFM0P_GPIO_PDIR1_P8                       *((volatile  uint8_t *)(0x426660A0UL))
#define bFM_GPIO_PDIR1_P9                         *((volatile  uint8_t *)(0x426660A4UL))
#define bFM0P_GPIO_PDIR1_P9                       *((volatile  uint8_t *)(0x426660A4UL))
#define bFM_GPIO_PDIR1_PA                         *((volatile  uint8_t *)(0x426660A8UL))
#define bFM0P_GPIO_PDIR1_PA                       *((volatile  uint8_t *)(0x426660A8UL))
#define bFM_GPIO_PDIR1_PB                         *((volatile  uint8_t *)(0x426660ACUL))
#define bFM0P_GPIO_PDIR1_PB                       *((volatile  uint8_t *)(0x426660ACUL))
#define bFM_GPIO_PDIR1_PC                         *((volatile  uint8_t *)(0x426660B0UL))
#define bFM0P_GPIO_PDIR1_PC                       *((volatile  uint8_t *)(0x426660B0UL))
#define bFM_GPIO_PDIR1_PD                         *((volatile  uint8_t *)(0x426660B4UL))
#define bFM0P_GPIO_PDIR1_PD                       *((volatile  uint8_t *)(0x426660B4UL))
#define bFM_GPIO_PDIR1_PE                         *((volatile  uint8_t *)(0x426660B8UL))
#define bFM0P_GPIO_PDIR1_PE                       *((volatile  uint8_t *)(0x426660B8UL))

#define bFM_GPIO_PDIR2_P0                         *((volatile  uint8_t *)(0x42666100UL))
#define bFM0P_GPIO_PDIR2_P0                       *((volatile  uint8_t *)(0x42666100UL))
#define bFM_GPIO_PDIR2_P1                         *((volatile  uint8_t *)(0x42666104UL))
#define bFM0P_GPIO_PDIR2_P1                       *((volatile  uint8_t *)(0x42666104UL))
#define bFM_GPIO_PDIR2_P2                         *((volatile  uint8_t *)(0x42666108UL))
#define bFM0P_GPIO_PDIR2_P2                       *((volatile  uint8_t *)(0x42666108UL))
#define bFM_GPIO_PDIR2_P3                         *((volatile  uint8_t *)(0x4266610CUL))
#define bFM0P_GPIO_PDIR2_P3                       *((volatile  uint8_t *)(0x4266610CUL))
#define bFM_GPIO_PDIR2_P4                         *((volatile  uint8_t *)(0x42666110UL))
#define bFM0P_GPIO_PDIR2_P4                       *((volatile  uint8_t *)(0x42666110UL))
#define bFM_GPIO_PDIR2_P5                         *((volatile  uint8_t *)(0x42666114UL))
#define bFM0P_GPIO_PDIR2_P5                       *((volatile  uint8_t *)(0x42666114UL))
#define bFM_GPIO_PDIR2_P6                         *((volatile  uint8_t *)(0x42666118UL))
#define bFM0P_GPIO_PDIR2_P6                       *((volatile  uint8_t *)(0x42666118UL))
#define bFM_GPIO_PDIR2_P7                         *((volatile  uint8_t *)(0x4266611CUL))
#define bFM0P_GPIO_PDIR2_P7                       *((volatile  uint8_t *)(0x4266611CUL))
#define bFM_GPIO_PDIR2_P8                         *((volatile  uint8_t *)(0x42666120UL))
#define bFM0P_GPIO_PDIR2_P8                       *((volatile  uint8_t *)(0x42666120UL))

#define bFM_GPIO_PDIR3_P0                         *((volatile  uint8_t *)(0x42666180UL))
#define bFM0P_GPIO_PDIR3_P0                       *((volatile  uint8_t *)(0x42666180UL))
#define bFM_GPIO_PDIR3_P1                         *((volatile  uint8_t *)(0x42666184UL))
#define bFM0P_GPIO_PDIR3_P1                       *((volatile  uint8_t *)(0x42666184UL))
#define bFM_GPIO_PDIR3_P2                         *((volatile  uint8_t *)(0x42666188UL))
#define bFM0P_GPIO_PDIR3_P2                       *((volatile  uint8_t *)(0x42666188UL))
#define bFM_GPIO_PDIR3_P3                         *((volatile  uint8_t *)(0x4266618CUL))
#define bFM0P_GPIO_PDIR3_P3                       *((volatile  uint8_t *)(0x4266618CUL))
#define bFM_GPIO_PDIR3_P4                         *((volatile  uint8_t *)(0x42666190UL))
#define bFM0P_GPIO_PDIR3_P4                       *((volatile  uint8_t *)(0x42666190UL))
#define bFM_GPIO_PDIR3_P5                         *((volatile  uint8_t *)(0x42666194UL))
#define bFM0P_GPIO_PDIR3_P5                       *((volatile  uint8_t *)(0x42666194UL))
#define bFM_GPIO_PDIR3_P6                         *((volatile  uint8_t *)(0x42666198UL))
#define bFM0P_GPIO_PDIR3_P6                       *((volatile  uint8_t *)(0x42666198UL))
#define bFM_GPIO_PDIR3_P7                         *((volatile  uint8_t *)(0x4266619CUL))
#define bFM0P_GPIO_PDIR3_P7                       *((volatile  uint8_t *)(0x4266619CUL))
#define bFM_GPIO_PDIR3_P8                         *((volatile  uint8_t *)(0x426661A0UL))
#define bFM0P_GPIO_PDIR3_P8                       *((volatile  uint8_t *)(0x426661A0UL))
#define bFM_GPIO_PDIR3_P9                         *((volatile  uint8_t *)(0x426661A4UL))
#define bFM0P_GPIO_PDIR3_P9                       *((volatile  uint8_t *)(0x426661A4UL))
#define bFM_GPIO_PDIR3_PA                         *((volatile  uint8_t *)(0x426661A8UL))
#define bFM0P_GPIO_PDIR3_PA                       *((volatile  uint8_t *)(0x426661A8UL))
#define bFM_GPIO_PDIR3_PB                         *((volatile  uint8_t *)(0x426661ACUL))
#define bFM0P_GPIO_PDIR3_PB                       *((volatile  uint8_t *)(0x426661ACUL))
#define bFM_GPIO_PDIR3_PC                         *((volatile  uint8_t *)(0x426661B0UL))
#define bFM0P_GPIO_PDIR3_PC                       *((volatile  uint8_t *)(0x426661B0UL))
#define bFM_GPIO_PDIR3_PD                         *((volatile  uint8_t *)(0x426661B4UL))
#define bFM0P_GPIO_PDIR3_PD                       *((volatile  uint8_t *)(0x426661B4UL))
#define bFM_GPIO_PDIR3_PE                         *((volatile  uint8_t *)(0x426661B8UL))
#define bFM0P_GPIO_PDIR3_PE                       *((volatile  uint8_t *)(0x426661B8UL))
#define bFM_GPIO_PDIR3_PF                         *((volatile  uint8_t *)(0x426661BCUL))
#define bFM0P_GPIO_PDIR3_PF                       *((volatile  uint8_t *)(0x426661BCUL))

