mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xg/common/s6e1b8xg.h
#define bFM_GPIO_PDIR4_P0                         *((volatile  uint8_t *)(0x42666200UL))
#define bFM0P_GPIO_PDIR4_P0                       *((volatile  uint8_t *)(0x42666200UL))
#define bFM_GPIO_PDIR4_P1                         *((volatile  uint8_t *)(0x42666204UL))
#define bFM0P_GPIO_PDIR4_P1                       *((volatile  uint8_t *)(0x42666204UL))
#define bFM_GPIO_PDIR4_P2                         *((volatile  uint8_t *)(0x42666208UL))
#define bFM0P_GPIO_PDIR4_P2                       *((volatile  uint8_t *)(0x42666208UL))
#define bFM_GPIO_PDIR4_P3                         *((volatile  uint8_t *)(0x4266620CUL))
#define bFM0P_GPIO_PDIR4_P3                       *((volatile  uint8_t *)(0x4266620CUL))
#define bFM_GPIO_PDIR4_P4                         *((volatile  uint8_t *)(0x42666210UL))
#define bFM0P_GPIO_PDIR4_P4                       *((volatile  uint8_t *)(0x42666210UL))
#define bFM_GPIO_PDIR4_P5                         *((volatile  uint8_t *)(0x42666214UL))
#define bFM0P_GPIO_PDIR4_P5                       *((volatile  uint8_t *)(0x42666214UL))
#define bFM_GPIO_PDIR4_P6                         *((volatile  uint8_t *)(0x42666218UL))
#define bFM0P_GPIO_PDIR4_P6                       *((volatile  uint8_t *)(0x42666218UL))
#define bFM_GPIO_PDIR4_P7                         *((volatile  uint8_t *)(0x4266621CUL))
#define bFM0P_GPIO_PDIR4_P7                       *((volatile  uint8_t *)(0x4266621CUL))
#define bFM_GPIO_PDIR4_P8                         *((volatile  uint8_t *)(0x42666220UL))
#define bFM0P_GPIO_PDIR4_P8                       *((volatile  uint8_t *)(0x42666220UL))
#define bFM_GPIO_PDIR4_P9                         *((volatile  uint8_t *)(0x42666224UL))
#define bFM0P_GPIO_PDIR4_P9                       *((volatile  uint8_t *)(0x42666224UL))
#define bFM_GPIO_PDIR4_PA                         *((volatile  uint8_t *)(0x42666228UL))
#define bFM0P_GPIO_PDIR4_PA                       *((volatile  uint8_t *)(0x42666228UL))
#define bFM_GPIO_PDIR4_PB                         *((volatile  uint8_t *)(0x4266622CUL))
#define bFM0P_GPIO_PDIR4_PB                       *((volatile  uint8_t *)(0x4266622CUL))
#define bFM_GPIO_PDIR4_PC                         *((volatile  uint8_t *)(0x42666230UL))
#define bFM0P_GPIO_PDIR4_PC                       *((volatile  uint8_t *)(0x42666230UL))
#define bFM_GPIO_PDIR4_PD                         *((volatile  uint8_t *)(0x42666234UL))
#define bFM0P_GPIO_PDIR4_PD                       *((volatile  uint8_t *)(0x42666234UL))

#define bFM_GPIO_PDIR5_P0                         *((volatile  uint8_t *)(0x42666280UL))
#define bFM0P_GPIO_PDIR5_P0                       *((volatile  uint8_t *)(0x42666280UL))
#define bFM_GPIO_PDIR5_P1                         *((volatile  uint8_t *)(0x42666284UL))
#define bFM0P_GPIO_PDIR5_P1                       *((volatile  uint8_t *)(0x42666284UL))
#define bFM_GPIO_PDIR5_P2                         *((volatile  uint8_t *)(0x42666288UL))
#define bFM0P_GPIO_PDIR5_P2                       *((volatile  uint8_t *)(0x42666288UL))
#define bFM_GPIO_PDIR5_P3                         *((volatile  uint8_t *)(0x4266628CUL))
#define bFM0P_GPIO_PDIR5_P3                       *((volatile  uint8_t *)(0x4266628CUL))
#define bFM_GPIO_PDIR5_P4                         *((volatile  uint8_t *)(0x42666290UL))
#define bFM0P_GPIO_PDIR5_P4                       *((volatile  uint8_t *)(0x42666290UL))
#define bFM_GPIO_PDIR5_P5                         *((volatile  uint8_t *)(0x42666294UL))
#define bFM0P_GPIO_PDIR5_P5                       *((volatile  uint8_t *)(0x42666294UL))
#define bFM_GPIO_PDIR5_P6                         *((volatile  uint8_t *)(0x42666298UL))
#define bFM0P_GPIO_PDIR5_P6                       *((volatile  uint8_t *)(0x42666298UL))
#define bFM_GPIO_PDIR5_P7                         *((volatile  uint8_t *)(0x4266629CUL))
#define bFM0P_GPIO_PDIR5_P7                       *((volatile  uint8_t *)(0x4266629CUL))
#define bFM_GPIO_PDIR5_P8                         *((volatile  uint8_t *)(0x426662A0UL))
#define bFM0P_GPIO_PDIR5_P8                       *((volatile  uint8_t *)(0x426662A0UL))
#define bFM_GPIO_PDIR5_P9                         *((volatile  uint8_t *)(0x426662A4UL))
#define bFM0P_GPIO_PDIR5_P9                       *((volatile  uint8_t *)(0x426662A4UL))
#define bFM_GPIO_PDIR5_PA                         *((volatile  uint8_t *)(0x426662A8UL))
#define bFM0P_GPIO_PDIR5_PA                       *((volatile  uint8_t *)(0x426662A8UL))
#define bFM_GPIO_PDIR5_PB                         *((volatile  uint8_t *)(0x426662ACUL))
#define bFM0P_GPIO_PDIR5_PB                       *((volatile  uint8_t *)(0x426662ACUL))

#define bFM_GPIO_PDIR6_P0                         *((volatile  uint8_t *)(0x42666300UL))
#define bFM0P_GPIO_PDIR6_P0                       *((volatile  uint8_t *)(0x42666300UL))
#define bFM_GPIO_PDIR6_P1                         *((volatile  uint8_t *)(0x42666304UL))
#define bFM0P_GPIO_PDIR6_P1                       *((volatile  uint8_t *)(0x42666304UL))
#define bFM_GPIO_PDIR6_P2                         *((volatile  uint8_t *)(0x42666308UL))
#define bFM0P_GPIO_PDIR6_P2                       *((volatile  uint8_t *)(0x42666308UL))
#define bFM_GPIO_PDIR6_P3                         *((volatile  uint8_t *)(0x4266630CUL))
#define bFM0P_GPIO_PDIR6_P3                       *((volatile  uint8_t *)(0x4266630CUL))
#define bFM_GPIO_PDIR6_P4                         *((volatile  uint8_t *)(0x42666310UL))
#define bFM0P_GPIO_PDIR6_P4                       *((volatile  uint8_t *)(0x42666310UL))
#define bFM_GPIO_PDIR6_P5                         *((volatile  uint8_t *)(0x42666314UL))
#define bFM0P_GPIO_PDIR6_P5                       *((volatile  uint8_t *)(0x42666314UL))
#define bFM_GPIO_PDIR6_P6                         *((volatile  uint8_t *)(0x42666318UL))
#define bFM0P_GPIO_PDIR6_P6                       *((volatile  uint8_t *)(0x42666318UL))
#define bFM_GPIO_PDIR6_P7                         *((volatile  uint8_t *)(0x4266631CUL))
#define bFM0P_GPIO_PDIR6_P7                       *((volatile  uint8_t *)(0x4266631CUL))
#define bFM_GPIO_PDIR6_P8                         *((volatile  uint8_t *)(0x42666320UL))
#define bFM0P_GPIO_PDIR6_P8                       *((volatile  uint8_t *)(0x42666320UL))

