mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xg/common/s6e1b8xg.h
#define bFM_GPIO_PDIR7_P0                         *((volatile  uint8_t *)(0x42666380UL))
#define bFM0P_GPIO_PDIR7_P0                       *((volatile  uint8_t *)(0x42666380UL))
#define bFM_GPIO_PDIR7_P1                         *((volatile  uint8_t *)(0x42666384UL))
#define bFM0P_GPIO_PDIR7_P1                       *((volatile  uint8_t *)(0x42666384UL))
#define bFM_GPIO_PDIR7_P2                         *((volatile  uint8_t *)(0x42666388UL))
#define bFM0P_GPIO_PDIR7_P2                       *((volatile  uint8_t *)(0x42666388UL))
#define bFM_GPIO_PDIR7_P3                         *((volatile  uint8_t *)(0x4266638CUL))
#define bFM0P_GPIO_PDIR7_P3                       *((volatile  uint8_t *)(0x4266638CUL))
#define bFM_GPIO_PDIR7_P4                         *((volatile  uint8_t *)(0x42666390UL))
#define bFM0P_GPIO_PDIR7_P4                       *((volatile  uint8_t *)(0x42666390UL))

#define bFM_GPIO_PDIR8_P0                         *((volatile  uint8_t *)(0x42666400UL))
#define bFM0P_GPIO_PDIR8_P0                       *((volatile  uint8_t *)(0x42666400UL))
#define bFM_GPIO_PDIR8_P1                         *((volatile  uint8_t *)(0x42666404UL))
#define bFM0P_GPIO_PDIR8_P1                       *((volatile  uint8_t *)(0x42666404UL))
#define bFM_GPIO_PDIR8_P2                         *((volatile  uint8_t *)(0x42666408UL))
#define bFM0P_GPIO_PDIR8_P2                       *((volatile  uint8_t *)(0x42666408UL))

#define bFM_GPIO_PDIRE_P0                         *((volatile  uint8_t *)(0x42666700UL))
#define bFM0P_GPIO_PDIRE_P0                       *((volatile  uint8_t *)(0x42666700UL))
#define bFM_GPIO_PDIRE_P2                         *((volatile  uint8_t *)(0x42666708UL))
#define bFM0P_GPIO_PDIRE_P2                       *((volatile  uint8_t *)(0x42666708UL))
#define bFM_GPIO_PDIRE_P3                         *((volatile  uint8_t *)(0x4266670CUL))
#define bFM0P_GPIO_PDIRE_P3                       *((volatile  uint8_t *)(0x4266670CUL))

#define bFM_GPIO_PDOR0_P0                         *((volatile  uint8_t *)(0x42668000UL))
#define bFM0P_GPIO_PDOR0_P0                       *((volatile  uint8_t *)(0x42668000UL))
#define bFM_GPIO_PDOR0_P1                         *((volatile  uint8_t *)(0x42668004UL))
#define bFM0P_GPIO_PDOR0_P1                       *((volatile  uint8_t *)(0x42668004UL))
#define bFM_GPIO_PDOR0_P2                         *((volatile  uint8_t *)(0x42668008UL))
#define bFM0P_GPIO_PDOR0_P2                       *((volatile  uint8_t *)(0x42668008UL))
#define bFM_GPIO_PDOR0_P3                         *((volatile  uint8_t *)(0x4266800CUL))
#define bFM0P_GPIO_PDOR0_P3                       *((volatile  uint8_t *)(0x4266800CUL))
#define bFM_GPIO_PDOR0_P4                         *((volatile  uint8_t *)(0x42668010UL))
#define bFM0P_GPIO_PDOR0_P4                       *((volatile  uint8_t *)(0x42668010UL))
#define bFM_GPIO_PDOR0_P5                         *((volatile  uint8_t *)(0x42668014UL))
#define bFM0P_GPIO_PDOR0_P5                       *((volatile  uint8_t *)(0x42668014UL))
#define bFM_GPIO_PDOR0_P6                         *((volatile  uint8_t *)(0x42668018UL))
#define bFM0P_GPIO_PDOR0_P6                       *((volatile  uint8_t *)(0x42668018UL))
#define bFM_GPIO_PDOR0_P7                         *((volatile  uint8_t *)(0x4266801CUL))
#define bFM0P_GPIO_PDOR0_P7                       *((volatile  uint8_t *)(0x4266801CUL))
#define bFM_GPIO_PDOR0_P8                         *((volatile  uint8_t *)(0x42668020UL))
#define bFM0P_GPIO_PDOR0_P8                       *((volatile  uint8_t *)(0x42668020UL))
#define bFM_GPIO_PDOR0_P9                         *((volatile  uint8_t *)(0x42668024UL))
#define bFM0P_GPIO_PDOR0_P9                       *((volatile  uint8_t *)(0x42668024UL))
#define bFM_GPIO_PDOR0_PA                         *((volatile  uint8_t *)(0x42668028UL))
#define bFM0P_GPIO_PDOR0_PA                       *((volatile  uint8_t *)(0x42668028UL))
#define bFM_GPIO_PDOR0_PB                         *((volatile  uint8_t *)(0x4266802CUL))
#define bFM0P_GPIO_PDOR0_PB                       *((volatile  uint8_t *)(0x4266802CUL))
#define bFM_GPIO_PDOR0_PC                         *((volatile  uint8_t *)(0x42668030UL))
#define bFM0P_GPIO_PDOR0_PC                       *((volatile  uint8_t *)(0x42668030UL))
#define bFM_GPIO_PDOR0_PD                         *((volatile  uint8_t *)(0x42668034UL))
#define bFM0P_GPIO_PDOR0_PD                       *((volatile  uint8_t *)(0x42668034UL))
#define bFM_GPIO_PDOR0_PE                         *((volatile  uint8_t *)(0x42668038UL))
#define bFM0P_GPIO_PDOR0_PE                       *((volatile  uint8_t *)(0x42668038UL))
#define bFM_GPIO_PDOR0_PF                         *((volatile  uint8_t *)(0x4266803CUL))
#define bFM0P_GPIO_PDOR0_PF                       *((volatile  uint8_t *)(0x4266803CUL))

#define bFM_GPIO_PDOR1_P0                         *((volatile  uint8_t *)(0x42668080UL))
#define bFM0P_GPIO_PDOR1_P0                       *((volatile  uint8_t *)(0x42668080UL))
#define bFM_GPIO_PDOR1_P1                         *((volatile  uint8_t *)(0x42668084UL))
#define bFM0P_GPIO_PDOR1_P1                       *((volatile  uint8_t *)(0x42668084UL))
#define bFM_GPIO_PDOR1_P2                         *((volatile  uint8_t *)(0x42668088UL))
#define bFM0P_GPIO_PDOR1_P2                       *((volatile  uint8_t *)(0x42668088UL))
#define bFM_GPIO_PDOR1_P3                         *((volatile  uint8_t *)(0x4266808CUL))
#define bFM0P_GPIO_PDOR1_P3                       *((volatile  uint8_t *)(0x4266808CUL))
#define bFM_GPIO_PDOR1_P4                         *((volatile  uint8_t *)(0x42668090UL))
#define bFM0P_GPIO_PDOR1_P4                       *((volatile  uint8_t *)(0x42668090UL))
#define bFM_GPIO_PDOR1_P5                         *((volatile  uint8_t *)(0x42668094UL))
#define bFM0P_GPIO_PDOR1_P5                       *((volatile  uint8_t *)(0x42668094UL))
#define bFM_GPIO_PDOR1_P6                         *((volatile  uint8_t *)(0x42668098UL))
#define bFM0P_GPIO_PDOR1_P6                       *((volatile  uint8_t *)(0x42668098UL))
#define bFM_GPIO_PDOR1_P7                         *((volatile  uint8_t *)(0x4266809CUL))
#define bFM0P_GPIO_PDOR1_P7                       *((volatile  uint8_t *)(0x4266809CUL))
#define bFM_GPIO_PDOR1_P8                         *((volatile  uint8_t *)(0x426680A0UL))
#define bFM0P_GPIO_PDOR1_P8                       *((volatile  uint8_t *)(0x426680A0UL))
#define bFM_GPIO_PDOR1_P9                         *((volatile  uint8_t *)(0x426680A4UL))
#define bFM0P_GPIO_PDOR1_P9                       *((volatile  uint8_t *)(0x426680A4UL))
#define bFM_GPIO_PDOR1_PA                         *((volatile  uint8_t *)(0x426680A8UL))
#define bFM0P_GPIO_PDOR1_PA                       *((volatile  uint8_t *)(0x426680A8UL))
#define bFM_GPIO_PDOR1_PB                         *((volatile  uint8_t *)(0x426680ACUL))
#define bFM0P_GPIO_PDOR1_PB                       *((volatile  uint8_t *)(0x426680ACUL))
#define bFM_GPIO_PDOR1_PC                         *((volatile  uint8_t *)(0x426680B0UL))
#define bFM0P_GPIO_PDOR1_PC                       *((volatile  uint8_t *)(0x426680B0UL))
#define bFM_GPIO_PDOR1_PD                         *((volatile  uint8_t *)(0x426680B4UL))
#define bFM0P_GPIO_PDOR1_PD                       *((volatile  uint8_t *)(0x426680B4UL))
#define bFM_GPIO_PDOR1_PE                         *((volatile  uint8_t *)(0x426680B8UL))
#define bFM0P_GPIO_PDOR1_PE                       *((volatile  uint8_t *)(0x426680B8UL))

#define bFM_GPIO_PDOR2_P0                         *((volatile  uint8_t *)(0x42668100UL))
#define bFM0P_GPIO_PDOR2_P0                       *((volatile  uint8_t *)(0x42668100UL))
#define bFM_GPIO_PDOR2_P1                         *((volatile  uint8_t *)(0x42668104UL))
#define bFM0P_GPIO_PDOR2_P1                       *((volatile  uint8_t *)(0x42668104UL))
#define bFM_GPIO_PDOR2_P2                         *((volatile  uint8_t *)(0x42668108UL))
#define bFM0P_GPIO_PDOR2_P2                       *((volatile  uint8_t *)(0x42668108UL))
#define bFM_GPIO_PDOR2_P3                         *((volatile  uint8_t *)(0x4266810CUL))
#define bFM0P_GPIO_PDOR2_P3                       *((volatile  uint8_t *)(0x4266810CUL))
#define bFM_GPIO_PDOR2_P4                         *((volatile  uint8_t *)(0x42668110UL))
#define bFM0P_GPIO_PDOR2_P4                       *((volatile  uint8_t *)(0x42668110UL))
#define bFM_GPIO_PDOR2_P5                         *((volatile  uint8_t *)(0x42668114UL))
#define bFM0P_GPIO_PDOR2_P5                       *((volatile  uint8_t *)(0x42668114UL))
#define bFM_GPIO_PDOR2_P6                         *((volatile  uint8_t *)(0x42668118UL))
#define bFM0P_GPIO_PDOR2_P6                       *((volatile  uint8_t *)(0x42668118UL))
#define bFM_GPIO_PDOR2_P7                         *((volatile  uint8_t *)(0x4266811CUL))
#define bFM0P_GPIO_PDOR2_P7                       *((volatile  uint8_t *)(0x4266811CUL))
#define bFM_GPIO_PDOR2_P8                         *((volatile  uint8_t *)(0x42668120UL))
#define bFM0P_GPIO_PDOR2_P8                       *((volatile  uint8_t *)(0x42668120UL))

#define bFM_GPIO_PDOR3_P0                         *((volatile  uint8_t *)(0x42668180UL))
#define bFM0P_GPIO_PDOR3_P0                       *((volatile  uint8_t *)(0x42668180UL))
#define bFM_GPIO_PDOR3_P1                         *((volatile  uint8_t *)(0x42668184UL))
#define bFM0P_GPIO_PDOR3_P1                       *((volatile  uint8_t *)(0x42668184UL))
#define bFM_GPIO_PDOR3_P2                         *((volatile  uint8_t *)(0x42668188UL))
#define bFM0P_GPIO_PDOR3_P2                       *((volatile  uint8_t *)(0x42668188UL))
#define bFM_GPIO_PDOR3_P3                         *((volatile  uint8_t *)(0x4266818CUL))
#define bFM0P_GPIO_PDOR3_P3                       *((volatile  uint8_t *)(0x4266818CUL))
#define bFM_GPIO_PDOR3_P4                         *((volatile  uint8_t *)(0x42668190UL))
#define bFM0P_GPIO_PDOR3_P4                       *((volatile  uint8_t *)(0x42668190UL))
#define bFM_GPIO_PDOR3_P5                         *((volatile  uint8_t *)(0x42668194UL))
#define bFM0P_GPIO_PDOR3_P5                       *((volatile  uint8_t *)(0x42668194UL))
#define bFM_GPIO_PDOR3_P6                         *((volatile  uint8_t *)(0x42668198UL))
#define bFM0P_GPIO_PDOR3_P6                       *((volatile  uint8_t *)(0x42668198UL))
#define bFM_GPIO_PDOR3_P7                         *((volatile  uint8_t *)(0x4266819CUL))
#define bFM0P_GPIO_PDOR3_P7                       *((volatile  uint8_t *)(0x4266819CUL))
#define bFM_GPIO_PDOR3_P8                         *((volatile  uint8_t *)(0x426681A0UL))
#define bFM0P_GPIO_PDOR3_P8                       *((volatile  uint8_t *)(0x426681A0UL))
#define bFM_GPIO_PDOR3_P9                         *((volatile  uint8_t *)(0x426681A4UL))
#define bFM0P_GPIO_PDOR3_P9                       *((volatile  uint8_t *)(0x426681A4UL))
#define bFM_GPIO_PDOR3_PA                         *((volatile  uint8_t *)(0x426681A8UL))
#define bFM0P_GPIO_PDOR3_PA                       *((volatile  uint8_t *)(0x426681A8UL))
#define bFM_GPIO_PDOR3_PB                         *((volatile  uint8_t *)(0x426681ACUL))
#define bFM0P_GPIO_PDOR3_PB                       *((volatile  uint8_t *)(0x426681ACUL))
#define bFM_GPIO_PDOR3_PC                         *((volatile  uint8_t *)(0x426681B0UL))
#define bFM0P_GPIO_PDOR3_PC                       *((volatile  uint8_t *)(0x426681B0UL))
#define bFM_GPIO_PDOR3_PD                         *((volatile  uint8_t *)(0x426681B4UL))
#define bFM0P_GPIO_PDOR3_PD                       *((volatile  uint8_t *)(0x426681B4UL))
#define bFM_GPIO_PDOR3_PE                         *((volatile  uint8_t *)(0x426681B8UL))
#define bFM0P_GPIO_PDOR3_PE                       *((volatile  uint8_t *)(0x426681B8UL))
#define bFM_GPIO_PDOR3_PF                         *((volatile  uint8_t *)(0x426681BCUL))
#define bFM0P_GPIO_PDOR3_PF                       *((volatile  uint8_t *)(0x426681BCUL))

#define bFM_GPIO_PDOR4_P0                         *((volatile  uint8_t *)(0x42668200UL))
#define bFM0P_GPIO_PDOR4_P0                       *((volatile  uint8_t *)(0x42668200UL))
#define bFM_GPIO_PDOR4_P1                         *((volatile  uint8_t *)(0x42668204UL))
#define bFM0P_GPIO_PDOR4_P1                       *((volatile  uint8_t *)(0x42668204UL))
#define bFM_GPIO_PDOR4_P2                         *((volatile  uint8_t *)(0x42668208UL))
#define bFM0P_GPIO_PDOR4_P2                       *((volatile  uint8_t *)(0x42668208UL))
#define bFM_GPIO_PDOR4_P3                         *((volatile  uint8_t *)(0x4266820CUL))
#define bFM0P_GPIO_PDOR4_P3                       *((volatile  uint8_t *)(0x4266820CUL))
#define bFM_GPIO_PDOR4_P4                         *((volatile  uint8_t *)(0x42668210UL))
#define bFM0P_GPIO_PDOR4_P4                       *((volatile  uint8_t *)(0x42668210UL))
#define bFM_GPIO_PDOR4_P5                         *((volatile  uint8_t *)(0x42668214UL))
#define bFM0P_GPIO_PDOR4_P5                       *((volatile  uint8_t *)(0x42668214UL))
#define bFM_GPIO_PDOR4_P6                         *((volatile  uint8_t *)(0x42668218UL))
#define bFM0P_GPIO_PDOR4_P6                       *((volatile  uint8_t *)(0x42668218UL))
#define bFM_GPIO_PDOR4_P7                         *((volatile  uint8_t *)(0x4266821CUL))
#define bFM0P_GPIO_PDOR4_P7                       *((volatile  uint8_t *)(0x4266821CUL))
#define bFM_GPIO_PDOR4_P8                         *((volatile  uint8_t *)(0x42668220UL))
#define bFM0P_GPIO_PDOR4_P8                       *((volatile  uint8_t *)(0x42668220UL))
#define bFM_GPIO_PDOR4_P9                         *((volatile  uint8_t *)(0x42668224UL))
#define bFM0P_GPIO_PDOR4_P9                       *((volatile  uint8_t *)(0x42668224UL))
#define bFM_GPIO_PDOR4_PA                         *((volatile  uint8_t *)(0x42668228UL))
#define bFM0P_GPIO_PDOR4_PA                       *((volatile  uint8_t *)(0x42668228UL))
#define bFM_GPIO_PDOR4_PB                         *((volatile  uint8_t *)(0x4266822CUL))
#define bFM0P_GPIO_PDOR4_PB                       *((volatile  uint8_t *)(0x4266822CUL))
#define bFM_GPIO_PDOR4_PC                         *((volatile  uint8_t *)(0x42668230UL))
#define bFM0P_GPIO_PDOR4_PC                       *((volatile  uint8_t *)(0x42668230UL))
#define bFM_GPIO_PDOR4_PD                         *((volatile  uint8_t *)(0x42668234UL))
#define bFM0P_GPIO_PDOR4_PD                       *((volatile  uint8_t *)(0x42668234UL))

