mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xg/common/s6e1b8xg.h
#define bFM_GPIO_PFR8_P0                          *((volatile  uint8_t *)(0x42660400UL))
#define bFM0P_GPIO_PFR8_P0                        *((volatile  uint8_t *)(0x42660400UL))
#define bFM_GPIO_PFR8_P1                          *((volatile  uint8_t *)(0x42660404UL))
#define bFM0P_GPIO_PFR8_P1                        *((volatile  uint8_t *)(0x42660404UL))
#define bFM_GPIO_PFR8_P2                          *((volatile  uint8_t *)(0x42660408UL))
#define bFM0P_GPIO_PFR8_P2                        *((volatile  uint8_t *)(0x42660408UL))

#define bFM_GPIO_PFRE_P0                          *((volatile  uint8_t *)(0x42660700UL))
#define bFM0P_GPIO_PFRE_P0                        *((volatile  uint8_t *)(0x42660700UL))
#define bFM_GPIO_PFRE_P2                          *((volatile  uint8_t *)(0x42660708UL))
#define bFM0P_GPIO_PFRE_P2                        *((volatile  uint8_t *)(0x42660708UL))
#define bFM_GPIO_PFRE_P3                          *((volatile  uint8_t *)(0x4266070CUL))
#define bFM0P_GPIO_PFRE_P3                        *((volatile  uint8_t *)(0x4266070CUL))

#define bFM_GPIO_PZR0_P0                          *((volatile  uint8_t *)(0x4266E000UL))
#define bFM0P_GPIO_PZR0_P0                        *((volatile  uint8_t *)(0x4266E000UL))
#define bFM_GPIO_PZR0_P1                          *((volatile  uint8_t *)(0x4266E004UL))
#define bFM0P_GPIO_PZR0_P1                        *((volatile  uint8_t *)(0x4266E004UL))
#define bFM_GPIO_PZR0_P2                          *((volatile  uint8_t *)(0x4266E008UL))
#define bFM0P_GPIO_PZR0_P2                        *((volatile  uint8_t *)(0x4266E008UL))
#define bFM_GPIO_PZR0_P3                          *((volatile  uint8_t *)(0x4266E00CUL))
#define bFM0P_GPIO_PZR0_P3                        *((volatile  uint8_t *)(0x4266E00CUL))
#define bFM_GPIO_PZR0_P4                          *((volatile  uint8_t *)(0x4266E010UL))
#define bFM0P_GPIO_PZR0_P4                        *((volatile  uint8_t *)(0x4266E010UL))
#define bFM_GPIO_PZR0_P5                          *((volatile  uint8_t *)(0x4266E014UL))
#define bFM0P_GPIO_PZR0_P5                        *((volatile  uint8_t *)(0x4266E014UL))
#define bFM_GPIO_PZR0_P6                          *((volatile  uint8_t *)(0x4266E018UL))
#define bFM0P_GPIO_PZR0_P6                        *((volatile  uint8_t *)(0x4266E018UL))
#define bFM_GPIO_PZR0_P7                          *((volatile  uint8_t *)(0x4266E01CUL))
#define bFM0P_GPIO_PZR0_P7                        *((volatile  uint8_t *)(0x4266E01CUL))
#define bFM_GPIO_PZR0_P8                          *((volatile  uint8_t *)(0x4266E020UL))
#define bFM0P_GPIO_PZR0_P8                        *((volatile  uint8_t *)(0x4266E020UL))
#define bFM_GPIO_PZR0_P9                          *((volatile  uint8_t *)(0x4266E024UL))
#define bFM0P_GPIO_PZR0_P9                        *((volatile  uint8_t *)(0x4266E024UL))
#define bFM_GPIO_PZR0_PA                          *((volatile  uint8_t *)(0x4266E028UL))
#define bFM0P_GPIO_PZR0_PA                        *((volatile  uint8_t *)(0x4266E028UL))
#define bFM_GPIO_PZR0_PB                          *((volatile  uint8_t *)(0x4266E02CUL))
#define bFM0P_GPIO_PZR0_PB                        *((volatile  uint8_t *)(0x4266E02CUL))
#define bFM_GPIO_PZR0_PC                          *((volatile  uint8_t *)(0x4266E030UL))
#define bFM0P_GPIO_PZR0_PC                        *((volatile  uint8_t *)(0x4266E030UL))
#define bFM_GPIO_PZR0_PD                          *((volatile  uint8_t *)(0x4266E034UL))
#define bFM0P_GPIO_PZR0_PD                        *((volatile  uint8_t *)(0x4266E034UL))
#define bFM_GPIO_PZR0_PE                          *((volatile  uint8_t *)(0x4266E038UL))
#define bFM0P_GPIO_PZR0_PE                        *((volatile  uint8_t *)(0x4266E038UL))
#define bFM_GPIO_PZR0_PF                          *((volatile  uint8_t *)(0x4266E03CUL))
#define bFM0P_GPIO_PZR0_PF                        *((volatile  uint8_t *)(0x4266E03CUL))

#define bFM_GPIO_PZR1_P0                          *((volatile  uint8_t *)(0x4266E080UL))
#define bFM0P_GPIO_PZR1_P0                        *((volatile  uint8_t *)(0x4266E080UL))
#define bFM_GPIO_PZR1_P1                          *((volatile  uint8_t *)(0x4266E084UL))
#define bFM0P_GPIO_PZR1_P1                        *((volatile  uint8_t *)(0x4266E084UL))
#define bFM_GPIO_PZR1_P2                          *((volatile  uint8_t *)(0x4266E088UL))
#define bFM0P_GPIO_PZR1_P2                        *((volatile  uint8_t *)(0x4266E088UL))
#define bFM_GPIO_PZR1_P3                          *((volatile  uint8_t *)(0x4266E08CUL))
#define bFM0P_GPIO_PZR1_P3                        *((volatile  uint8_t *)(0x4266E08CUL))
#define bFM_GPIO_PZR1_P4                          *((volatile  uint8_t *)(0x4266E090UL))
#define bFM0P_GPIO_PZR1_P4                        *((volatile  uint8_t *)(0x4266E090UL))
#define bFM_GPIO_PZR1_P5                          *((volatile  uint8_t *)(0x4266E094UL))
#define bFM0P_GPIO_PZR1_P5                        *((volatile  uint8_t *)(0x4266E094UL))
#define bFM_GPIO_PZR1_P6                          *((volatile  uint8_t *)(0x4266E098UL))
#define bFM0P_GPIO_PZR1_P6                        *((volatile  uint8_t *)(0x4266E098UL))
#define bFM_GPIO_PZR1_P7                          *((volatile  uint8_t *)(0x4266E09CUL))
#define bFM0P_GPIO_PZR1_P7                        *((volatile  uint8_t *)(0x4266E09CUL))
#define bFM_GPIO_PZR1_P8                          *((volatile  uint8_t *)(0x4266E0A0UL))
#define bFM0P_GPIO_PZR1_P8                        *((volatile  uint8_t *)(0x4266E0A0UL))
#define bFM_GPIO_PZR1_P9                          *((volatile  uint8_t *)(0x4266E0A4UL))
#define bFM0P_GPIO_PZR1_P9                        *((volatile  uint8_t *)(0x4266E0A4UL))
#define bFM_GPIO_PZR1_PA                          *((volatile  uint8_t *)(0x4266E0A8UL))
#define bFM0P_GPIO_PZR1_PA                        *((volatile  uint8_t *)(0x4266E0A8UL))
#define bFM_GPIO_PZR1_PB                          *((volatile  uint8_t *)(0x4266E0ACUL))
#define bFM0P_GPIO_PZR1_PB                        *((volatile  uint8_t *)(0x4266E0ACUL))
#define bFM_GPIO_PZR1_PC                          *((volatile  uint8_t *)(0x4266E0B0UL))
#define bFM0P_GPIO_PZR1_PC                        *((volatile  uint8_t *)(0x4266E0B0UL))
#define bFM_GPIO_PZR1_PD                          *((volatile  uint8_t *)(0x4266E0B4UL))
#define bFM0P_GPIO_PZR1_PD                        *((volatile  uint8_t *)(0x4266E0B4UL))
#define bFM_GPIO_PZR1_PE                          *((volatile  uint8_t *)(0x4266E0B8UL))
#define bFM0P_GPIO_PZR1_PE                        *((volatile  uint8_t *)(0x4266E0B8UL))

