mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xg/common/s6e1b8xg.h
#define bFM_INTREQ_IRQ23MON_PPGINT00              *((volatile  uint8_t *)(0x42620E00UL))
#define bFM0P_INTREQ_IRQ23MON_PPGINT00            *((volatile  uint8_t *)(0x42620E00UL))
#define bFM_INTREQ_IRQ23MON_PPGINT02              *((volatile  uint8_t *)(0x42620E04UL))
#define bFM0P_INTREQ_IRQ23MON_PPGINT02            *((volatile  uint8_t *)(0x42620E04UL))
#define bFM_INTREQ_IRQ23MON_PPGINT04              *((volatile  uint8_t *)(0x42620E08UL))
#define bFM0P_INTREQ_IRQ23MON_PPGINT04            *((volatile  uint8_t *)(0x42620E08UL))
#define bFM_INTREQ_IRQ23MON_RCEC0INT              *((volatile  uint8_t *)(0x42620E24UL))
#define bFM0P_INTREQ_IRQ23MON_RCEC0INT            *((volatile  uint8_t *)(0x42620E24UL))
#define bFM_INTREQ_IRQ23MON_ICC0INT               *((volatile  uint8_t *)(0x42620E28UL))
#define bFM0P_INTREQ_IRQ23MON_ICC0INT             *((volatile  uint8_t *)(0x42620E28UL))

#define bFM_INTREQ_IRQ24MON_MOSCINT               *((volatile  uint8_t *)(0x42620E80UL))
#define bFM0P_INTREQ_IRQ24MON_MOSCINT             *((volatile  uint8_t *)(0x42620E80UL))
#define bFM_INTREQ_IRQ24MON_SOSCINT               *((volatile  uint8_t *)(0x42620E84UL))
#define bFM0P_INTREQ_IRQ24MON_SOSCINT             *((volatile  uint8_t *)(0x42620E84UL))
#define bFM_INTREQ_IRQ24MON_MPLLINT               *((volatile  uint8_t *)(0x42620E88UL))
#define bFM0P_INTREQ_IRQ24MON_MPLLINT             *((volatile  uint8_t *)(0x42620E88UL))
#define bFM_INTREQ_IRQ24MON_UPLLINT               *((volatile  uint8_t *)(0x42620E8CUL))
#define bFM0P_INTREQ_IRQ24MON_UPLLINT             *((volatile  uint8_t *)(0x42620E8CUL))
#define bFM_INTREQ_IRQ24MON_WCINT                 *((volatile  uint8_t *)(0x42620E90UL))
#define bFM0P_INTREQ_IRQ24MON_WCINT               *((volatile  uint8_t *)(0x42620E90UL))
#define bFM_INTREQ_IRQ24MON_RTCINT                *((volatile  uint8_t *)(0x42620E94UL))
#define bFM0P_INTREQ_IRQ24MON_RTCINT              *((volatile  uint8_t *)(0x42620E94UL))
#define bFM_INTREQ_IRQ24MON_RCEC1INT              *((volatile  uint8_t *)(0x42620EA4UL))
#define bFM0P_INTREQ_IRQ24MON_RCEC1INT            *((volatile  uint8_t *)(0x42620EA4UL))
#define bFM_INTREQ_IRQ24MON_ICC1INT               *((volatile  uint8_t *)(0x42620EA8UL))
#define bFM0P_INTREQ_IRQ24MON_ICC1INT             *((volatile  uint8_t *)(0x42620EA8UL))

#define bFM_INTREQ_IRQ25MON_ADCINT0               *((volatile  uint8_t *)(0x42620F00UL))
#define bFM0P_INTREQ_IRQ25MON_ADCINT0             *((volatile  uint8_t *)(0x42620F00UL))
#define bFM_INTREQ_IRQ25MON_ADCINT1               *((volatile  uint8_t *)(0x42620F04UL))
#define bFM0P_INTREQ_IRQ25MON_ADCINT1             *((volatile  uint8_t *)(0x42620F04UL))
#define bFM_INTREQ_IRQ25MON_ADCINT2               *((volatile  uint8_t *)(0x42620F08UL))
#define bFM0P_INTREQ_IRQ25MON_ADCINT2             *((volatile  uint8_t *)(0x42620F08UL))
#define bFM_INTREQ_IRQ25MON_ADCINT3               *((volatile  uint8_t *)(0x42620F0CUL))
#define bFM0P_INTREQ_IRQ25MON_ADCINT3             *((volatile  uint8_t *)(0x42620F0CUL))
#define bFM_INTREQ_IRQ25MON_ADCINT4               *((volatile  uint8_t *)(0x42620F10UL))
#define bFM0P_INTREQ_IRQ25MON_ADCINT4             *((volatile  uint8_t *)(0x42620F10UL))

#define bFM_INTREQ_IRQ26MON_USB_INT0              *((volatile  uint8_t *)(0x42620F80UL))
#define bFM0P_INTREQ_IRQ26MON_USB_INT0            *((volatile  uint8_t *)(0x42620F80UL))
#define bFM_INTREQ_IRQ26MON_USB_INT1              *((volatile  uint8_t *)(0x42620F84UL))
#define bFM0P_INTREQ_IRQ26MON_USB_INT1            *((volatile  uint8_t *)(0x42620F84UL))
#define bFM_INTREQ_IRQ26MON_USB_INT2              *((volatile  uint8_t *)(0x42620F88UL))
#define bFM0P_INTREQ_IRQ26MON_USB_INT2            *((volatile  uint8_t *)(0x42620F88UL))
#define bFM_INTREQ_IRQ26MON_USB_INT3              *((volatile  uint8_t *)(0x42620F8CUL))
#define bFM0P_INTREQ_IRQ26MON_USB_INT3            *((volatile  uint8_t *)(0x42620F8CUL))
#define bFM_INTREQ_IRQ26MON_USB_INT4              *((volatile  uint8_t *)(0x42620F90UL))
#define bFM0P_INTREQ_IRQ26MON_USB_INT4            *((volatile  uint8_t *)(0x42620F90UL))
#define bFM_INTREQ_IRQ26MON_USB_INT5              *((volatile  uint8_t *)(0x42620F94UL))
#define bFM0P_INTREQ_IRQ26MON_USB_INT5            *((volatile  uint8_t *)(0x42620F94UL))

#define bFM_INTREQ_IRQ27MON_LCDCINT               *((volatile  uint8_t *)(0x42621014UL))
#define bFM0P_INTREQ_IRQ27MON_LCDCINT             *((volatile  uint8_t *)(0x42621014UL))

#define bFM_INTREQ_IRQ28MON_FRT_PEAK_INT0         *((volatile  uint8_t *)(0x42621080UL))
#define bFM0P_INTREQ_IRQ28MON_FRT_PEAK_INT0       *((volatile  uint8_t *)(0x42621080UL))
#define bFM_INTREQ_IRQ28MON_FRT_PEAK_INT1         *((volatile  uint8_t *)(0x42621084UL))
#define bFM0P_INTREQ_IRQ28MON_FRT_PEAK_INT1       *((volatile  uint8_t *)(0x42621084UL))
#define bFM_INTREQ_IRQ28MON_FRT_PEAK_INT2         *((volatile  uint8_t *)(0x42621088UL))
#define bFM0P_INTREQ_IRQ28MON_FRT_PEAK_INT2       *((volatile  uint8_t *)(0x42621088UL))
#define bFM_INTREQ_IRQ28MON_FRT_ZERO_INT0         *((volatile  uint8_t *)(0x4262108CUL))
#define bFM0P_INTREQ_IRQ28MON_FRT_ZERO_INT0       *((volatile  uint8_t *)(0x4262108CUL))
#define bFM_INTREQ_IRQ28MON_FRT_ZERO_INT1         *((volatile  uint8_t *)(0x42621090UL))
#define bFM0P_INTREQ_IRQ28MON_FRT_ZERO_INT1       *((volatile  uint8_t *)(0x42621090UL))
#define bFM_INTREQ_IRQ28MON_FRT_ZERO_INT2         *((volatile  uint8_t *)(0x42621094UL))
#define bFM0P_INTREQ_IRQ28MON_FRT_ZERO_INT2       *((volatile  uint8_t *)(0x42621094UL))

#define bFM_INTREQ_IRQ29MON_ICU0INT0              *((volatile  uint8_t *)(0x42621100UL))
#define bFM0P_INTREQ_IRQ29MON_ICU0INT0            *((volatile  uint8_t *)(0x42621100UL))
#define bFM_INTREQ_IRQ29MON_ICU0INT1              *((volatile  uint8_t *)(0x42621104UL))
#define bFM0P_INTREQ_IRQ29MON_ICU0INT1            *((volatile  uint8_t *)(0x42621104UL))
#define bFM_INTREQ_IRQ29MON_ICU0INT2              *((volatile  uint8_t *)(0x42621108UL))
#define bFM0P_INTREQ_IRQ29MON_ICU0INT2            *((volatile  uint8_t *)(0x42621108UL))
#define bFM_INTREQ_IRQ29MON_ICU0INT3              *((volatile  uint8_t *)(0x4262110CUL))
#define bFM0P_INTREQ_IRQ29MON_ICU0INT3            *((volatile  uint8_t *)(0x4262110CUL))
#define bFM_INTREQ_IRQ29MON_USB0_DRQ_INT0         *((volatile  uint8_t *)(0x42621110UL))
#define bFM0P_INTREQ_IRQ29MON_USB0_DRQ_INT0       *((volatile  uint8_t *)(0x42621110UL))
#define bFM_INTREQ_IRQ29MON_USB0_DRQ_INT1         *((volatile  uint8_t *)(0x42621114UL))
#define bFM0P_INTREQ_IRQ29MON_USB0_DRQ_INT1       *((volatile  uint8_t *)(0x42621114UL))
#define bFM_INTREQ_IRQ29MON_USB0_DRQ_INT2         *((volatile  uint8_t *)(0x42621118UL))
#define bFM0P_INTREQ_IRQ29MON_USB0_DRQ_INT2       *((volatile  uint8_t *)(0x42621118UL))
#define bFM_INTREQ_IRQ29MON_USB0_DRQ_INT3         *((volatile  uint8_t *)(0x4262111CUL))
#define bFM0P_INTREQ_IRQ29MON_USB0_DRQ_INT3       *((volatile  uint8_t *)(0x4262111CUL))
#define bFM_INTREQ_IRQ29MON_USB0_DRQ_INT4         *((volatile  uint8_t *)(0x42621120UL))
#define bFM0P_INTREQ_IRQ29MON_USB0_DRQ_INT4       *((volatile  uint8_t *)(0x42621120UL))

