mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xg/common/s6e1b8xg.h
#define bFM_INTREQ_IRQ30MON_OCU0INT0              *((volatile  uint8_t *)(0x42621180UL))
#define bFM0P_INTREQ_IRQ30MON_OCU0INT0            *((volatile  uint8_t *)(0x42621180UL))
#define bFM_INTREQ_IRQ30MON_OCU0INT1              *((volatile  uint8_t *)(0x42621184UL))
#define bFM0P_INTREQ_IRQ30MON_OCU0INT1            *((volatile  uint8_t *)(0x42621184UL))
#define bFM_INTREQ_IRQ30MON_OCU0INT2              *((volatile  uint8_t *)(0x42621188UL))
#define bFM0P_INTREQ_IRQ30MON_OCU0INT2            *((volatile  uint8_t *)(0x42621188UL))
#define bFM_INTREQ_IRQ30MON_OCU0INT3              *((volatile  uint8_t *)(0x4262118CUL))
#define bFM0P_INTREQ_IRQ30MON_OCU0INT3            *((volatile  uint8_t *)(0x4262118CUL))
#define bFM_INTREQ_IRQ30MON_OCU0INT4              *((volatile  uint8_t *)(0x42621190UL))
#define bFM0P_INTREQ_IRQ30MON_OCU0INT4            *((volatile  uint8_t *)(0x42621190UL))
#define bFM_INTREQ_IRQ30MON_OCU0INT5              *((volatile  uint8_t *)(0x42621194UL))
#define bFM0P_INTREQ_IRQ30MON_OCU0INT5            *((volatile  uint8_t *)(0x42621194UL))

#define bFM_INTREQ_IRQ31MON_BTINT0                *((volatile  uint8_t *)(0x42621200UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT0              *((volatile  uint8_t *)(0x42621200UL))
#define bFM_INTREQ_IRQ31MON_BTINT1                *((volatile  uint8_t *)(0x42621204UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT1              *((volatile  uint8_t *)(0x42621204UL))
#define bFM_INTREQ_IRQ31MON_BTINT2                *((volatile  uint8_t *)(0x42621208UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT2              *((volatile  uint8_t *)(0x42621208UL))
#define bFM_INTREQ_IRQ31MON_BTINT3                *((volatile  uint8_t *)(0x4262120CUL))
#define bFM0P_INTREQ_IRQ31MON_BTINT3              *((volatile  uint8_t *)(0x4262120CUL))
#define bFM_INTREQ_IRQ31MON_BTINT4                *((volatile  uint8_t *)(0x42621210UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT4              *((volatile  uint8_t *)(0x42621210UL))
#define bFM_INTREQ_IRQ31MON_BTINT5                *((volatile  uint8_t *)(0x42621214UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT5              *((volatile  uint8_t *)(0x42621214UL))
#define bFM_INTREQ_IRQ31MON_BTINT6                *((volatile  uint8_t *)(0x42621218UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT6              *((volatile  uint8_t *)(0x42621218UL))
#define bFM_INTREQ_IRQ31MON_BTINT7                *((volatile  uint8_t *)(0x4262121CUL))
#define bFM0P_INTREQ_IRQ31MON_BTINT7              *((volatile  uint8_t *)(0x4262121CUL))
#define bFM_INTREQ_IRQ31MON_BTINT8                *((volatile  uint8_t *)(0x42621220UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT8              *((volatile  uint8_t *)(0x42621220UL))
#define bFM_INTREQ_IRQ31MON_BTINT9                *((volatile  uint8_t *)(0x42621224UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT9              *((volatile  uint8_t *)(0x42621224UL))
#define bFM_INTREQ_IRQ31MON_BTINT10               *((volatile  uint8_t *)(0x42621228UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT10             *((volatile  uint8_t *)(0x42621228UL))
#define bFM_INTREQ_IRQ31MON_BTINT11               *((volatile  uint8_t *)(0x4262122CUL))
#define bFM0P_INTREQ_IRQ31MON_BTINT11             *((volatile  uint8_t *)(0x4262122CUL))
#define bFM_INTREQ_IRQ31MON_BTINT12               *((volatile  uint8_t *)(0x42621230UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT12             *((volatile  uint8_t *)(0x42621230UL))
#define bFM_INTREQ_IRQ31MON_BTINT13               *((volatile  uint8_t *)(0x42621234UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT13             *((volatile  uint8_t *)(0x42621234UL))
#define bFM_INTREQ_IRQ31MON_BTINT14               *((volatile  uint8_t *)(0x42621238UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT14             *((volatile  uint8_t *)(0x42621238UL))
#define bFM_INTREQ_IRQ31MON_BTINT15               *((volatile  uint8_t *)(0x4262123CUL))
#define bFM0P_INTREQ_IRQ31MON_BTINT15             *((volatile  uint8_t *)(0x4262123CUL))
#define bFM_INTREQ_IRQ31MON_FLASHINT              *((volatile  uint8_t *)(0x4262126CUL))
#define bFM0P_INTREQ_IRQ31MON_FLASHINT            *((volatile  uint8_t *)(0x4262126CUL))

#define bFM_INTREQ_IRQCMODE_IRQCMODE              *((volatile  uint8_t *)(0x42620180UL))
#define bFM0P_INTREQ_IRQCMODE_IRQCMODE            *((volatile  uint8_t *)(0x42620180UL))


/*******************************************************************************
* LCDC Registers LCDC
*   Bitband Section
*******************************************************************************/
#define bFM_LCDC_LCDC_BLINK_BLD00                 *((volatile  uint8_t *)(0x42640280UL))
#define bFM0P_LCDC_LCDC_BLINK_BLD00               *((volatile  uint8_t *)(0x42640280UL))
#define bFM_LCDC_LCDC_BLINK_BLD01                 *((volatile  uint8_t *)(0x42640284UL))
#define bFM0P_LCDC_LCDC_BLINK_BLD01               *((volatile  uint8_t *)(0x42640284UL))
#define bFM_LCDC_LCDC_BLINK_BLD02                 *((volatile  uint8_t *)(0x42640288UL))
#define bFM0P_LCDC_LCDC_BLINK_BLD02               *((volatile  uint8_t *)(0x42640288UL))
#define bFM_LCDC_LCDC_BLINK_BLD03                 *((volatile  uint8_t *)(0x4264028CUL))
#define bFM0P_LCDC_LCDC_BLINK_BLD03               *((volatile  uint8_t *)(0x4264028CUL))
#define bFM_LCDC_LCDC_BLINK_BLD04                 *((volatile  uint8_t *)(0x42640290UL))
#define bFM0P_LCDC_LCDC_BLINK_BLD04               *((volatile  uint8_t *)(0x42640290UL))
#define bFM_LCDC_LCDC_BLINK_BLD05                 *((volatile  uint8_t *)(0x42640294UL))
#define bFM0P_LCDC_LCDC_BLINK_BLD05               *((volatile  uint8_t *)(0x42640294UL))
#define bFM_LCDC_LCDC_BLINK_BLD06                 *((volatile  uint8_t *)(0x42640298UL))
#define bFM0P_LCDC_LCDC_BLINK_BLD06               *((volatile  uint8_t *)(0x42640298UL))
#define bFM_LCDC_LCDC_BLINK_BLD07                 *((volatile  uint8_t *)(0x4264029CUL))
#define bFM0P_LCDC_LCDC_BLINK_BLD07               *((volatile  uint8_t *)(0x4264029CUL))
#define bFM_LCDC_LCDC_BLINK_BLD08                 *((volatile  uint8_t *)(0x426402A0UL))
#define bFM0P_LCDC_LCDC_BLINK_BLD08               *((volatile  uint8_t *)(0x426402A0UL))
#define bFM_LCDC_LCDC_BLINK_BLD09                 *((volatile  uint8_t *)(0x426402A4UL))
#define bFM0P_LCDC_LCDC_BLINK_BLD09               *((volatile  uint8_t *)(0x426402A4UL))
#define bFM_LCDC_LCDC_BLINK_BLD10                 *((volatile  uint8_t *)(0x426402A8UL))
#define bFM0P_LCDC_LCDC_BLINK_BLD10               *((volatile  uint8_t *)(0x426402A8UL))
#define bFM_LCDC_LCDC_BLINK_BLD11                 *((volatile  uint8_t *)(0x426402ACUL))
#define bFM0P_LCDC_LCDC_BLINK_BLD11               *((volatile  uint8_t *)(0x426402ACUL))
#define bFM_LCDC_LCDC_BLINK_BLD12                 *((volatile  uint8_t *)(0x426402B0UL))
#define bFM0P_LCDC_LCDC_BLINK_BLD12               *((volatile  uint8_t *)(0x426402B0UL))
#define bFM_LCDC_LCDC_BLINK_BLD13                 *((volatile  uint8_t *)(0x426402B4UL))
#define bFM0P_LCDC_LCDC_BLINK_BLD13               *((volatile  uint8_t *)(0x426402B4UL))
#define bFM_LCDC_LCDC_BLINK_BLD14                 *((volatile  uint8_t *)(0x426402B8UL))
#define bFM0P_LCDC_LCDC_BLINK_BLD14               *((volatile  uint8_t *)(0x426402B8UL))
#define bFM_LCDC_LCDC_BLINK_BLD15                 *((volatile  uint8_t *)(0x426402BCUL))
#define bFM0P_LCDC_LCDC_BLINK_BLD15               *((volatile  uint8_t *)(0x426402BCUL))

#define bFM_LCDC_LCDC_BOOSTER_BSTOPT              *((volatile  uint8_t *)(0x42640300UL))
#define bFM0P_LCDC_LCDC_BOOSTER_BSTOPT            *((volatile  uint8_t *)(0x42640300UL))
#define bFM_LCDC_LCDC_BOOSTER_BSTPD               *((volatile  uint8_t *)(0x42640304UL))
#define bFM0P_LCDC_LCDC_BOOSTER_BSTPD             *((volatile  uint8_t *)(0x42640304UL))
#define bFM_LCDC_LCDC_BOOSTER_PSF                 *((volatile  uint8_t *)(0x42640308UL))
#define bFM0P_LCDC_LCDC_BOOSTER_PSF               *((volatile  uint8_t *)(0x42640308UL))
#define bFM_LCDC_LCDC_BOOSTER_CENSEL              *((volatile  uint8_t *)(0x4264030CUL))
#define bFM0P_LCDC_LCDC_BOOSTER_CENSEL            *((volatile  uint8_t *)(0x4264030CUL))

#define bFM_LCDC_LCDC_COMEN_COM0                  *((volatile  uint8_t *)(0x42640100UL))
#define bFM0P_LCDC_LCDC_COMEN_COM0                *((volatile  uint8_t *)(0x42640100UL))
#define bFM_LCDC_LCDC_COMEN_COM1                  *((volatile  uint8_t *)(0x42640104UL))
#define bFM0P_LCDC_LCDC_COMEN_COM1                *((volatile  uint8_t *)(0x42640104UL))
#define bFM_LCDC_LCDC_COMEN_COM2                  *((volatile  uint8_t *)(0x42640108UL))
#define bFM0P_LCDC_LCDC_COMEN_COM2                *((volatile  uint8_t *)(0x42640108UL))
#define bFM_LCDC_LCDC_COMEN_COM3                  *((volatile  uint8_t *)(0x4264010CUL))
#define bFM0P_LCDC_LCDC_COMEN_COM3                *((volatile  uint8_t *)(0x4264010CUL))
#define bFM_LCDC_LCDC_COMEN_COM4                  *((volatile  uint8_t *)(0x42640110UL))
#define bFM0P_LCDC_LCDC_COMEN_COM4                *((volatile  uint8_t *)(0x42640110UL))
#define bFM_LCDC_LCDC_COMEN_COM5                  *((volatile  uint8_t *)(0x42640114UL))
#define bFM0P_LCDC_LCDC_COMEN_COM5                *((volatile  uint8_t *)(0x42640114UL))
#define bFM_LCDC_LCDC_COMEN_COM6                  *((volatile  uint8_t *)(0x42640118UL))
#define bFM0P_LCDC_LCDC_COMEN_COM6                *((volatile  uint8_t *)(0x42640118UL))
#define bFM_LCDC_LCDC_COMEN_COM7                  *((volatile  uint8_t *)(0x4264011CUL))
#define bFM0P_LCDC_LCDC_COMEN_COM7                *((volatile  uint8_t *)(0x4264011CUL))

#define bFM_LCDC_LCDC_PSR_CLKSEL                  *((volatile  uint8_t *)(0x426400D8UL))
#define bFM0P_LCDC_LCDC_PSR_CLKSEL                *((volatile  uint8_t *)(0x426400D8UL))

#define bFM_LCDC_LCDC_SEGEN1_SEG00                *((volatile  uint8_t *)(0x42640180UL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG00              *((volatile  uint8_t *)(0x42640180UL))
#define bFM_LCDC_LCDC_SEGEN1_SEG01                *((volatile  uint8_t *)(0x42640184UL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG01              *((volatile  uint8_t *)(0x42640184UL))
#define bFM_LCDC_LCDC_SEGEN1_SEG02                *((volatile  uint8_t *)(0x42640188UL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG02              *((volatile  uint8_t *)(0x42640188UL))
#define bFM_LCDC_LCDC_SEGEN1_SEG03                *((volatile  uint8_t *)(0x4264018CUL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG03              *((volatile  uint8_t *)(0x4264018CUL))
#define bFM_LCDC_LCDC_SEGEN1_SEG04                *((volatile  uint8_t *)(0x42640190UL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG04              *((volatile  uint8_t *)(0x42640190UL))
#define bFM_LCDC_LCDC_SEGEN1_SEG05                *((volatile  uint8_t *)(0x42640194UL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG05              *((volatile  uint8_t *)(0x42640194UL))
#define bFM_LCDC_LCDC_SEGEN1_SEG06                *((volatile  uint8_t *)(0x42640198UL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG06              *((volatile  uint8_t *)(0x42640198UL))
#define bFM_LCDC_LCDC_SEGEN1_SEG07                *((volatile  uint8_t *)(0x4264019CUL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG07              *((volatile  uint8_t *)(0x4264019CUL))
#define bFM_LCDC_LCDC_SEGEN1_SEG08                *((volatile  uint8_t *)(0x426401A0UL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG08              *((volatile  uint8_t *)(0x426401A0UL))
#define bFM_LCDC_LCDC_SEGEN1_SEG09                *((volatile  uint8_t *)(0x426401A4UL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG09              *((volatile  uint8_t *)(0x426401A4UL))
#define bFM_LCDC_LCDC_SEGEN1_SEG10                *((volatile  uint8_t *)(0x426401A8UL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG10              *((volatile  uint8_t *)(0x426401A8UL))
#define bFM_LCDC_LCDC_SEGEN1_SEG11                *((volatile  uint8_t *)(0x426401ACUL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG11              *((volatile  uint8_t *)(0x426401ACUL))
#define bFM_LCDC_LCDC_SEGEN1_SEG12                *((volatile  uint8_t *)(0x426401B0UL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG12              *((volatile  uint8_t *)(0x426401B0UL))
#define bFM_LCDC_LCDC_SEGEN1_SEG13                *((volatile  uint8_t *)(0x426401B4UL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG13              *((volatile  uint8_t *)(0x426401B4UL))
#define bFM_LCDC_LCDC_SEGEN1_SEG14                *((volatile  uint8_t *)(0x426401B8UL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG14              *((volatile  uint8_t *)(0x426401B8UL))
#define bFM_LCDC_LCDC_SEGEN1_SEG15                *((volatile  uint8_t *)(0x426401BCUL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG15              *((volatile  uint8_t *)(0x426401BCUL))
#define bFM_LCDC_LCDC_SEGEN1_SEG16                *((volatile  uint8_t *)(0x426401C0UL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG16              *((volatile  uint8_t *)(0x426401C0UL))
#define bFM_LCDC_LCDC_SEGEN1_SEG17                *((volatile  uint8_t *)(0x426401C4UL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG17              *((volatile  uint8_t *)(0x426401C4UL))
#define bFM_LCDC_LCDC_SEGEN1_SEG18                *((volatile  uint8_t *)(0x426401C8UL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG18              *((volatile  uint8_t *)(0x426401C8UL))
#define bFM_LCDC_LCDC_SEGEN1_SEG19                *((volatile  uint8_t *)(0x426401CCUL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG19              *((volatile  uint8_t *)(0x426401CCUL))
#define bFM_LCDC_LCDC_SEGEN1_SEG20                *((volatile  uint8_t *)(0x426401D0UL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG20              *((volatile  uint8_t *)(0x426401D0UL))
#define bFM_LCDC_LCDC_SEGEN1_SEG21                *((volatile  uint8_t *)(0x426401D4UL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG21              *((volatile  uint8_t *)(0x426401D4UL))
#define bFM_LCDC_LCDC_SEGEN1_SEG22                *((volatile  uint8_t *)(0x426401D8UL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG22              *((volatile  uint8_t *)(0x426401D8UL))
#define bFM_LCDC_LCDC_SEGEN1_SEG23                *((volatile  uint8_t *)(0x426401DCUL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG23              *((volatile  uint8_t *)(0x426401DCUL))
#define bFM_LCDC_LCDC_SEGEN1_SEG24                *((volatile  uint8_t *)(0x426401E0UL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG24              *((volatile  uint8_t *)(0x426401E0UL))
#define bFM_LCDC_LCDC_SEGEN1_SEG25                *((volatile  uint8_t *)(0x426401E4UL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG25              *((volatile  uint8_t *)(0x426401E4UL))
#define bFM_LCDC_LCDC_SEGEN1_SEG26                *((volatile  uint8_t *)(0x426401E8UL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG26              *((volatile  uint8_t *)(0x426401E8UL))
#define bFM_LCDC_LCDC_SEGEN1_SEG27                *((volatile  uint8_t *)(0x426401ECUL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG27              *((volatile  uint8_t *)(0x426401ECUL))
#define bFM_LCDC_LCDC_SEGEN1_SEG28                *((volatile  uint8_t *)(0x426401F0UL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG28              *((volatile  uint8_t *)(0x426401F0UL))
#define bFM_LCDC_LCDC_SEGEN1_SEG29                *((volatile  uint8_t *)(0x426401F4UL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG29              *((volatile  uint8_t *)(0x426401F4UL))
#define bFM_LCDC_LCDC_SEGEN1_SEG30                *((volatile  uint8_t *)(0x426401F8UL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG30              *((volatile  uint8_t *)(0x426401F8UL))
#define bFM_LCDC_LCDC_SEGEN1_SEG31                *((volatile  uint8_t *)(0x426401FCUL))
#define bFM0P_LCDC_LCDC_SEGEN1_SEG31              *((volatile  uint8_t *)(0x426401FCUL))

#define bFM_LCDC_LCDC_SEGEN2_SEG32                *((volatile  uint8_t *)(0x42640200UL))
#define bFM0P_LCDC_LCDC_SEGEN2_SEG32              *((volatile  uint8_t *)(0x42640200UL))
#define bFM_LCDC_LCDC_SEGEN2_SEG33                *((volatile  uint8_t *)(0x42640204UL))
#define bFM0P_LCDC_LCDC_SEGEN2_SEG33              *((volatile  uint8_t *)(0x42640204UL))
#define bFM_LCDC_LCDC_SEGEN2_SEG34                *((volatile  uint8_t *)(0x42640208UL))
#define bFM0P_LCDC_LCDC_SEGEN2_SEG34              *((volatile  uint8_t *)(0x42640208UL))
#define bFM_LCDC_LCDC_SEGEN2_SEG35                *((volatile  uint8_t *)(0x4264020CUL))
#define bFM0P_LCDC_LCDC_SEGEN2_SEG35              *((volatile  uint8_t *)(0x4264020CUL))
#define bFM_LCDC_LCDC_SEGEN2_SEG36                *((volatile  uint8_t *)(0x42640210UL))
#define bFM0P_LCDC_LCDC_SEGEN2_SEG36              *((volatile  uint8_t *)(0x42640210UL))
#define bFM_LCDC_LCDC_SEGEN2_SEG37                *((volatile  uint8_t *)(0x42640214UL))
#define bFM0P_LCDC_LCDC_SEGEN2_SEG37              *((volatile  uint8_t *)(0x42640214UL))
#define bFM_LCDC_LCDC_SEGEN2_SEG38                *((volatile  uint8_t *)(0x42640218UL))
#define bFM0P_LCDC_LCDC_SEGEN2_SEG38              *((volatile  uint8_t *)(0x42640218UL))
#define bFM_LCDC_LCDC_SEGEN2_SEG39                *((volatile  uint8_t *)(0x4264021CUL))
#define bFM0P_LCDC_LCDC_SEGEN2_SEG39              *((volatile  uint8_t *)(0x4264021CUL))

#define bFM_LCDC_LCDCC1_VSEL                      *((volatile  uint8_t *)(0x42640014UL))
#define bFM0P_LCDC_LCDCC1_VSEL                    *((volatile  uint8_t *)(0x42640014UL))
#define bFM_LCDC_LCDCC1_LCDEN                     *((volatile  uint8_t *)(0x42640018UL))
#define bFM0P_LCDC_LCDCC1_LCDEN                   *((volatile  uint8_t *)(0x42640018UL))

#define bFM_LCDC_LCDCC2_LCDIF                     *((volatile  uint8_t *)(0x42640020UL))
#define bFM0P_LCDC_LCDCC2_LCDIF                   *((volatile  uint8_t *)(0x42640020UL))
#define bFM_LCDC_LCDCC2_LCDIEN                    *((volatile  uint8_t *)(0x42640024UL))
#define bFM0P_LCDC_LCDCC2_LCDIEN                  *((volatile  uint8_t *)(0x42640024UL))
#define bFM_LCDC_LCDCC2_BK                        *((volatile  uint8_t *)(0x42640028UL))
#define bFM0P_LCDC_LCDCC2_BK                      *((volatile  uint8_t *)(0x42640028UL))
#define bFM_LCDC_LCDCC2_INV                       *((volatile  uint8_t *)(0x4264002CUL))
#define bFM0P_LCDC_LCDCC2_INV                     *((volatile  uint8_t *)(0x4264002CUL))
#define bFM_LCDC_LCDCC2_BLS8                      *((volatile  uint8_t *)(0x42640030UL))
#define bFM0P_LCDC_LCDCC2_BLS8                    *((volatile  uint8_t *)(0x42640030UL))
#define bFM_LCDC_LCDCC2_RSEL                      *((volatile  uint8_t *)(0x42640034UL))
#define bFM0P_LCDC_LCDCC2_RSEL                    *((volatile  uint8_t *)(0x42640034UL))

